zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/**
 * \brief Component description for PIC32CZ/CA70 USBHS
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_USBHS_COMPONENT_H_
#define _PIC32CZ_CA70_USBHS_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_USBHS USB High-Speed Interface
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR USBHS */
/* ========================================================================== */

/* -------- USBHS_DEVDMANXTDSC : (USBHS Offset: 0x00) (R/W 32) Device DMA Channel Next Descriptor Address Register (n = 1) -------- */

typedef union
{
  struct
  {
    uint32_t NXT_DSC_ADD:32;            /**< bit:  0..31  Next Descriptor Address                       */
  };
  uint32_t w;
} __USBHS_DEVDMANXTDSC_bits_t;

#define USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos    (0)                                            /**< (USBHS_DEVDMANXTDSC) Next Descriptor Address Position */
#define USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Msk    (0xFFFFFFFFU << USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos)  /**< (USBHS_DEVDMANXTDSC) Next Descriptor Address Mask */
#define USBHS_DEVDMANXTDSC_NXT_DSC_ADD(value) (USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Msk & ((value) << USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos))
#define USBHS_DEVDMANXTDSC_Msk                (0xFFFFFFFFUL)                                 /**< (USBHS_DEVDMANXTDSC) Register Mask  */

/* -------- USBHS_DEVDMAADDRESS : (USBHS Offset: 0x04) (R/W 32) Device DMA Channel Address Register (n = 1) -------- */

typedef union
{
  struct
  {
    uint32_t BUFF_ADD:32;               /**< bit:  0..31  Buffer Address                                */
  };
  uint32_t w;
} __USBHS_DEVDMAADDRESS_bits_t;

#define USBHS_DEVDMAADDRESS_BUFF_ADD_Pos      (0)                                            /**< (USBHS_DEVDMAADDRESS) Buffer Address Position */
#define USBHS_DEVDMAADDRESS_BUFF_ADD_Msk      (0xFFFFFFFFU << USBHS_DEVDMAADDRESS_BUFF_ADD_Pos)  /**< (USBHS_DEVDMAADDRESS) Buffer Address Mask */
#define USBHS_DEVDMAADDRESS_BUFF_ADD(value)   (USBHS_DEVDMAADDRESS_BUFF_ADD_Msk & ((value) << USBHS_DEVDMAADDRESS_BUFF_ADD_Pos))
#define USBHS_DEVDMAADDRESS_Msk               (0xFFFFFFFFUL)                                 /**< (USBHS_DEVDMAADDRESS) Register Mask  */

/* -------- USBHS_DEVDMACONTROL : (USBHS Offset: 0x08) (R/W 32) Device DMA Channel Control Register (n = 1) -------- */

typedef union
{
  struct
  {
    uint32_t CHANN_ENB:1;               /**< bit:      0  Channel Enable Command                        */
    uint32_t LDNXT_DSC:1;               /**< bit:      1  Load Next Channel Transfer Descriptor Enable Command */
    uint32_t END_TR_EN:1;               /**< bit:      2  End of Transfer Enable Control (OUT transfers only) */
    uint32_t END_B_EN:1;                /**< bit:      3  End of Buffer Enable Control                  */
    uint32_t END_TR_IT:1;               /**< bit:      4  End of Transfer Interrupt Enable              */
    uint32_t END_BUFFIT:1;              /**< bit:      5  End of Buffer Interrupt Enable                */
    uint32_t DESC_LD_IT:1;              /**< bit:      6  Descriptor Loaded Interrupt Enable            */
    uint32_t BURST_LCK:1;               /**< bit:      7  Burst Lock Enable                             */
    uint32_t :8;                        /**< bit:  8..15  Reserved                                      */
    uint32_t BUFF_LENGTH:16;            /**< bit: 16..31  Buffer Byte Length (Write-only)               */
  };
  uint32_t w;
} __USBHS_DEVDMACONTROL_bits_t;

#define USBHS_DEVDMACONTROL_CHANN_ENB_Pos     (0)                                            /**< (USBHS_DEVDMACONTROL) Channel Enable Command Position */
#define USBHS_DEVDMACONTROL_CHANN_ENB_Msk     (0x1U << USBHS_DEVDMACONTROL_CHANN_ENB_Pos)    /**< (USBHS_DEVDMACONTROL) Channel Enable Command Mask */
#define USBHS_DEVDMACONTROL_LDNXT_DSC_Pos     (1)                                            /**< (USBHS_DEVDMACONTROL) Load Next Channel Transfer Descriptor Enable Command Position */
#define USBHS_DEVDMACONTROL_LDNXT_DSC_Msk     (0x1U << USBHS_DEVDMACONTROL_LDNXT_DSC_Pos)    /**< (USBHS_DEVDMACONTROL) Load Next Channel Transfer Descriptor Enable Command Mask */
#define USBHS_DEVDMACONTROL_END_TR_EN_Pos     (2)                                            /**< (USBHS_DEVDMACONTROL) End of Transfer Enable Control (OUT transfers only) Position */
#define USBHS_DEVDMACONTROL_END_TR_EN_Msk     (0x1U << USBHS_DEVDMACONTROL_END_TR_EN_Pos)    /**< (USBHS_DEVDMACONTROL) End of Transfer Enable Control (OUT transfers only) Mask */
#define USBHS_DEVDMACONTROL_END_B_EN_Pos      (3)                                            /**< (USBHS_DEVDMACONTROL) End of Buffer Enable Control Position */
#define USBHS_DEVDMACONTROL_END_B_EN_Msk      (0x1U << USBHS_DEVDMACONTROL_END_B_EN_Pos)     /**< (USBHS_DEVDMACONTROL) End of Buffer Enable Control Mask */
#define USBHS_DEVDMACONTROL_END_TR_IT_Pos     (4)                                            /**< (USBHS_DEVDMACONTROL) End of Transfer Interrupt Enable Position */
#define USBHS_DEVDMACONTROL_END_TR_IT_Msk     (0x1U << USBHS_DEVDMACONTROL_END_TR_IT_Pos)    /**< (USBHS_DEVDMACONTROL) End of Transfer Interrupt Enable Mask */
#define USBHS_DEVDMACONTROL_END_BUFFIT_Pos    (5)                                            /**< (USBHS_DEVDMACONTROL) End of Buffer Interrupt Enable Position */
#define USBHS_DEVDMACONTROL_END_BUFFIT_Msk    (0x1U << USBHS_DEVDMACONTROL_END_BUFFIT_Pos)   /**< (USBHS_DEVDMACONTROL) End of Buffer Interrupt Enable Mask */
#define USBHS_DEVDMACONTROL_DESC_LD_IT_Pos    (6)                                            /**< (USBHS_DEVDMACONTROL) Descriptor Loaded Interrupt Enable Position */
#define USBHS_DEVDMACONTROL_DESC_LD_IT_Msk    (0x1U << USBHS_DEVDMACONTROL_DESC_LD_IT_Pos)   /**< (USBHS_DEVDMACONTROL) Descriptor Loaded Interrupt Enable Mask */
#define USBHS_DEVDMACONTROL_BURST_LCK_Pos     (7)                                            /**< (USBHS_DEVDMACONTROL) Burst Lock Enable Position */
#define USBHS_DEVDMACONTROL_BURST_LCK_Msk     (0x1U << USBHS_DEVDMACONTROL_BURST_LCK_Pos)    /**< (USBHS_DEVDMACONTROL) Burst Lock Enable Mask */
#define USBHS_DEVDMACONTROL_BUFF_LENGTH_Pos   (16)                                           /**< (USBHS_DEVDMACONTROL) Buffer Byte Length (Write-only) Position */
#define USBHS_DEVDMACONTROL_BUFF_LENGTH_Msk   (0xFFFFU << USBHS_DEVDMACONTROL_BUFF_LENGTH_Pos)  /**< (USBHS_DEVDMACONTROL) Buffer Byte Length (Write-only) Mask */
#define USBHS_DEVDMACONTROL_BUFF_LENGTH(value) (USBHS_DEVDMACONTROL_BUFF_LENGTH_Msk & ((value) << USBHS_DEVDMACONTROL_BUFF_LENGTH_Pos))
#define USBHS_DEVDMACONTROL_Msk               (0xFFFF00FFUL)                                 /**< (USBHS_DEVDMACONTROL) Register Mask  */

/* -------- USBHS_DEVDMASTATUS : (USBHS Offset: 0x0c) (R/W 32) Device DMA Channel Status Register (n = 1) -------- */

typedef union
{
  struct
  {
    uint32_t CHANN_ENB:1;               /**< bit:      0  Channel Enable Status                         */
    uint32_t CHANN_ACT:1;               /**< bit:      1  Channel Active Status                         */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t END_TR_ST:1;               /**< bit:      4  End of Channel Transfer Status                */
    uint32_t END_BF_ST:1;               /**< bit:      5  End of Channel Buffer Status                  */
    uint32_t DESC_LDST:1;               /**< bit:      6  Descriptor Loaded Status                      */
    uint32_t :9;                        /**< bit:  7..15  Reserved                                      */
    uint32_t BUFF_COUNT:16;             /**< bit: 16..31  Buffer Byte Count                             */
  };
  uint32_t w;
} __USBHS_DEVDMASTATUS_bits_t;

#define USBHS_DEVDMASTATUS_CHANN_ENB_Pos      (0)                                            /**< (USBHS_DEVDMASTATUS) Channel Enable Status Position */
#define USBHS_DEVDMASTATUS_CHANN_ENB_Msk      (0x1U << USBHS_DEVDMASTATUS_CHANN_ENB_Pos)     /**< (USBHS_DEVDMASTATUS) Channel Enable Status Mask */
#define USBHS_DEVDMASTATUS_CHANN_ACT_Pos      (1)                                            /**< (USBHS_DEVDMASTATUS) Channel Active Status Position */
#define USBHS_DEVDMASTATUS_CHANN_ACT_Msk      (0x1U << USBHS_DEVDMASTATUS_CHANN_ACT_Pos)     /**< (USBHS_DEVDMASTATUS) Channel Active Status Mask */
#define USBHS_DEVDMASTATUS_END_TR_ST_Pos      (4)                                            /**< (USBHS_DEVDMASTATUS) End of Channel Transfer Status Position */
#define USBHS_DEVDMASTATUS_END_TR_ST_Msk      (0x1U << USBHS_DEVDMASTATUS_END_TR_ST_Pos)     /**< (USBHS_DEVDMASTATUS) End of Channel Transfer Status Mask */
#define USBHS_DEVDMASTATUS_END_BF_ST_Pos      (5)                                            /**< (USBHS_DEVDMASTATUS) End of Channel Buffer Status Position */
#define USBHS_DEVDMASTATUS_END_BF_ST_Msk      (0x1U << USBHS_DEVDMASTATUS_END_BF_ST_Pos)     /**< (USBHS_DEVDMASTATUS) End of Channel Buffer Status Mask */
#define USBHS_DEVDMASTATUS_DESC_LDST_Pos      (6)                                            /**< (USBHS_DEVDMASTATUS) Descriptor Loaded Status Position */
#define USBHS_DEVDMASTATUS_DESC_LDST_Msk      (0x1U << USBHS_DEVDMASTATUS_DESC_LDST_Pos)     /**< (USBHS_DEVDMASTATUS) Descriptor Loaded Status Mask */
#define USBHS_DEVDMASTATUS_BUFF_COUNT_Pos     (16)                                           /**< (USBHS_DEVDMASTATUS) Buffer Byte Count Position */
#define USBHS_DEVDMASTATUS_BUFF_COUNT_Msk     (0xFFFFU << USBHS_DEVDMASTATUS_BUFF_COUNT_Pos)  /**< (USBHS_DEVDMASTATUS) Buffer Byte Count Mask */
#define USBHS_DEVDMASTATUS_BUFF_COUNT(value)  (USBHS_DEVDMASTATUS_BUFF_COUNT_Msk & ((value) << USBHS_DEVDMASTATUS_BUFF_COUNT_Pos))
#define USBHS_DEVDMASTATUS_Msk                (0xFFFF0073UL)                                 /**< (USBHS_DEVDMASTATUS) Register Mask  */

/* -------- USBHS_HSTDMANXTDSC : (USBHS Offset: 0x00) (R/W 32) Host DMA Channel Next Descriptor Address Register (n = 1) -------- */

typedef union
{
  struct
  {
    uint32_t NXT_DSC_ADD:32;            /**< bit:  0..31  Next Descriptor Address                       */
  };
  uint32_t w;
} __USBHS_HSTDMANXTDSC_bits_t;

