zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos    (0)                                            /**< (USBHS_HSTDMANXTDSC) Next Descriptor Address Position */
#define USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Msk    (0xFFFFFFFFU << USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos)  /**< (USBHS_HSTDMANXTDSC) Next Descriptor Address Mask */
#define USBHS_HSTDMANXTDSC_NXT_DSC_ADD(value) (USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Msk & ((value) << USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos))
#define USBHS_HSTDMANXTDSC_Msk                (0xFFFFFFFFUL)                                 /**< (USBHS_HSTDMANXTDSC) Register Mask  */

/* -------- USBHS_HSTDMAADDRESS : (USBHS Offset: 0x04) (R/W 32) Host DMA Channel Address Register (n = 1) -------- */

typedef union
{
  struct
  {
    uint32_t BUFF_ADD:32;               /**< bit:  0..31  Buffer Address                                */
  };
  uint32_t w;
} __USBHS_HSTDMAADDRESS_bits_t;

#define USBHS_HSTDMAADDRESS_BUFF_ADD_Pos      (0)                                            /**< (USBHS_HSTDMAADDRESS) Buffer Address Position */
#define USBHS_HSTDMAADDRESS_BUFF_ADD_Msk      (0xFFFFFFFFU << USBHS_HSTDMAADDRESS_BUFF_ADD_Pos)  /**< (USBHS_HSTDMAADDRESS) Buffer Address Mask */
#define USBHS_HSTDMAADDRESS_BUFF_ADD(value)   (USBHS_HSTDMAADDRESS_BUFF_ADD_Msk & ((value) << USBHS_HSTDMAADDRESS_BUFF_ADD_Pos))
#define USBHS_HSTDMAADDRESS_Msk               (0xFFFFFFFFUL)                                 /**< (USBHS_HSTDMAADDRESS) Register Mask  */

/* -------- USBHS_HSTDMACONTROL : (USBHS Offset: 0x08) (R/W 32) Host DMA Channel Control Register (n = 1) -------- */

typedef union
{
  struct
  {
    uint32_t CHANN_ENB:1;               /**< bit:      0  Channel Enable Command                        */
    uint32_t LDNXT_DSC:1;               /**< bit:      1  Load Next Channel Transfer Descriptor Enable Command */
    uint32_t END_TR_EN:1;               /**< bit:      2  End of Transfer Enable Control (OUT transfers only) */
    uint32_t END_B_EN:1;                /**< bit:      3  End of Buffer Enable Control                  */
    uint32_t END_TR_IT:1;               /**< bit:      4  End of Transfer Interrupt Enable              */
    uint32_t END_BUFFIT:1;              /**< bit:      5  End of Buffer Interrupt Enable                */
    uint32_t DESC_LD_IT:1;              /**< bit:      6  Descriptor Loaded Interrupt Enable            */
    uint32_t BURST_LCK:1;               /**< bit:      7  Burst Lock Enable                             */
    uint32_t :8;                        /**< bit:  8..15  Reserved                                      */
    uint32_t BUFF_LENGTH:16;            /**< bit: 16..31  Buffer Byte Length (Write-only)               */
  };
  uint32_t w;
} __USBHS_HSTDMACONTROL_bits_t;

#define USBHS_HSTDMACONTROL_CHANN_ENB_Pos     (0)                                            /**< (USBHS_HSTDMACONTROL) Channel Enable Command Position */
#define USBHS_HSTDMACONTROL_CHANN_ENB_Msk     (0x1U << USBHS_HSTDMACONTROL_CHANN_ENB_Pos)    /**< (USBHS_HSTDMACONTROL) Channel Enable Command Mask */
#define USBHS_HSTDMACONTROL_LDNXT_DSC_Pos     (1)                                            /**< (USBHS_HSTDMACONTROL) Load Next Channel Transfer Descriptor Enable Command Position */
#define USBHS_HSTDMACONTROL_LDNXT_DSC_Msk     (0x1U << USBHS_HSTDMACONTROL_LDNXT_DSC_Pos)    /**< (USBHS_HSTDMACONTROL) Load Next Channel Transfer Descriptor Enable Command Mask */
#define USBHS_HSTDMACONTROL_END_TR_EN_Pos     (2)                                            /**< (USBHS_HSTDMACONTROL) End of Transfer Enable Control (OUT transfers only) Position */
#define USBHS_HSTDMACONTROL_END_TR_EN_Msk     (0x1U << USBHS_HSTDMACONTROL_END_TR_EN_Pos)    /**< (USBHS_HSTDMACONTROL) End of Transfer Enable Control (OUT transfers only) Mask */
#define USBHS_HSTDMACONTROL_END_B_EN_Pos      (3)                                            /**< (USBHS_HSTDMACONTROL) End of Buffer Enable Control Position */
#define USBHS_HSTDMACONTROL_END_B_EN_Msk      (0x1U << USBHS_HSTDMACONTROL_END_B_EN_Pos)     /**< (USBHS_HSTDMACONTROL) End of Buffer Enable Control Mask */
#define USBHS_HSTDMACONTROL_END_TR_IT_Pos     (4)                                            /**< (USBHS_HSTDMACONTROL) End of Transfer Interrupt Enable Position */
#define USBHS_HSTDMACONTROL_END_TR_IT_Msk     (0x1U << USBHS_HSTDMACONTROL_END_TR_IT_Pos)    /**< (USBHS_HSTDMACONTROL) End of Transfer Interrupt Enable Mask */
#define USBHS_HSTDMACONTROL_END_BUFFIT_Pos    (5)                                            /**< (USBHS_HSTDMACONTROL) End of Buffer Interrupt Enable Position */
#define USBHS_HSTDMACONTROL_END_BUFFIT_Msk    (0x1U << USBHS_HSTDMACONTROL_END_BUFFIT_Pos)   /**< (USBHS_HSTDMACONTROL) End of Buffer Interrupt Enable Mask */
#define USBHS_HSTDMACONTROL_DESC_LD_IT_Pos    (6)                                            /**< (USBHS_HSTDMACONTROL) Descriptor Loaded Interrupt Enable Position */
#define USBHS_HSTDMACONTROL_DESC_LD_IT_Msk    (0x1U << USBHS_HSTDMACONTROL_DESC_LD_IT_Pos)   /**< (USBHS_HSTDMACONTROL) Descriptor Loaded Interrupt Enable Mask */
#define USBHS_HSTDMACONTROL_BURST_LCK_Pos     (7)                                            /**< (USBHS_HSTDMACONTROL) Burst Lock Enable Position */
#define USBHS_HSTDMACONTROL_BURST_LCK_Msk     (0x1U << USBHS_HSTDMACONTROL_BURST_LCK_Pos)    /**< (USBHS_HSTDMACONTROL) Burst Lock Enable Mask */
#define USBHS_HSTDMACONTROL_BUFF_LENGTH_Pos   (16)                                           /**< (USBHS_HSTDMACONTROL) Buffer Byte Length (Write-only) Position */
#define USBHS_HSTDMACONTROL_BUFF_LENGTH_Msk   (0xFFFFU << USBHS_HSTDMACONTROL_BUFF_LENGTH_Pos)  /**< (USBHS_HSTDMACONTROL) Buffer Byte Length (Write-only) Mask */
#define USBHS_HSTDMACONTROL_BUFF_LENGTH(value) (USBHS_HSTDMACONTROL_BUFF_LENGTH_Msk & ((value) << USBHS_HSTDMACONTROL_BUFF_LENGTH_Pos))
#define USBHS_HSTDMACONTROL_Msk               (0xFFFF00FFUL)                                 /**< (USBHS_HSTDMACONTROL) Register Mask  */

/* -------- USBHS_HSTDMASTATUS : (USBHS Offset: 0x0c) (R/W 32) Host DMA Channel Status Register (n = 1) -------- */

typedef union
{
  struct
  {
    uint32_t CHANN_ENB:1;               /**< bit:      0  Channel Enable Status                         */
    uint32_t CHANN_ACT:1;               /**< bit:      1  Channel Active Status                         */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t END_TR_ST:1;               /**< bit:      4  End of Channel Transfer Status                */
    uint32_t END_BF_ST:1;               /**< bit:      5  End of Channel Buffer Status                  */
    uint32_t DESC_LDST:1;               /**< bit:      6  Descriptor Loaded Status                      */
    uint32_t :9;                        /**< bit:  7..15  Reserved                                      */
    uint32_t BUFF_COUNT:16;             /**< bit: 16..31  Buffer Byte Count                             */
  };
  uint32_t w;
} __USBHS_HSTDMASTATUS_bits_t;

#define USBHS_HSTDMASTATUS_CHANN_ENB_Pos      (0)                                            /**< (USBHS_HSTDMASTATUS) Channel Enable Status Position */
#define USBHS_HSTDMASTATUS_CHANN_ENB_Msk      (0x1U << USBHS_HSTDMASTATUS_CHANN_ENB_Pos)     /**< (USBHS_HSTDMASTATUS) Channel Enable Status Mask */
#define USBHS_HSTDMASTATUS_CHANN_ACT_Pos      (1)                                            /**< (USBHS_HSTDMASTATUS) Channel Active Status Position */
#define USBHS_HSTDMASTATUS_CHANN_ACT_Msk      (0x1U << USBHS_HSTDMASTATUS_CHANN_ACT_Pos)     /**< (USBHS_HSTDMASTATUS) Channel Active Status Mask */
#define USBHS_HSTDMASTATUS_END_TR_ST_Pos      (4)                                            /**< (USBHS_HSTDMASTATUS) End of Channel Transfer Status Position */
#define USBHS_HSTDMASTATUS_END_TR_ST_Msk      (0x1U << USBHS_HSTDMASTATUS_END_TR_ST_Pos)     /**< (USBHS_HSTDMASTATUS) End of Channel Transfer Status Mask */
#define USBHS_HSTDMASTATUS_END_BF_ST_Pos      (5)                                            /**< (USBHS_HSTDMASTATUS) End of Channel Buffer Status Position */
#define USBHS_HSTDMASTATUS_END_BF_ST_Msk      (0x1U << USBHS_HSTDMASTATUS_END_BF_ST_Pos)     /**< (USBHS_HSTDMASTATUS) End of Channel Buffer Status Mask */
#define USBHS_HSTDMASTATUS_DESC_LDST_Pos      (6)                                            /**< (USBHS_HSTDMASTATUS) Descriptor Loaded Status Position */
#define USBHS_HSTDMASTATUS_DESC_LDST_Msk      (0x1U << USBHS_HSTDMASTATUS_DESC_LDST_Pos)     /**< (USBHS_HSTDMASTATUS) Descriptor Loaded Status Mask */
#define USBHS_HSTDMASTATUS_BUFF_COUNT_Pos     (16)                                           /**< (USBHS_HSTDMASTATUS) Buffer Byte Count Position */
#define USBHS_HSTDMASTATUS_BUFF_COUNT_Msk     (0xFFFFU << USBHS_HSTDMASTATUS_BUFF_COUNT_Pos)  /**< (USBHS_HSTDMASTATUS) Buffer Byte Count Mask */
#define USBHS_HSTDMASTATUS_BUFF_COUNT(value)  (USBHS_HSTDMASTATUS_BUFF_COUNT_Msk & ((value) << USBHS_HSTDMASTATUS_BUFF_COUNT_Pos))
#define USBHS_HSTDMASTATUS_Msk                (0xFFFF0073UL)                                 /**< (USBHS_HSTDMASTATUS) Register Mask  */

/* -------- USBHS_DEVCTRL : (USBHS Offset: 0x00) (R/W 32) Device General Control Register -------- */

typedef union
{
  struct
  {
    uint32_t UADD:7;                    /**< bit:   0..6  USB Address                                   */
    uint32_t ADDEN:1;                   /**< bit:      7  Address Enable                                */
    uint32_t DETACH:1;                  /**< bit:      8  Detach                                        */
    uint32_t RMWKUP:1;                  /**< bit:      9  Remote Wake-Up                                */
    uint32_t SPDCONF:2;                 /**< bit: 10..11  Mode Configuration                            */
    uint32_t LS:1;                      /**< bit:     12  Low-Speed Mode Force                          */
    uint32_t TSTJ:1;                    /**< bit:     13  Test mode J                                   */
    uint32_t TSTK:1;                    /**< bit:     14  Test mode K                                   */
    uint32_t TSTPCKT:1;                 /**< bit:     15  Test packet mode                              */
    uint32_t OPMODE2:1;                 /**< bit:     16  Specific Operational mode                     */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVCTRL_bits_t;

