zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_DEVCTRL_UADD_Pos                (0)                                            /**< (USBHS_DEVCTRL) USB Address Position */
#define USBHS_DEVCTRL_UADD_Msk                (0x7FU << USBHS_DEVCTRL_UADD_Pos)              /**< (USBHS_DEVCTRL) USB Address Mask */
#define USBHS_DEVCTRL_UADD(value)             (USBHS_DEVCTRL_UADD_Msk & ((value) << USBHS_DEVCTRL_UADD_Pos))
#define USBHS_DEVCTRL_ADDEN_Pos               (7)                                            /**< (USBHS_DEVCTRL) Address Enable Position */
#define USBHS_DEVCTRL_ADDEN_Msk               (0x1U << USBHS_DEVCTRL_ADDEN_Pos)              /**< (USBHS_DEVCTRL) Address Enable Mask */
#define USBHS_DEVCTRL_DETACH_Pos              (8)                                            /**< (USBHS_DEVCTRL) Detach Position */
#define USBHS_DEVCTRL_DETACH_Msk              (0x1U << USBHS_DEVCTRL_DETACH_Pos)             /**< (USBHS_DEVCTRL) Detach Mask */
#define USBHS_DEVCTRL_RMWKUP_Pos              (9)                                            /**< (USBHS_DEVCTRL) Remote Wake-Up Position */
#define USBHS_DEVCTRL_RMWKUP_Msk              (0x1U << USBHS_DEVCTRL_RMWKUP_Pos)             /**< (USBHS_DEVCTRL) Remote Wake-Up Mask */
#define USBHS_DEVCTRL_SPDCONF_Pos             (10)                                           /**< (USBHS_DEVCTRL) Mode Configuration Position */
#define USBHS_DEVCTRL_SPDCONF_Msk             (0x3U << USBHS_DEVCTRL_SPDCONF_Pos)            /**< (USBHS_DEVCTRL) Mode Configuration Mask */
#define USBHS_DEVCTRL_SPDCONF(value)          (USBHS_DEVCTRL_SPDCONF_Msk & ((value) << USBHS_DEVCTRL_SPDCONF_Pos))
#define   USBHS_DEVCTRL_SPDCONF_NORMAL_Val    (0x0U)                                         /**< (USBHS_DEVCTRL) The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable.  */
#define   USBHS_DEVCTRL_SPDCONF_LOW_POWER_Val (0x1U)                                         /**< (USBHS_DEVCTRL) For a better consumption, if high speed is not needed.  */
#define   USBHS_DEVCTRL_SPDCONF_HIGH_SPEED_Val (0x2U)                                         /**< (USBHS_DEVCTRL) Forced high speed.  */
#define   USBHS_DEVCTRL_SPDCONF_FORCED_FS_Val (0x3U)                                         /**< (USBHS_DEVCTRL) The peripheral remains in Full-speed mode whatever the host speed capability.  */
#define USBHS_DEVCTRL_SPDCONF_NORMAL          (USBHS_DEVCTRL_SPDCONF_NORMAL_Val << USBHS_DEVCTRL_SPDCONF_Pos)  /**< (USBHS_DEVCTRL) The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable. Position  */
#define USBHS_DEVCTRL_SPDCONF_LOW_POWER       (USBHS_DEVCTRL_SPDCONF_LOW_POWER_Val << USBHS_DEVCTRL_SPDCONF_Pos)  /**< (USBHS_DEVCTRL) For a better consumption, if high speed is not needed. Position  */
#define USBHS_DEVCTRL_SPDCONF_HIGH_SPEED      (USBHS_DEVCTRL_SPDCONF_HIGH_SPEED_Val << USBHS_DEVCTRL_SPDCONF_Pos)  /**< (USBHS_DEVCTRL) Forced high speed. Position  */
#define USBHS_DEVCTRL_SPDCONF_FORCED_FS       (USBHS_DEVCTRL_SPDCONF_FORCED_FS_Val << USBHS_DEVCTRL_SPDCONF_Pos)  /**< (USBHS_DEVCTRL) The peripheral remains in Full-speed mode whatever the host speed capability. Position  */
#define USBHS_DEVCTRL_LS_Pos                  (12)                                           /**< (USBHS_DEVCTRL) Low-Speed Mode Force Position */
#define USBHS_DEVCTRL_LS_Msk                  (0x1U << USBHS_DEVCTRL_LS_Pos)                 /**< (USBHS_DEVCTRL) Low-Speed Mode Force Mask */
#define USBHS_DEVCTRL_TSTJ_Pos                (13)                                           /**< (USBHS_DEVCTRL) Test mode J Position */
#define USBHS_DEVCTRL_TSTJ_Msk                (0x1U << USBHS_DEVCTRL_TSTJ_Pos)               /**< (USBHS_DEVCTRL) Test mode J Mask */
#define USBHS_DEVCTRL_TSTK_Pos                (14)                                           /**< (USBHS_DEVCTRL) Test mode K Position */
#define USBHS_DEVCTRL_TSTK_Msk                (0x1U << USBHS_DEVCTRL_TSTK_Pos)               /**< (USBHS_DEVCTRL) Test mode K Mask */
#define USBHS_DEVCTRL_TSTPCKT_Pos             (15)                                           /**< (USBHS_DEVCTRL) Test packet mode Position */
#define USBHS_DEVCTRL_TSTPCKT_Msk             (0x1U << USBHS_DEVCTRL_TSTPCKT_Pos)            /**< (USBHS_DEVCTRL) Test packet mode Mask */
#define USBHS_DEVCTRL_OPMODE2_Pos             (16)                                           /**< (USBHS_DEVCTRL) Specific Operational mode Position */
#define USBHS_DEVCTRL_OPMODE2_Msk             (0x1U << USBHS_DEVCTRL_OPMODE2_Pos)            /**< (USBHS_DEVCTRL) Specific Operational mode Mask */
#define USBHS_DEVCTRL_Msk                     (0x0001FFFFUL)                                 /**< (USBHS_DEVCTRL) Register Mask  */

/* -------- USBHS_DEVISR : (USBHS Offset: 0x04) (R/ 32) Device Global Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t SUSP:1;                    /**< bit:      0  Suspend Interrupt                             */
    uint32_t MSOF:1;                    /**< bit:      1  Micro Start of Frame Interrupt                */
    uint32_t SOF:1;                     /**< bit:      2  Start of Frame Interrupt                      */
    uint32_t EORST:1;                   /**< bit:      3  End of Reset Interrupt                        */
    uint32_t WAKEUP:1;                  /**< bit:      4  Wake-Up Interrupt                             */
    uint32_t EORSM:1;                   /**< bit:      5  End of Resume Interrupt                       */
    uint32_t UPRSM:1;                   /**< bit:      6  Upstream Resume Interrupt                     */
    uint32_t :5;                        /**< bit:  7..11  Reserved                                      */
    uint32_t PEP_0:1;                   /**< bit:     12  Endpoint 0 Interrupt                          */
    uint32_t PEP_1:1;                   /**< bit:     13  Endpoint 1 Interrupt                          */
    uint32_t PEP_2:1;                   /**< bit:     14  Endpoint 2 Interrupt                          */
    uint32_t PEP_3:1;                   /**< bit:     15  Endpoint 3 Interrupt                          */
    uint32_t PEP_4:1;                   /**< bit:     16  Endpoint 4 Interrupt                          */
    uint32_t PEP_5:1;                   /**< bit:     17  Endpoint 5 Interrupt                          */
    uint32_t PEP_6:1;                   /**< bit:     18  Endpoint 6 Interrupt                          */
    uint32_t PEP_7:1;                   /**< bit:     19  Endpoint 7 Interrupt                          */
    uint32_t PEP_8:1;                   /**< bit:     20  Endpoint 8 Interrupt                          */
    uint32_t PEP_9:1;                   /**< bit:     21  Endpoint 9 Interrupt                          */
    uint32_t :3;                        /**< bit: 22..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt                       */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt                       */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt                       */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt                       */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt                       */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt                       */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt                       */
  };
  struct
  {
    uint32_t :12;                       /**< bit:  0..11  Reserved                                      */
    uint32_t PEP_:10;                   /**< bit: 12..21  Endpoint x Interrupt                          */
    uint32_t :3;                        /**< bit: 22..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt                       */
  };
  uint32_t w;
} __USBHS_DEVISR_bits_t;

#define USBHS_DEVISR_SUSP_Pos                 (0)                                            /**< (USBHS_DEVISR) Suspend Interrupt Position */
#define USBHS_DEVISR_SUSP_Msk                 (0x1U << USBHS_DEVISR_SUSP_Pos)                /**< (USBHS_DEVISR) Suspend Interrupt Mask */
#define USBHS_DEVISR_MSOF_Pos                 (1)                                            /**< (USBHS_DEVISR) Micro Start of Frame Interrupt Position */
#define USBHS_DEVISR_MSOF_Msk                 (0x1U << USBHS_DEVISR_MSOF_Pos)                /**< (USBHS_DEVISR) Micro Start of Frame Interrupt Mask */
#define USBHS_DEVISR_SOF_Pos                  (2)                                            /**< (USBHS_DEVISR) Start of Frame Interrupt Position */
#define USBHS_DEVISR_SOF_Msk                  (0x1U << USBHS_DEVISR_SOF_Pos)                 /**< (USBHS_DEVISR) Start of Frame Interrupt Mask */
#define USBHS_DEVISR_EORST_Pos                (3)                                            /**< (USBHS_DEVISR) End of Reset Interrupt Position */
#define USBHS_DEVISR_EORST_Msk                (0x1U << USBHS_DEVISR_EORST_Pos)               /**< (USBHS_DEVISR) End of Reset Interrupt Mask */
#define USBHS_DEVISR_WAKEUP_Pos               (4)                                            /**< (USBHS_DEVISR) Wake-Up Interrupt Position */
#define USBHS_DEVISR_WAKEUP_Msk               (0x1U << USBHS_DEVISR_WAKEUP_Pos)              /**< (USBHS_DEVISR) Wake-Up Interrupt Mask */
#define USBHS_DEVISR_EORSM_Pos                (5)                                            /**< (USBHS_DEVISR) End of Resume Interrupt Position */
#define USBHS_DEVISR_EORSM_Msk                (0x1U << USBHS_DEVISR_EORSM_Pos)               /**< (USBHS_DEVISR) End of Resume Interrupt Mask */
#define USBHS_DEVISR_UPRSM_Pos                (6)                                            /**< (USBHS_DEVISR) Upstream Resume Interrupt Position */
#define USBHS_DEVISR_UPRSM_Msk                (0x1U << USBHS_DEVISR_UPRSM_Pos)               /**< (USBHS_DEVISR) Upstream Resume Interrupt Mask */
#define USBHS_DEVISR_PEP_0_Pos                (12)                                           /**< (USBHS_DEVISR) Endpoint 0 Interrupt Position */
#define USBHS_DEVISR_PEP_0_Msk                (0x1U << USBHS_DEVISR_PEP_0_Pos)               /**< (USBHS_DEVISR) Endpoint 0 Interrupt Mask */
#define USBHS_DEVISR_PEP_1_Pos                (13)                                           /**< (USBHS_DEVISR) Endpoint 1 Interrupt Position */
#define USBHS_DEVISR_PEP_1_Msk                (0x1U << USBHS_DEVISR_PEP_1_Pos)               /**< (USBHS_DEVISR) Endpoint 1 Interrupt Mask */
#define USBHS_DEVISR_PEP_2_Pos                (14)                                           /**< (USBHS_DEVISR) Endpoint 2 Interrupt Position */
#define USBHS_DEVISR_PEP_2_Msk                (0x1U << USBHS_DEVISR_PEP_2_Pos)               /**< (USBHS_DEVISR) Endpoint 2 Interrupt Mask */
#define USBHS_DEVISR_PEP_3_Pos                (15)                                           /**< (USBHS_DEVISR) Endpoint 3 Interrupt Position */
#define USBHS_DEVISR_PEP_3_Msk                (0x1U << USBHS_DEVISR_PEP_3_Pos)               /**< (USBHS_DEVISR) Endpoint 3 Interrupt Mask */
#define USBHS_DEVISR_PEP_4_Pos                (16)                                           /**< (USBHS_DEVISR) Endpoint 4 Interrupt Position */
#define USBHS_DEVISR_PEP_4_Msk                (0x1U << USBHS_DEVISR_PEP_4_Pos)               /**< (USBHS_DEVISR) Endpoint 4 Interrupt Mask */
#define USBHS_DEVISR_PEP_5_Pos                (17)                                           /**< (USBHS_DEVISR) Endpoint 5 Interrupt Position */
#define USBHS_DEVISR_PEP_5_Msk                (0x1U << USBHS_DEVISR_PEP_5_Pos)               /**< (USBHS_DEVISR) Endpoint 5 Interrupt Mask */
#define USBHS_DEVISR_PEP_6_Pos                (18)                                           /**< (USBHS_DEVISR) Endpoint 6 Interrupt Position */
#define USBHS_DEVISR_PEP_6_Msk                (0x1U << USBHS_DEVISR_PEP_6_Pos)               /**< (USBHS_DEVISR) Endpoint 6 Interrupt Mask */
#define USBHS_DEVISR_PEP_7_Pos                (19)                                           /**< (USBHS_DEVISR) Endpoint 7 Interrupt Position */
#define USBHS_DEVISR_PEP_7_Msk                (0x1U << USBHS_DEVISR_PEP_7_Pos)               /**< (USBHS_DEVISR) Endpoint 7 Interrupt Mask */
#define USBHS_DEVISR_PEP_8_Pos                (20)                                           /**< (USBHS_DEVISR) Endpoint 8 Interrupt Position */
#define USBHS_DEVISR_PEP_8_Msk                (0x1U << USBHS_DEVISR_PEP_8_Pos)               /**< (USBHS_DEVISR) Endpoint 8 Interrupt Mask */
#define USBHS_DEVISR_PEP_9_Pos                (21)                                           /**< (USBHS_DEVISR) Endpoint 9 Interrupt Position */
#define USBHS_DEVISR_PEP_9_Msk                (0x1U << USBHS_DEVISR_PEP_9_Pos)               /**< (USBHS_DEVISR) Endpoint 9 Interrupt Mask */
#define USBHS_DEVISR_DMA_1_Pos                (25)                                           /**< (USBHS_DEVISR) DMA Channel 1 Interrupt Position */
#define USBHS_DEVISR_DMA_1_Msk                (0x1U << USBHS_DEVISR_DMA_1_Pos)               /**< (USBHS_DEVISR) DMA Channel 1 Interrupt Mask */
#define USBHS_DEVISR_DMA_2_Pos                (26)                                           /**< (USBHS_DEVISR) DMA Channel 2 Interrupt Position */
#define USBHS_DEVISR_DMA_2_Msk                (0x1U << USBHS_DEVISR_DMA_2_Pos)               /**< (USBHS_DEVISR) DMA Channel 2 Interrupt Mask */
#define USBHS_DEVISR_DMA_3_Pos                (27)                                           /**< (USBHS_DEVISR) DMA Channel 3 Interrupt Position */
#define USBHS_DEVISR_DMA_3_Msk                (0x1U << USBHS_DEVISR_DMA_3_Pos)               /**< (USBHS_DEVISR) DMA Channel 3 Interrupt Mask */
#define USBHS_DEVISR_DMA_4_Pos                (28)                                           /**< (USBHS_DEVISR) DMA Channel 4 Interrupt Position */
#define USBHS_DEVISR_DMA_4_Msk                (0x1U << USBHS_DEVISR_DMA_4_Pos)               /**< (USBHS_DEVISR) DMA Channel 4 Interrupt Mask */
#define USBHS_DEVISR_DMA_5_Pos                (29)                                           /**< (USBHS_DEVISR) DMA Channel 5 Interrupt Position */
#define USBHS_DEVISR_DMA_5_Msk                (0x1U << USBHS_DEVISR_DMA_5_Pos)               /**< (USBHS_DEVISR) DMA Channel 5 Interrupt Mask */
#define USBHS_DEVISR_DMA_6_Pos                (30)                                           /**< (USBHS_DEVISR) DMA Channel 6 Interrupt Position */
#define USBHS_DEVISR_DMA_6_Msk                (0x1U << USBHS_DEVISR_DMA_6_Pos)               /**< (USBHS_DEVISR) DMA Channel 6 Interrupt Mask */
#define USBHS_DEVISR_DMA_7_Pos                (31)                                           /**< (USBHS_DEVISR) DMA Channel 7 Interrupt Position */
#define USBHS_DEVISR_DMA_7_Msk                (0x1U << USBHS_DEVISR_DMA_7_Pos)               /**< (USBHS_DEVISR) DMA Channel 7 Interrupt Mask */
#define USBHS_DEVISR_Msk                      (0xFE3FF07FUL)                                 /**< (USBHS_DEVISR) Register Mask  */
#define USBHS_DEVISR_PEP__Pos                 (12)                                           /**< (USBHS_DEVISR Position) Endpoint x Interrupt */
#define USBHS_DEVISR_PEP__Msk                 (0x3FFU << USBHS_DEVISR_PEP__Pos)              /**< (USBHS_DEVISR Mask) PEP_ */
#define USBHS_DEVISR_PEP_(value)              (USBHS_DEVISR_PEP__Msk & ((value) << USBHS_DEVISR_PEP__Pos))
#define USBHS_DEVISR_DMA__Pos                 (25)                                           /**< (USBHS_DEVISR Position) DMA Channel 7 Interrupt */
#define USBHS_DEVISR_DMA__Msk                 (0x7FU << USBHS_DEVISR_DMA__Pos)               /**< (USBHS_DEVISR Mask) DMA_ */
#define USBHS_DEVISR_DMA_(value)              (USBHS_DEVISR_DMA__Msk & ((value) << USBHS_DEVISR_DMA__Pos))

