zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_DEVICR : (USBHS Offset: 0x08) (/W 32) Device Global Interrupt Clear Register -------- */

typedef union
{
  struct
  {
    uint32_t SUSPC:1;                   /**< bit:      0  Suspend Interrupt Clear                       */
    uint32_t MSOFC:1;                   /**< bit:      1  Micro Start of Frame Interrupt Clear          */
    uint32_t SOFC:1;                    /**< bit:      2  Start of Frame Interrupt Clear                */
    uint32_t EORSTC:1;                  /**< bit:      3  End of Reset Interrupt Clear                  */
    uint32_t WAKEUPC:1;                 /**< bit:      4  Wake-Up Interrupt Clear                       */
    uint32_t EORSMC:1;                  /**< bit:      5  End of Resume Interrupt Clear                 */
    uint32_t UPRSMC:1;                  /**< bit:      6  Upstream Resume Interrupt Clear               */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVICR_bits_t;

#define USBHS_DEVICR_SUSPC_Pos                (0)                                            /**< (USBHS_DEVICR) Suspend Interrupt Clear Position */
#define USBHS_DEVICR_SUSPC_Msk                (0x1U << USBHS_DEVICR_SUSPC_Pos)               /**< (USBHS_DEVICR) Suspend Interrupt Clear Mask */
#define USBHS_DEVICR_MSOFC_Pos                (1)                                            /**< (USBHS_DEVICR) Micro Start of Frame Interrupt Clear Position */
#define USBHS_DEVICR_MSOFC_Msk                (0x1U << USBHS_DEVICR_MSOFC_Pos)               /**< (USBHS_DEVICR) Micro Start of Frame Interrupt Clear Mask */
#define USBHS_DEVICR_SOFC_Pos                 (2)                                            /**< (USBHS_DEVICR) Start of Frame Interrupt Clear Position */
#define USBHS_DEVICR_SOFC_Msk                 (0x1U << USBHS_DEVICR_SOFC_Pos)                /**< (USBHS_DEVICR) Start of Frame Interrupt Clear Mask */
#define USBHS_DEVICR_EORSTC_Pos               (3)                                            /**< (USBHS_DEVICR) End of Reset Interrupt Clear Position */
#define USBHS_DEVICR_EORSTC_Msk               (0x1U << USBHS_DEVICR_EORSTC_Pos)              /**< (USBHS_DEVICR) End of Reset Interrupt Clear Mask */
#define USBHS_DEVICR_WAKEUPC_Pos              (4)                                            /**< (USBHS_DEVICR) Wake-Up Interrupt Clear Position */
#define USBHS_DEVICR_WAKEUPC_Msk              (0x1U << USBHS_DEVICR_WAKEUPC_Pos)             /**< (USBHS_DEVICR) Wake-Up Interrupt Clear Mask */
#define USBHS_DEVICR_EORSMC_Pos               (5)                                            /**< (USBHS_DEVICR) End of Resume Interrupt Clear Position */
#define USBHS_DEVICR_EORSMC_Msk               (0x1U << USBHS_DEVICR_EORSMC_Pos)              /**< (USBHS_DEVICR) End of Resume Interrupt Clear Mask */
#define USBHS_DEVICR_UPRSMC_Pos               (6)                                            /**< (USBHS_DEVICR) Upstream Resume Interrupt Clear Position */
#define USBHS_DEVICR_UPRSMC_Msk               (0x1U << USBHS_DEVICR_UPRSMC_Pos)              /**< (USBHS_DEVICR) Upstream Resume Interrupt Clear Mask */
#define USBHS_DEVICR_Msk                      (0x0000007FUL)                                 /**< (USBHS_DEVICR) Register Mask  */

/* -------- USBHS_DEVIFR : (USBHS Offset: 0x0c) (/W 32) Device Global Interrupt Set Register -------- */

typedef union
{
  struct
  {
    uint32_t SUSPS:1;                   /**< bit:      0  Suspend Interrupt Set                         */
    uint32_t MSOFS:1;                   /**< bit:      1  Micro Start of Frame Interrupt Set            */
    uint32_t SOFS:1;                    /**< bit:      2  Start of Frame Interrupt Set                  */
    uint32_t EORSTS:1;                  /**< bit:      3  End of Reset Interrupt Set                    */
    uint32_t WAKEUPS:1;                 /**< bit:      4  Wake-Up Interrupt Set                         */
    uint32_t EORSMS:1;                  /**< bit:      5  End of Resume Interrupt Set                   */
    uint32_t UPRSMS:1;                  /**< bit:      6  Upstream Resume Interrupt Set                 */
    uint32_t :18;                       /**< bit:  7..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt Set                   */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt Set                   */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt Set                   */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt Set                   */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt Set                   */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt Set                   */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt Set                   */
  };
  struct
  {
    uint32_t :25;                       /**< bit:  0..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt Set                   */
  };
  uint32_t w;
} __USBHS_DEVIFR_bits_t;

#define USBHS_DEVIFR_SUSPS_Pos                (0)                                            /**< (USBHS_DEVIFR) Suspend Interrupt Set Position */
#define USBHS_DEVIFR_SUSPS_Msk                (0x1U << USBHS_DEVIFR_SUSPS_Pos)               /**< (USBHS_DEVIFR) Suspend Interrupt Set Mask */
#define USBHS_DEVIFR_MSOFS_Pos                (1)                                            /**< (USBHS_DEVIFR) Micro Start of Frame Interrupt Set Position */
#define USBHS_DEVIFR_MSOFS_Msk                (0x1U << USBHS_DEVIFR_MSOFS_Pos)               /**< (USBHS_DEVIFR) Micro Start of Frame Interrupt Set Mask */
#define USBHS_DEVIFR_SOFS_Pos                 (2)                                            /**< (USBHS_DEVIFR) Start of Frame Interrupt Set Position */
#define USBHS_DEVIFR_SOFS_Msk                 (0x1U << USBHS_DEVIFR_SOFS_Pos)                /**< (USBHS_DEVIFR) Start of Frame Interrupt Set Mask */
#define USBHS_DEVIFR_EORSTS_Pos               (3)                                            /**< (USBHS_DEVIFR) End of Reset Interrupt Set Position */
#define USBHS_DEVIFR_EORSTS_Msk               (0x1U << USBHS_DEVIFR_EORSTS_Pos)              /**< (USBHS_DEVIFR) End of Reset Interrupt Set Mask */
#define USBHS_DEVIFR_WAKEUPS_Pos              (4)                                            /**< (USBHS_DEVIFR) Wake-Up Interrupt Set Position */
#define USBHS_DEVIFR_WAKEUPS_Msk              (0x1U << USBHS_DEVIFR_WAKEUPS_Pos)             /**< (USBHS_DEVIFR) Wake-Up Interrupt Set Mask */
#define USBHS_DEVIFR_EORSMS_Pos               (5)                                            /**< (USBHS_DEVIFR) End of Resume Interrupt Set Position */
#define USBHS_DEVIFR_EORSMS_Msk               (0x1U << USBHS_DEVIFR_EORSMS_Pos)              /**< (USBHS_DEVIFR) End of Resume Interrupt Set Mask */
#define USBHS_DEVIFR_UPRSMS_Pos               (6)                                            /**< (USBHS_DEVIFR) Upstream Resume Interrupt Set Position */
#define USBHS_DEVIFR_UPRSMS_Msk               (0x1U << USBHS_DEVIFR_UPRSMS_Pos)              /**< (USBHS_DEVIFR) Upstream Resume Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_1_Pos                (25)                                           /**< (USBHS_DEVIFR) DMA Channel 1 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_1_Msk                (0x1U << USBHS_DEVIFR_DMA_1_Pos)               /**< (USBHS_DEVIFR) DMA Channel 1 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_2_Pos                (26)                                           /**< (USBHS_DEVIFR) DMA Channel 2 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_2_Msk                (0x1U << USBHS_DEVIFR_DMA_2_Pos)               /**< (USBHS_DEVIFR) DMA Channel 2 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_3_Pos                (27)                                           /**< (USBHS_DEVIFR) DMA Channel 3 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_3_Msk                (0x1U << USBHS_DEVIFR_DMA_3_Pos)               /**< (USBHS_DEVIFR) DMA Channel 3 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_4_Pos                (28)                                           /**< (USBHS_DEVIFR) DMA Channel 4 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_4_Msk                (0x1U << USBHS_DEVIFR_DMA_4_Pos)               /**< (USBHS_DEVIFR) DMA Channel 4 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_5_Pos                (29)                                           /**< (USBHS_DEVIFR) DMA Channel 5 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_5_Msk                (0x1U << USBHS_DEVIFR_DMA_5_Pos)               /**< (USBHS_DEVIFR) DMA Channel 5 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_6_Pos                (30)                                           /**< (USBHS_DEVIFR) DMA Channel 6 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_6_Msk                (0x1U << USBHS_DEVIFR_DMA_6_Pos)               /**< (USBHS_DEVIFR) DMA Channel 6 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_7_Pos                (31)                                           /**< (USBHS_DEVIFR) DMA Channel 7 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_7_Msk                (0x1U << USBHS_DEVIFR_DMA_7_Pos)               /**< (USBHS_DEVIFR) DMA Channel 7 Interrupt Set Mask */
#define USBHS_DEVIFR_Msk                      (0xFE00007FUL)                                 /**< (USBHS_DEVIFR) Register Mask  */
#define USBHS_DEVIFR_DMA__Pos                 (25)                                           /**< (USBHS_DEVIFR Position) DMA Channel 7 Interrupt Set */
#define USBHS_DEVIFR_DMA__Msk                 (0x7FU << USBHS_DEVIFR_DMA__Pos)               /**< (USBHS_DEVIFR Mask) DMA_ */
#define USBHS_DEVIFR_DMA_(value)              (USBHS_DEVIFR_DMA__Msk & ((value) << USBHS_DEVIFR_DMA__Pos))

/* -------- USBHS_DEVIMR : (USBHS Offset: 0x10) (R/ 32) Device Global Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t SUSPE:1;                   /**< bit:      0  Suspend Interrupt Mask                        */
    uint32_t MSOFE:1;                   /**< bit:      1  Micro Start of Frame Interrupt Mask           */
    uint32_t SOFE:1;                    /**< bit:      2  Start of Frame Interrupt Mask                 */
    uint32_t EORSTE:1;                  /**< bit:      3  End of Reset Interrupt Mask                   */
    uint32_t WAKEUPE:1;                 /**< bit:      4  Wake-Up Interrupt Mask                        */
    uint32_t EORSME:1;                  /**< bit:      5  End of Resume Interrupt Mask                  */
    uint32_t UPRSME:1;                  /**< bit:      6  Upstream Resume Interrupt Mask                */
    uint32_t :5;                        /**< bit:  7..11  Reserved                                      */
    uint32_t PEP_0:1;                   /**< bit:     12  Endpoint 0 Interrupt Mask                     */
    uint32_t PEP_1:1;                   /**< bit:     13  Endpoint 1 Interrupt Mask                     */
    uint32_t PEP_2:1;                   /**< bit:     14  Endpoint 2 Interrupt Mask                     */
    uint32_t PEP_3:1;                   /**< bit:     15  Endpoint 3 Interrupt Mask                     */
    uint32_t PEP_4:1;                   /**< bit:     16  Endpoint 4 Interrupt Mask                     */
    uint32_t PEP_5:1;                   /**< bit:     17  Endpoint 5 Interrupt Mask                     */
    uint32_t PEP_6:1;                   /**< bit:     18  Endpoint 6 Interrupt Mask                     */
    uint32_t PEP_7:1;                   /**< bit:     19  Endpoint 7 Interrupt Mask                     */
    uint32_t PEP_8:1;                   /**< bit:     20  Endpoint 8 Interrupt Mask                     */
    uint32_t PEP_9:1;                   /**< bit:     21  Endpoint 9 Interrupt Mask                     */
    uint32_t :3;                        /**< bit: 22..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt Mask                  */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt Mask                  */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt Mask                  */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt Mask                  */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt Mask                  */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt Mask                  */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt Mask                  */
  };
  struct
  {
    uint32_t :12;                       /**< bit:  0..11  Reserved                                      */
    uint32_t PEP_:10;                   /**< bit: 12..21  Endpoint x Interrupt Mask                     */
    uint32_t :3;                        /**< bit: 22..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt Mask                  */
  };
  uint32_t w;
} __USBHS_DEVIMR_bits_t;

#define USBHS_DEVIMR_SUSPE_Pos                (0)                                            /**< (USBHS_DEVIMR) Suspend Interrupt Mask Position */
#define USBHS_DEVIMR_SUSPE_Msk                (0x1U << USBHS_DEVIMR_SUSPE_Pos)               /**< (USBHS_DEVIMR) Suspend Interrupt Mask Mask */
#define USBHS_DEVIMR_MSOFE_Pos                (1)                                            /**< (USBHS_DEVIMR) Micro Start of Frame Interrupt Mask Position */
#define USBHS_DEVIMR_MSOFE_Msk                (0x1U << USBHS_DEVIMR_MSOFE_Pos)               /**< (USBHS_DEVIMR) Micro Start of Frame Interrupt Mask Mask */
#define USBHS_DEVIMR_SOFE_Pos                 (2)                                            /**< (USBHS_DEVIMR) Start of Frame Interrupt Mask Position */
#define USBHS_DEVIMR_SOFE_Msk                 (0x1U << USBHS_DEVIMR_SOFE_Pos)                /**< (USBHS_DEVIMR) Start of Frame Interrupt Mask Mask */
#define USBHS_DEVIMR_EORSTE_Pos               (3)                                            /**< (USBHS_DEVIMR) End of Reset Interrupt Mask Position */
#define USBHS_DEVIMR_EORSTE_Msk               (0x1U << USBHS_DEVIMR_EORSTE_Pos)              /**< (USBHS_DEVIMR) End of Reset Interrupt Mask Mask */
#define USBHS_DEVIMR_WAKEUPE_Pos              (4)                                            /**< (USBHS_DEVIMR) Wake-Up Interrupt Mask Position */
#define USBHS_DEVIMR_WAKEUPE_Msk              (0x1U << USBHS_DEVIMR_WAKEUPE_Pos)             /**< (USBHS_DEVIMR) Wake-Up Interrupt Mask Mask */
#define USBHS_DEVIMR_EORSME_Pos               (5)                                            /**< (USBHS_DEVIMR) End of Resume Interrupt Mask Position */
#define USBHS_DEVIMR_EORSME_Msk               (0x1U << USBHS_DEVIMR_EORSME_Pos)              /**< (USBHS_DEVIMR) End of Resume Interrupt Mask Mask */
#define USBHS_DEVIMR_UPRSME_Pos               (6)                                            /**< (USBHS_DEVIMR) Upstream Resume Interrupt Mask Position */
#define USBHS_DEVIMR_UPRSME_Msk               (0x1U << USBHS_DEVIMR_UPRSME_Pos)              /**< (USBHS_DEVIMR) Upstream Resume Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_0_Pos                (12)                                           /**< (USBHS_DEVIMR) Endpoint 0 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_0_Msk                (0x1U << USBHS_DEVIMR_PEP_0_Pos)               /**< (USBHS_DEVIMR) Endpoint 0 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_1_Pos                (13)                                           /**< (USBHS_DEVIMR) Endpoint 1 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_1_Msk                (0x1U << USBHS_DEVIMR_PEP_1_Pos)               /**< (USBHS_DEVIMR) Endpoint 1 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_2_Pos                (14)                                           /**< (USBHS_DEVIMR) Endpoint 2 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_2_Msk                (0x1U << USBHS_DEVIMR_PEP_2_Pos)               /**< (USBHS_DEVIMR) Endpoint 2 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_3_Pos                (15)                                           /**< (USBHS_DEVIMR) Endpoint 3 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_3_Msk                (0x1U << USBHS_DEVIMR_PEP_3_Pos)               /**< (USBHS_DEVIMR) Endpoint 3 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_4_Pos                (16)                                           /**< (USBHS_DEVIMR) Endpoint 4 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_4_Msk                (0x1U << USBHS_DEVIMR_PEP_4_Pos)               /**< (USBHS_DEVIMR) Endpoint 4 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_5_Pos                (17)                                           /**< (USBHS_DEVIMR) Endpoint 5 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_5_Msk                (0x1U << USBHS_DEVIMR_PEP_5_Pos)               /**< (USBHS_DEVIMR) Endpoint 5 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_6_Pos                (18)                                           /**< (USBHS_DEVIMR) Endpoint 6 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_6_Msk                (0x1U << USBHS_DEVIMR_PEP_6_Pos)               /**< (USBHS_DEVIMR) Endpoint 6 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_7_Pos                (19)                                           /**< (USBHS_DEVIMR) Endpoint 7 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_7_Msk                (0x1U << USBHS_DEVIMR_PEP_7_Pos)               /**< (USBHS_DEVIMR) Endpoint 7 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_8_Pos                (20)                                           /**< (USBHS_DEVIMR) Endpoint 8 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_8_Msk                (0x1U << USBHS_DEVIMR_PEP_8_Pos)               /**< (USBHS_DEVIMR) Endpoint 8 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_9_Pos                (21)                                           /**< (USBHS_DEVIMR) Endpoint 9 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_9_Msk                (0x1U << USBHS_DEVIMR_PEP_9_Pos)               /**< (USBHS_DEVIMR) Endpoint 9 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_1_Pos                (25)                                           /**< (USBHS_DEVIMR) DMA Channel 1 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_1_Msk                (0x1U << USBHS_DEVIMR_DMA_1_Pos)               /**< (USBHS_DEVIMR) DMA Channel 1 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_2_Pos                (26)                                           /**< (USBHS_DEVIMR) DMA Channel 2 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_2_Msk                (0x1U << USBHS_DEVIMR_DMA_2_Pos)               /**< (USBHS_DEVIMR) DMA Channel 2 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_3_Pos                (27)                                           /**< (USBHS_DEVIMR) DMA Channel 3 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_3_Msk                (0x1U << USBHS_DEVIMR_DMA_3_Pos)               /**< (USBHS_DEVIMR) DMA Channel 3 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_4_Pos                (28)                                           /**< (USBHS_DEVIMR) DMA Channel 4 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_4_Msk                (0x1U << USBHS_DEVIMR_DMA_4_Pos)               /**< (USBHS_DEVIMR) DMA Channel 4 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_5_Pos                (29)                                           /**< (USBHS_DEVIMR) DMA Channel 5 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_5_Msk                (0x1U << USBHS_DEVIMR_DMA_5_Pos)               /**< (USBHS_DEVIMR) DMA Channel 5 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_6_Pos                (30)                                           /**< (USBHS_DEVIMR) DMA Channel 6 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_6_Msk                (0x1U << USBHS_DEVIMR_DMA_6_Pos)               /**< (USBHS_DEVIMR) DMA Channel 6 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_7_Pos                (31)                                           /**< (USBHS_DEVIMR) DMA Channel 7 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_7_Msk                (0x1U << USBHS_DEVIMR_DMA_7_Pos)               /**< (USBHS_DEVIMR) DMA Channel 7 Interrupt Mask Mask */
#define USBHS_DEVIMR_Msk                      (0xFE3FF07FUL)                                 /**< (USBHS_DEVIMR) Register Mask  */
#define USBHS_DEVIMR_PEP__Pos                 (12)                                           /**< (USBHS_DEVIMR Position) Endpoint x Interrupt Mask */
#define USBHS_DEVIMR_PEP__Msk                 (0x3FFU << USBHS_DEVIMR_PEP__Pos)              /**< (USBHS_DEVIMR Mask) PEP_ */
#define USBHS_DEVIMR_PEP_(value)              (USBHS_DEVIMR_PEP__Msk & ((value) << USBHS_DEVIMR_PEP__Pos))
#define USBHS_DEVIMR_DMA__Pos                 (25)                                           /**< (USBHS_DEVIMR Position) DMA Channel 7 Interrupt Mask */
#define USBHS_DEVIMR_DMA__Msk                 (0x7FU << USBHS_DEVIMR_DMA__Pos)               /**< (USBHS_DEVIMR Mask) DMA_ */
#define USBHS_DEVIMR_DMA_(value)              (USBHS_DEVIMR_DMA__Msk & ((value) << USBHS_DEVIMR_DMA__Pos))

