zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_DEVIDR : (USBHS Offset: 0x14) (/W 32) Device Global Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t SUSPEC:1;                  /**< bit:      0  Suspend Interrupt Disable                     */
    uint32_t MSOFEC:1;                  /**< bit:      1  Micro Start of Frame Interrupt Disable        */
    uint32_t SOFEC:1;                   /**< bit:      2  Start of Frame Interrupt Disable              */
    uint32_t EORSTEC:1;                 /**< bit:      3  End of Reset Interrupt Disable                */
    uint32_t WAKEUPEC:1;                /**< bit:      4  Wake-Up Interrupt Disable                     */
    uint32_t EORSMEC:1;                 /**< bit:      5  End of Resume Interrupt Disable               */
    uint32_t UPRSMEC:1;                 /**< bit:      6  Upstream Resume Interrupt Disable             */
    uint32_t :5;                        /**< bit:  7..11  Reserved                                      */
    uint32_t PEP_0:1;                   /**< bit:     12  Endpoint 0 Interrupt Disable                  */
    uint32_t PEP_1:1;                   /**< bit:     13  Endpoint 1 Interrupt Disable                  */
    uint32_t PEP_2:1;                   /**< bit:     14  Endpoint 2 Interrupt Disable                  */
    uint32_t PEP_3:1;                   /**< bit:     15  Endpoint 3 Interrupt Disable                  */
    uint32_t PEP_4:1;                   /**< bit:     16  Endpoint 4 Interrupt Disable                  */
    uint32_t PEP_5:1;                   /**< bit:     17  Endpoint 5 Interrupt Disable                  */
    uint32_t PEP_6:1;                   /**< bit:     18  Endpoint 6 Interrupt Disable                  */
    uint32_t PEP_7:1;                   /**< bit:     19  Endpoint 7 Interrupt Disable                  */
    uint32_t PEP_8:1;                   /**< bit:     20  Endpoint 8 Interrupt Disable                  */
    uint32_t PEP_9:1;                   /**< bit:     21  Endpoint 9 Interrupt Disable                  */
    uint32_t :3;                        /**< bit: 22..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt Disable               */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt Disable               */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt Disable               */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt Disable               */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt Disable               */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt Disable               */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt Disable               */
  };
  struct
  {
    uint32_t :12;                       /**< bit:  0..11  Reserved                                      */
    uint32_t PEP_:10;                   /**< bit: 12..21  Endpoint x Interrupt Disable                  */
    uint32_t :3;                        /**< bit: 22..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt Disable               */
  };
  uint32_t w;
} __USBHS_DEVIDR_bits_t;

#define USBHS_DEVIDR_SUSPEC_Pos               (0)                                            /**< (USBHS_DEVIDR) Suspend Interrupt Disable Position */
#define USBHS_DEVIDR_SUSPEC_Msk               (0x1U << USBHS_DEVIDR_SUSPEC_Pos)              /**< (USBHS_DEVIDR) Suspend Interrupt Disable Mask */
#define USBHS_DEVIDR_MSOFEC_Pos               (1)                                            /**< (USBHS_DEVIDR) Micro Start of Frame Interrupt Disable Position */
#define USBHS_DEVIDR_MSOFEC_Msk               (0x1U << USBHS_DEVIDR_MSOFEC_Pos)              /**< (USBHS_DEVIDR) Micro Start of Frame Interrupt Disable Mask */
#define USBHS_DEVIDR_SOFEC_Pos                (2)                                            /**< (USBHS_DEVIDR) Start of Frame Interrupt Disable Position */
#define USBHS_DEVIDR_SOFEC_Msk                (0x1U << USBHS_DEVIDR_SOFEC_Pos)               /**< (USBHS_DEVIDR) Start of Frame Interrupt Disable Mask */
#define USBHS_DEVIDR_EORSTEC_Pos              (3)                                            /**< (USBHS_DEVIDR) End of Reset Interrupt Disable Position */
#define USBHS_DEVIDR_EORSTEC_Msk              (0x1U << USBHS_DEVIDR_EORSTEC_Pos)             /**< (USBHS_DEVIDR) End of Reset Interrupt Disable Mask */
#define USBHS_DEVIDR_WAKEUPEC_Pos             (4)                                            /**< (USBHS_DEVIDR) Wake-Up Interrupt Disable Position */
#define USBHS_DEVIDR_WAKEUPEC_Msk             (0x1U << USBHS_DEVIDR_WAKEUPEC_Pos)            /**< (USBHS_DEVIDR) Wake-Up Interrupt Disable Mask */
#define USBHS_DEVIDR_EORSMEC_Pos              (5)                                            /**< (USBHS_DEVIDR) End of Resume Interrupt Disable Position */
#define USBHS_DEVIDR_EORSMEC_Msk              (0x1U << USBHS_DEVIDR_EORSMEC_Pos)             /**< (USBHS_DEVIDR) End of Resume Interrupt Disable Mask */
#define USBHS_DEVIDR_UPRSMEC_Pos              (6)                                            /**< (USBHS_DEVIDR) Upstream Resume Interrupt Disable Position */
#define USBHS_DEVIDR_UPRSMEC_Msk              (0x1U << USBHS_DEVIDR_UPRSMEC_Pos)             /**< (USBHS_DEVIDR) Upstream Resume Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_0_Pos                (12)                                           /**< (USBHS_DEVIDR) Endpoint 0 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_0_Msk                (0x1U << USBHS_DEVIDR_PEP_0_Pos)               /**< (USBHS_DEVIDR) Endpoint 0 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_1_Pos                (13)                                           /**< (USBHS_DEVIDR) Endpoint 1 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_1_Msk                (0x1U << USBHS_DEVIDR_PEP_1_Pos)               /**< (USBHS_DEVIDR) Endpoint 1 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_2_Pos                (14)                                           /**< (USBHS_DEVIDR) Endpoint 2 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_2_Msk                (0x1U << USBHS_DEVIDR_PEP_2_Pos)               /**< (USBHS_DEVIDR) Endpoint 2 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_3_Pos                (15)                                           /**< (USBHS_DEVIDR) Endpoint 3 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_3_Msk                (0x1U << USBHS_DEVIDR_PEP_3_Pos)               /**< (USBHS_DEVIDR) Endpoint 3 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_4_Pos                (16)                                           /**< (USBHS_DEVIDR) Endpoint 4 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_4_Msk                (0x1U << USBHS_DEVIDR_PEP_4_Pos)               /**< (USBHS_DEVIDR) Endpoint 4 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_5_Pos                (17)                                           /**< (USBHS_DEVIDR) Endpoint 5 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_5_Msk                (0x1U << USBHS_DEVIDR_PEP_5_Pos)               /**< (USBHS_DEVIDR) Endpoint 5 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_6_Pos                (18)                                           /**< (USBHS_DEVIDR) Endpoint 6 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_6_Msk                (0x1U << USBHS_DEVIDR_PEP_6_Pos)               /**< (USBHS_DEVIDR) Endpoint 6 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_7_Pos                (19)                                           /**< (USBHS_DEVIDR) Endpoint 7 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_7_Msk                (0x1U << USBHS_DEVIDR_PEP_7_Pos)               /**< (USBHS_DEVIDR) Endpoint 7 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_8_Pos                (20)                                           /**< (USBHS_DEVIDR) Endpoint 8 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_8_Msk                (0x1U << USBHS_DEVIDR_PEP_8_Pos)               /**< (USBHS_DEVIDR) Endpoint 8 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_9_Pos                (21)                                           /**< (USBHS_DEVIDR) Endpoint 9 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_9_Msk                (0x1U << USBHS_DEVIDR_PEP_9_Pos)               /**< (USBHS_DEVIDR) Endpoint 9 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_1_Pos                (25)                                           /**< (USBHS_DEVIDR) DMA Channel 1 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_1_Msk                (0x1U << USBHS_DEVIDR_DMA_1_Pos)               /**< (USBHS_DEVIDR) DMA Channel 1 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_2_Pos                (26)                                           /**< (USBHS_DEVIDR) DMA Channel 2 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_2_Msk                (0x1U << USBHS_DEVIDR_DMA_2_Pos)               /**< (USBHS_DEVIDR) DMA Channel 2 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_3_Pos                (27)                                           /**< (USBHS_DEVIDR) DMA Channel 3 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_3_Msk                (0x1U << USBHS_DEVIDR_DMA_3_Pos)               /**< (USBHS_DEVIDR) DMA Channel 3 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_4_Pos                (28)                                           /**< (USBHS_DEVIDR) DMA Channel 4 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_4_Msk                (0x1U << USBHS_DEVIDR_DMA_4_Pos)               /**< (USBHS_DEVIDR) DMA Channel 4 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_5_Pos                (29)                                           /**< (USBHS_DEVIDR) DMA Channel 5 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_5_Msk                (0x1U << USBHS_DEVIDR_DMA_5_Pos)               /**< (USBHS_DEVIDR) DMA Channel 5 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_6_Pos                (30)                                           /**< (USBHS_DEVIDR) DMA Channel 6 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_6_Msk                (0x1U << USBHS_DEVIDR_DMA_6_Pos)               /**< (USBHS_DEVIDR) DMA Channel 6 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_7_Pos                (31)                                           /**< (USBHS_DEVIDR) DMA Channel 7 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_7_Msk                (0x1U << USBHS_DEVIDR_DMA_7_Pos)               /**< (USBHS_DEVIDR) DMA Channel 7 Interrupt Disable Mask */
#define USBHS_DEVIDR_Msk                      (0xFE3FF07FUL)                                 /**< (USBHS_DEVIDR) Register Mask  */
#define USBHS_DEVIDR_PEP__Pos                 (12)                                           /**< (USBHS_DEVIDR Position) Endpoint x Interrupt Disable */
#define USBHS_DEVIDR_PEP__Msk                 (0x3FFU << USBHS_DEVIDR_PEP__Pos)              /**< (USBHS_DEVIDR Mask) PEP_ */
#define USBHS_DEVIDR_PEP_(value)              (USBHS_DEVIDR_PEP__Msk & ((value) << USBHS_DEVIDR_PEP__Pos))
#define USBHS_DEVIDR_DMA__Pos                 (25)                                           /**< (USBHS_DEVIDR Position) DMA Channel 7 Interrupt Disable */
#define USBHS_DEVIDR_DMA__Msk                 (0x7FU << USBHS_DEVIDR_DMA__Pos)               /**< (USBHS_DEVIDR Mask) DMA_ */
#define USBHS_DEVIDR_DMA_(value)              (USBHS_DEVIDR_DMA__Msk & ((value) << USBHS_DEVIDR_DMA__Pos))

