zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_DEVIER : (USBHS Offset: 0x18) (/W 32) Device Global Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t SUSPES:1;                  /**< bit:      0  Suspend Interrupt Enable                      */
    uint32_t MSOFES:1;                  /**< bit:      1  Micro Start of Frame Interrupt Enable         */
    uint32_t SOFES:1;                   /**< bit:      2  Start of Frame Interrupt Enable               */
    uint32_t EORSTES:1;                 /**< bit:      3  End of Reset Interrupt Enable                 */
    uint32_t WAKEUPES:1;                /**< bit:      4  Wake-Up Interrupt Enable                      */
    uint32_t EORSMES:1;                 /**< bit:      5  End of Resume Interrupt Enable                */
    uint32_t UPRSMES:1;                 /**< bit:      6  Upstream Resume Interrupt Enable              */
    uint32_t :5;                        /**< bit:  7..11  Reserved                                      */
    uint32_t PEP_0:1;                   /**< bit:     12  Endpoint 0 Interrupt Enable                   */
    uint32_t PEP_1:1;                   /**< bit:     13  Endpoint 1 Interrupt Enable                   */
    uint32_t PEP_2:1;                   /**< bit:     14  Endpoint 2 Interrupt Enable                   */
    uint32_t PEP_3:1;                   /**< bit:     15  Endpoint 3 Interrupt Enable                   */
    uint32_t PEP_4:1;                   /**< bit:     16  Endpoint 4 Interrupt Enable                   */
    uint32_t PEP_5:1;                   /**< bit:     17  Endpoint 5 Interrupt Enable                   */
    uint32_t PEP_6:1;                   /**< bit:     18  Endpoint 6 Interrupt Enable                   */
    uint32_t PEP_7:1;                   /**< bit:     19  Endpoint 7 Interrupt Enable                   */
    uint32_t PEP_8:1;                   /**< bit:     20  Endpoint 8 Interrupt Enable                   */
    uint32_t PEP_9:1;                   /**< bit:     21  Endpoint 9 Interrupt Enable                   */
    uint32_t :3;                        /**< bit: 22..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt Enable                */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt Enable                */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt Enable                */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt Enable                */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt Enable                */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt Enable                */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt Enable                */
  };
  struct
  {
    uint32_t :12;                       /**< bit:  0..11  Reserved                                      */
    uint32_t PEP_:10;                   /**< bit: 12..21  Endpoint x Interrupt Enable                   */
    uint32_t :3;                        /**< bit: 22..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt Enable                */
  };
  uint32_t w;
} __USBHS_DEVIER_bits_t;

#define USBHS_DEVIER_SUSPES_Pos               (0)                                            /**< (USBHS_DEVIER) Suspend Interrupt Enable Position */
#define USBHS_DEVIER_SUSPES_Msk               (0x1U << USBHS_DEVIER_SUSPES_Pos)              /**< (USBHS_DEVIER) Suspend Interrupt Enable Mask */
#define USBHS_DEVIER_MSOFES_Pos               (1)                                            /**< (USBHS_DEVIER) Micro Start of Frame Interrupt Enable Position */
#define USBHS_DEVIER_MSOFES_Msk               (0x1U << USBHS_DEVIER_MSOFES_Pos)              /**< (USBHS_DEVIER) Micro Start of Frame Interrupt Enable Mask */
#define USBHS_DEVIER_SOFES_Pos                (2)                                            /**< (USBHS_DEVIER) Start of Frame Interrupt Enable Position */
#define USBHS_DEVIER_SOFES_Msk                (0x1U << USBHS_DEVIER_SOFES_Pos)               /**< (USBHS_DEVIER) Start of Frame Interrupt Enable Mask */
#define USBHS_DEVIER_EORSTES_Pos              (3)                                            /**< (USBHS_DEVIER) End of Reset Interrupt Enable Position */
#define USBHS_DEVIER_EORSTES_Msk              (0x1U << USBHS_DEVIER_EORSTES_Pos)             /**< (USBHS_DEVIER) End of Reset Interrupt Enable Mask */
#define USBHS_DEVIER_WAKEUPES_Pos             (4)                                            /**< (USBHS_DEVIER) Wake-Up Interrupt Enable Position */
#define USBHS_DEVIER_WAKEUPES_Msk             (0x1U << USBHS_DEVIER_WAKEUPES_Pos)            /**< (USBHS_DEVIER) Wake-Up Interrupt Enable Mask */
#define USBHS_DEVIER_EORSMES_Pos              (5)                                            /**< (USBHS_DEVIER) End of Resume Interrupt Enable Position */
#define USBHS_DEVIER_EORSMES_Msk              (0x1U << USBHS_DEVIER_EORSMES_Pos)             /**< (USBHS_DEVIER) End of Resume Interrupt Enable Mask */
#define USBHS_DEVIER_UPRSMES_Pos              (6)                                            /**< (USBHS_DEVIER) Upstream Resume Interrupt Enable Position */
#define USBHS_DEVIER_UPRSMES_Msk              (0x1U << USBHS_DEVIER_UPRSMES_Pos)             /**< (USBHS_DEVIER) Upstream Resume Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_0_Pos                (12)                                           /**< (USBHS_DEVIER) Endpoint 0 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_0_Msk                (0x1U << USBHS_DEVIER_PEP_0_Pos)               /**< (USBHS_DEVIER) Endpoint 0 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_1_Pos                (13)                                           /**< (USBHS_DEVIER) Endpoint 1 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_1_Msk                (0x1U << USBHS_DEVIER_PEP_1_Pos)               /**< (USBHS_DEVIER) Endpoint 1 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_2_Pos                (14)                                           /**< (USBHS_DEVIER) Endpoint 2 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_2_Msk                (0x1U << USBHS_DEVIER_PEP_2_Pos)               /**< (USBHS_DEVIER) Endpoint 2 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_3_Pos                (15)                                           /**< (USBHS_DEVIER) Endpoint 3 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_3_Msk                (0x1U << USBHS_DEVIER_PEP_3_Pos)               /**< (USBHS_DEVIER) Endpoint 3 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_4_Pos                (16)                                           /**< (USBHS_DEVIER) Endpoint 4 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_4_Msk                (0x1U << USBHS_DEVIER_PEP_4_Pos)               /**< (USBHS_DEVIER) Endpoint 4 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_5_Pos                (17)                                           /**< (USBHS_DEVIER) Endpoint 5 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_5_Msk                (0x1U << USBHS_DEVIER_PEP_5_Pos)               /**< (USBHS_DEVIER) Endpoint 5 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_6_Pos                (18)                                           /**< (USBHS_DEVIER) Endpoint 6 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_6_Msk                (0x1U << USBHS_DEVIER_PEP_6_Pos)               /**< (USBHS_DEVIER) Endpoint 6 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_7_Pos                (19)                                           /**< (USBHS_DEVIER) Endpoint 7 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_7_Msk                (0x1U << USBHS_DEVIER_PEP_7_Pos)               /**< (USBHS_DEVIER) Endpoint 7 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_8_Pos                (20)                                           /**< (USBHS_DEVIER) Endpoint 8 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_8_Msk                (0x1U << USBHS_DEVIER_PEP_8_Pos)               /**< (USBHS_DEVIER) Endpoint 8 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_9_Pos                (21)                                           /**< (USBHS_DEVIER) Endpoint 9 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_9_Msk                (0x1U << USBHS_DEVIER_PEP_9_Pos)               /**< (USBHS_DEVIER) Endpoint 9 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_1_Pos                (25)                                           /**< (USBHS_DEVIER) DMA Channel 1 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_1_Msk                (0x1U << USBHS_DEVIER_DMA_1_Pos)               /**< (USBHS_DEVIER) DMA Channel 1 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_2_Pos                (26)                                           /**< (USBHS_DEVIER) DMA Channel 2 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_2_Msk                (0x1U << USBHS_DEVIER_DMA_2_Pos)               /**< (USBHS_DEVIER) DMA Channel 2 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_3_Pos                (27)                                           /**< (USBHS_DEVIER) DMA Channel 3 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_3_Msk                (0x1U << USBHS_DEVIER_DMA_3_Pos)               /**< (USBHS_DEVIER) DMA Channel 3 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_4_Pos                (28)                                           /**< (USBHS_DEVIER) DMA Channel 4 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_4_Msk                (0x1U << USBHS_DEVIER_DMA_4_Pos)               /**< (USBHS_DEVIER) DMA Channel 4 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_5_Pos                (29)                                           /**< (USBHS_DEVIER) DMA Channel 5 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_5_Msk                (0x1U << USBHS_DEVIER_DMA_5_Pos)               /**< (USBHS_DEVIER) DMA Channel 5 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_6_Pos                (30)                                           /**< (USBHS_DEVIER) DMA Channel 6 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_6_Msk                (0x1U << USBHS_DEVIER_DMA_6_Pos)               /**< (USBHS_DEVIER) DMA Channel 6 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_7_Pos                (31)                                           /**< (USBHS_DEVIER) DMA Channel 7 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_7_Msk                (0x1U << USBHS_DEVIER_DMA_7_Pos)               /**< (USBHS_DEVIER) DMA Channel 7 Interrupt Enable Mask */
#define USBHS_DEVIER_Msk                      (0xFE3FF07FUL)                                 /**< (USBHS_DEVIER) Register Mask  */
#define USBHS_DEVIER_PEP__Pos                 (12)                                           /**< (USBHS_DEVIER Position) Endpoint x Interrupt Enable */
#define USBHS_DEVIER_PEP__Msk                 (0x3FFU << USBHS_DEVIER_PEP__Pos)              /**< (USBHS_DEVIER Mask) PEP_ */
#define USBHS_DEVIER_PEP_(value)              (USBHS_DEVIER_PEP__Msk & ((value) << USBHS_DEVIER_PEP__Pos))
#define USBHS_DEVIER_DMA__Pos                 (25)                                           /**< (USBHS_DEVIER Position) DMA Channel 7 Interrupt Enable */
#define USBHS_DEVIER_DMA__Msk                 (0x7FU << USBHS_DEVIER_DMA__Pos)               /**< (USBHS_DEVIER Mask) DMA_ */
#define USBHS_DEVIER_DMA_(value)              (USBHS_DEVIER_DMA__Msk & ((value) << USBHS_DEVIER_DMA__Pos))

/* -------- USBHS_DEVEPT : (USBHS Offset: 0x1c) (R/W 32) Device Endpoint Register -------- */

typedef union
{
  struct
  {
    uint32_t EPEN0:1;                   /**< bit:      0  Endpoint 0 Enable                             */
    uint32_t EPEN1:1;                   /**< bit:      1  Endpoint 1 Enable                             */
    uint32_t EPEN2:1;                   /**< bit:      2  Endpoint 2 Enable                             */
    uint32_t EPEN3:1;                   /**< bit:      3  Endpoint 3 Enable                             */
    uint32_t EPEN4:1;                   /**< bit:      4  Endpoint 4 Enable                             */
    uint32_t EPEN5:1;                   /**< bit:      5  Endpoint 5 Enable                             */
    uint32_t EPEN6:1;                   /**< bit:      6  Endpoint 6 Enable                             */
    uint32_t EPEN7:1;                   /**< bit:      7  Endpoint 7 Enable                             */
    uint32_t EPEN8:1;                   /**< bit:      8  Endpoint 8 Enable                             */
    uint32_t EPEN9:1;                   /**< bit:      9  Endpoint 9 Enable                             */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t EPRST0:1;                  /**< bit:     16  Endpoint 0 Reset                              */
    uint32_t EPRST1:1;                  /**< bit:     17  Endpoint 1 Reset                              */
    uint32_t EPRST2:1;                  /**< bit:     18  Endpoint 2 Reset                              */
    uint32_t EPRST3:1;                  /**< bit:     19  Endpoint 3 Reset                              */
    uint32_t EPRST4:1;                  /**< bit:     20  Endpoint 4 Reset                              */
    uint32_t EPRST5:1;                  /**< bit:     21  Endpoint 5 Reset                              */
    uint32_t EPRST6:1;                  /**< bit:     22  Endpoint 6 Reset                              */
    uint32_t EPRST7:1;                  /**< bit:     23  Endpoint 7 Reset                              */
    uint32_t EPRST8:1;                  /**< bit:     24  Endpoint 8 Reset                              */
    uint32_t EPRST9:1;                  /**< bit:     25  Endpoint 9 Reset                              */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  struct
  {
    uint32_t EPEN:10;                   /**< bit:   0..9  Endpoint x Enable                             */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t EPRST:10;                  /**< bit: 16..25  Endpoint 9 Reset                              */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVEPT_bits_t;

#define USBHS_DEVEPT_EPEN0_Pos                (0)                                            /**< (USBHS_DEVEPT) Endpoint 0 Enable Position */
#define USBHS_DEVEPT_EPEN0_Msk                (0x1U << USBHS_DEVEPT_EPEN0_Pos)               /**< (USBHS_DEVEPT) Endpoint 0 Enable Mask */
#define USBHS_DEVEPT_EPEN1_Pos                (1)                                            /**< (USBHS_DEVEPT) Endpoint 1 Enable Position */
#define USBHS_DEVEPT_EPEN1_Msk                (0x1U << USBHS_DEVEPT_EPEN1_Pos)               /**< (USBHS_DEVEPT) Endpoint 1 Enable Mask */
#define USBHS_DEVEPT_EPEN2_Pos                (2)                                            /**< (USBHS_DEVEPT) Endpoint 2 Enable Position */
#define USBHS_DEVEPT_EPEN2_Msk                (0x1U << USBHS_DEVEPT_EPEN2_Pos)               /**< (USBHS_DEVEPT) Endpoint 2 Enable Mask */
#define USBHS_DEVEPT_EPEN3_Pos                (3)                                            /**< (USBHS_DEVEPT) Endpoint 3 Enable Position */
#define USBHS_DEVEPT_EPEN3_Msk                (0x1U << USBHS_DEVEPT_EPEN3_Pos)               /**< (USBHS_DEVEPT) Endpoint 3 Enable Mask */
#define USBHS_DEVEPT_EPEN4_Pos                (4)                                            /**< (USBHS_DEVEPT) Endpoint 4 Enable Position */
#define USBHS_DEVEPT_EPEN4_Msk                (0x1U << USBHS_DEVEPT_EPEN4_Pos)               /**< (USBHS_DEVEPT) Endpoint 4 Enable Mask */
#define USBHS_DEVEPT_EPEN5_Pos                (5)                                            /**< (USBHS_DEVEPT) Endpoint 5 Enable Position */
#define USBHS_DEVEPT_EPEN5_Msk                (0x1U << USBHS_DEVEPT_EPEN5_Pos)               /**< (USBHS_DEVEPT) Endpoint 5 Enable Mask */
#define USBHS_DEVEPT_EPEN6_Pos                (6)                                            /**< (USBHS_DEVEPT) Endpoint 6 Enable Position */
#define USBHS_DEVEPT_EPEN6_Msk                (0x1U << USBHS_DEVEPT_EPEN6_Pos)               /**< (USBHS_DEVEPT) Endpoint 6 Enable Mask */
#define USBHS_DEVEPT_EPEN7_Pos                (7)                                            /**< (USBHS_DEVEPT) Endpoint 7 Enable Position */
#define USBHS_DEVEPT_EPEN7_Msk                (0x1U << USBHS_DEVEPT_EPEN7_Pos)               /**< (USBHS_DEVEPT) Endpoint 7 Enable Mask */
#define USBHS_DEVEPT_EPEN8_Pos                (8)                                            /**< (USBHS_DEVEPT) Endpoint 8 Enable Position */
#define USBHS_DEVEPT_EPEN8_Msk                (0x1U << USBHS_DEVEPT_EPEN8_Pos)               /**< (USBHS_DEVEPT) Endpoint 8 Enable Mask */
#define USBHS_DEVEPT_EPEN9_Pos                (9)                                            /**< (USBHS_DEVEPT) Endpoint 9 Enable Position */
#define USBHS_DEVEPT_EPEN9_Msk                (0x1U << USBHS_DEVEPT_EPEN9_Pos)               /**< (USBHS_DEVEPT) Endpoint 9 Enable Mask */
#define USBHS_DEVEPT_EPRST0_Pos               (16)                                           /**< (USBHS_DEVEPT) Endpoint 0 Reset Position */
#define USBHS_DEVEPT_EPRST0_Msk               (0x1U << USBHS_DEVEPT_EPRST0_Pos)              /**< (USBHS_DEVEPT) Endpoint 0 Reset Mask */
#define USBHS_DEVEPT_EPRST1_Pos               (17)                                           /**< (USBHS_DEVEPT) Endpoint 1 Reset Position */
#define USBHS_DEVEPT_EPRST1_Msk               (0x1U << USBHS_DEVEPT_EPRST1_Pos)              /**< (USBHS_DEVEPT) Endpoint 1 Reset Mask */
#define USBHS_DEVEPT_EPRST2_Pos               (18)                                           /**< (USBHS_DEVEPT) Endpoint 2 Reset Position */
#define USBHS_DEVEPT_EPRST2_Msk               (0x1U << USBHS_DEVEPT_EPRST2_Pos)              /**< (USBHS_DEVEPT) Endpoint 2 Reset Mask */
#define USBHS_DEVEPT_EPRST3_Pos               (19)                                           /**< (USBHS_DEVEPT) Endpoint 3 Reset Position */
#define USBHS_DEVEPT_EPRST3_Msk               (0x1U << USBHS_DEVEPT_EPRST3_Pos)              /**< (USBHS_DEVEPT) Endpoint 3 Reset Mask */
#define USBHS_DEVEPT_EPRST4_Pos               (20)                                           /**< (USBHS_DEVEPT) Endpoint 4 Reset Position */
#define USBHS_DEVEPT_EPRST4_Msk               (0x1U << USBHS_DEVEPT_EPRST4_Pos)              /**< (USBHS_DEVEPT) Endpoint 4 Reset Mask */
#define USBHS_DEVEPT_EPRST5_Pos               (21)                                           /**< (USBHS_DEVEPT) Endpoint 5 Reset Position */
#define USBHS_DEVEPT_EPRST5_Msk               (0x1U << USBHS_DEVEPT_EPRST5_Pos)              /**< (USBHS_DEVEPT) Endpoint 5 Reset Mask */
#define USBHS_DEVEPT_EPRST6_Pos               (22)                                           /**< (USBHS_DEVEPT) Endpoint 6 Reset Position */
#define USBHS_DEVEPT_EPRST6_Msk               (0x1U << USBHS_DEVEPT_EPRST6_Pos)              /**< (USBHS_DEVEPT) Endpoint 6 Reset Mask */
#define USBHS_DEVEPT_EPRST7_Pos               (23)                                           /**< (USBHS_DEVEPT) Endpoint 7 Reset Position */
#define USBHS_DEVEPT_EPRST7_Msk               (0x1U << USBHS_DEVEPT_EPRST7_Pos)              /**< (USBHS_DEVEPT) Endpoint 7 Reset Mask */
#define USBHS_DEVEPT_EPRST8_Pos               (24)                                           /**< (USBHS_DEVEPT) Endpoint 8 Reset Position */
#define USBHS_DEVEPT_EPRST8_Msk               (0x1U << USBHS_DEVEPT_EPRST8_Pos)              /**< (USBHS_DEVEPT) Endpoint 8 Reset Mask */
#define USBHS_DEVEPT_EPRST9_Pos               (25)                                           /**< (USBHS_DEVEPT) Endpoint 9 Reset Position */
#define USBHS_DEVEPT_EPRST9_Msk               (0x1U << USBHS_DEVEPT_EPRST9_Pos)              /**< (USBHS_DEVEPT) Endpoint 9 Reset Mask */
#define USBHS_DEVEPT_Msk                      (0x03FF03FFUL)                                 /**< (USBHS_DEVEPT) Register Mask  */
#define USBHS_DEVEPT_EPEN_Pos                 (0)                                            /**< (USBHS_DEVEPT Position) Endpoint x Enable */
#define USBHS_DEVEPT_EPEN_Msk                 (0x3FFU << USBHS_DEVEPT_EPEN_Pos)              /**< (USBHS_DEVEPT Mask) EPEN */
#define USBHS_DEVEPT_EPEN(value)              (USBHS_DEVEPT_EPEN_Msk & ((value) << USBHS_DEVEPT_EPEN_Pos))
#define USBHS_DEVEPT_EPRST_Pos                (16)                                           /**< (USBHS_DEVEPT Position) Endpoint 9 Reset */
#define USBHS_DEVEPT_EPRST_Msk                (0x3FFU << USBHS_DEVEPT_EPRST_Pos)             /**< (USBHS_DEVEPT Mask) EPRST */
#define USBHS_DEVEPT_EPRST(value)             (USBHS_DEVEPT_EPRST_Msk & ((value) << USBHS_DEVEPT_EPRST_Pos))

/* -------- USBHS_DEVFNUM : (USBHS Offset: 0x20) (R/ 32) Device Frame Number Register -------- */

typedef union
{
  struct
  {
    uint32_t MFNUM:3;                   /**< bit:   0..2  Micro Frame Number                            */
    uint32_t FNUM:11;                   /**< bit:  3..13  Frame Number                                  */
    uint32_t :1;                        /**< bit:     14  Reserved                                      */
    uint32_t FNCERR:1;                  /**< bit:     15  Frame Number CRC Error                        */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVFNUM_bits_t;

