zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_DEVEPTICR : (USBHS Offset: 0x160) (/W 32) Device Endpoint Clear Register -------- */

typedef union
{
  struct
  {
    uint32_t TXINIC:1;                  /**< bit:      0  Transmitted IN Data Interrupt Clear           */
    uint32_t RXOUTIC:1;                 /**< bit:      1  Received OUT Data Interrupt Clear             */
    uint32_t RXSTPIC:1;                 /**< bit:      2  Received SETUP Interrupt Clear                */
    uint32_t NAKOUTIC:1;                /**< bit:      3  NAKed OUT Interrupt Clear                     */
    uint32_t NAKINIC:1;                 /**< bit:      4  NAKed IN Interrupt Clear                      */
    uint32_t OVERFIC:1;                 /**< bit:      5  Overflow Interrupt Clear                      */
    uint32_t STALLEDIC:1;               /**< bit:      6  STALLed Interrupt Clear                       */
    uint32_t SHORTPACKETC:1;            /**< bit:      7  Short Packet Interrupt Clear                  */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFIC:1;                /**< bit:      2  Underflow Interrupt Clear                     */
    uint32_t HBISOINERRIC:1;            /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt Clear */
    uint32_t HBISOFLUSHIC:1;            /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt Clear */
    uint32_t :1;                        /**< bit:      5  Reserved                                      */
    uint32_t CRCERRIC:1;                /**< bit:      6  CRC Error Interrupt Clear                     */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVEPTICR_bits_t;

#define USBHS_DEVEPTICR_TXINIC_Pos            (0)                                            /**< (USBHS_DEVEPTICR) Transmitted IN Data Interrupt Clear Position */
#define USBHS_DEVEPTICR_TXINIC_Msk            (0x1U << USBHS_DEVEPTICR_TXINIC_Pos)           /**< (USBHS_DEVEPTICR) Transmitted IN Data Interrupt Clear Mask */
#define USBHS_DEVEPTICR_RXOUTIC_Pos           (1)                                            /**< (USBHS_DEVEPTICR) Received OUT Data Interrupt Clear Position */
#define USBHS_DEVEPTICR_RXOUTIC_Msk           (0x1U << USBHS_DEVEPTICR_RXOUTIC_Pos)          /**< (USBHS_DEVEPTICR) Received OUT Data Interrupt Clear Mask */
#define USBHS_DEVEPTICR_RXSTPIC_Pos           (2)                                            /**< (USBHS_DEVEPTICR) Received SETUP Interrupt Clear Position */
#define USBHS_DEVEPTICR_RXSTPIC_Msk           (0x1U << USBHS_DEVEPTICR_RXSTPIC_Pos)          /**< (USBHS_DEVEPTICR) Received SETUP Interrupt Clear Mask */
#define USBHS_DEVEPTICR_NAKOUTIC_Pos          (3)                                            /**< (USBHS_DEVEPTICR) NAKed OUT Interrupt Clear Position */
#define USBHS_DEVEPTICR_NAKOUTIC_Msk          (0x1U << USBHS_DEVEPTICR_NAKOUTIC_Pos)         /**< (USBHS_DEVEPTICR) NAKed OUT Interrupt Clear Mask */
#define USBHS_DEVEPTICR_NAKINIC_Pos           (4)                                            /**< (USBHS_DEVEPTICR) NAKed IN Interrupt Clear Position */
#define USBHS_DEVEPTICR_NAKINIC_Msk           (0x1U << USBHS_DEVEPTICR_NAKINIC_Pos)          /**< (USBHS_DEVEPTICR) NAKed IN Interrupt Clear Mask */
#define USBHS_DEVEPTICR_OVERFIC_Pos           (5)                                            /**< (USBHS_DEVEPTICR) Overflow Interrupt Clear Position */
#define USBHS_DEVEPTICR_OVERFIC_Msk           (0x1U << USBHS_DEVEPTICR_OVERFIC_Pos)          /**< (USBHS_DEVEPTICR) Overflow Interrupt Clear Mask */
#define USBHS_DEVEPTICR_STALLEDIC_Pos         (6)                                            /**< (USBHS_DEVEPTICR) STALLed Interrupt Clear Position */
#define USBHS_DEVEPTICR_STALLEDIC_Msk         (0x1U << USBHS_DEVEPTICR_STALLEDIC_Pos)        /**< (USBHS_DEVEPTICR) STALLed Interrupt Clear Mask */
#define USBHS_DEVEPTICR_SHORTPACKETC_Pos      (7)                                            /**< (USBHS_DEVEPTICR) Short Packet Interrupt Clear Position */
#define USBHS_DEVEPTICR_SHORTPACKETC_Msk      (0x1U << USBHS_DEVEPTICR_SHORTPACKETC_Pos)     /**< (USBHS_DEVEPTICR) Short Packet Interrupt Clear Mask */
/* Isochronous Endpoints mode */
#define USBHS_DEVEPTICR_UNDERFIC_Pos          (2)                                            /**< (USBHS_DEVEPTICR) Underflow Interrupt Clear Position */
#define USBHS_DEVEPTICR_UNDERFIC_Msk          (0x1U << USBHS_DEVEPTICR_UNDERFIC_Pos)         /**< (USBHS_DEVEPTICR) Underflow Interrupt Clear Mask */
#define USBHS_DEVEPTICR_HBISOINERRIC_Pos      (3)                                            /**< (USBHS_DEVEPTICR) High Bandwidth Isochronous IN Underflow Error Interrupt Clear Position */
#define USBHS_DEVEPTICR_HBISOINERRIC_Msk      (0x1U << USBHS_DEVEPTICR_HBISOINERRIC_Pos)     /**< (USBHS_DEVEPTICR) High Bandwidth Isochronous IN Underflow Error Interrupt Clear Mask */
#define USBHS_DEVEPTICR_HBISOFLUSHIC_Pos      (4)                                            /**< (USBHS_DEVEPTICR) High Bandwidth Isochronous IN Flush Interrupt Clear Position */
#define USBHS_DEVEPTICR_HBISOFLUSHIC_Msk      (0x1U << USBHS_DEVEPTICR_HBISOFLUSHIC_Pos)     /**< (USBHS_DEVEPTICR) High Bandwidth Isochronous IN Flush Interrupt Clear Mask */
#define USBHS_DEVEPTICR_CRCERRIC_Pos          (6)                                            /**< (USBHS_DEVEPTICR) CRC Error Interrupt Clear Position */
#define USBHS_DEVEPTICR_CRCERRIC_Msk          (0x1U << USBHS_DEVEPTICR_CRCERRIC_Pos)         /**< (USBHS_DEVEPTICR) CRC Error Interrupt Clear Mask */

/* -------- USBHS_DEVEPTIFR : (USBHS Offset: 0x190) (/W 32) Device Endpoint Set Register -------- */

typedef union
{
  struct
  {
    uint32_t TXINIS:1;                  /**< bit:      0  Transmitted IN Data Interrupt Set             */
    uint32_t RXOUTIS:1;                 /**< bit:      1  Received OUT Data Interrupt Set               */
    uint32_t RXSTPIS:1;                 /**< bit:      2  Received SETUP Interrupt Set                  */
    uint32_t NAKOUTIS:1;                /**< bit:      3  NAKed OUT Interrupt Set                       */
    uint32_t NAKINIS:1;                 /**< bit:      4  NAKed IN Interrupt Set                        */
    uint32_t OVERFIS:1;                 /**< bit:      5  Overflow Interrupt Set                        */
    uint32_t STALLEDIS:1;               /**< bit:      6  STALLed Interrupt Set                         */
    uint32_t SHORTPACKETS:1;            /**< bit:      7  Short Packet Interrupt Set                    */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t NBUSYBKS:1;                /**< bit:     12  Number of Busy Banks Interrupt Set            */
    uint32_t :19;                       /**< bit: 13..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFIS:1;                /**< bit:      2  Underflow Interrupt Set                       */
    uint32_t HBISOINERRIS:1;            /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt Set */
    uint32_t HBISOFLUSHIS:1;            /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt Set */
    uint32_t :1;                        /**< bit:      5  Reserved                                      */
    uint32_t CRCERRIS:1;                /**< bit:      6  CRC Error Interrupt Set                       */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVEPTIFR_bits_t;

#define USBHS_DEVEPTIFR_TXINIS_Pos            (0)                                            /**< (USBHS_DEVEPTIFR) Transmitted IN Data Interrupt Set Position */
#define USBHS_DEVEPTIFR_TXINIS_Msk            (0x1U << USBHS_DEVEPTIFR_TXINIS_Pos)           /**< (USBHS_DEVEPTIFR) Transmitted IN Data Interrupt Set Mask */
#define USBHS_DEVEPTIFR_RXOUTIS_Pos           (1)                                            /**< (USBHS_DEVEPTIFR) Received OUT Data Interrupt Set Position */
#define USBHS_DEVEPTIFR_RXOUTIS_Msk           (0x1U << USBHS_DEVEPTIFR_RXOUTIS_Pos)          /**< (USBHS_DEVEPTIFR) Received OUT Data Interrupt Set Mask */
#define USBHS_DEVEPTIFR_RXSTPIS_Pos           (2)                                            /**< (USBHS_DEVEPTIFR) Received SETUP Interrupt Set Position */
#define USBHS_DEVEPTIFR_RXSTPIS_Msk           (0x1U << USBHS_DEVEPTIFR_RXSTPIS_Pos)          /**< (USBHS_DEVEPTIFR) Received SETUP Interrupt Set Mask */
#define USBHS_DEVEPTIFR_NAKOUTIS_Pos          (3)                                            /**< (USBHS_DEVEPTIFR) NAKed OUT Interrupt Set Position */
#define USBHS_DEVEPTIFR_NAKOUTIS_Msk          (0x1U << USBHS_DEVEPTIFR_NAKOUTIS_Pos)         /**< (USBHS_DEVEPTIFR) NAKed OUT Interrupt Set Mask */
#define USBHS_DEVEPTIFR_NAKINIS_Pos           (4)                                            /**< (USBHS_DEVEPTIFR) NAKed IN Interrupt Set Position */
#define USBHS_DEVEPTIFR_NAKINIS_Msk           (0x1U << USBHS_DEVEPTIFR_NAKINIS_Pos)          /**< (USBHS_DEVEPTIFR) NAKed IN Interrupt Set Mask */
#define USBHS_DEVEPTIFR_OVERFIS_Pos           (5)                                            /**< (USBHS_DEVEPTIFR) Overflow Interrupt Set Position */
#define USBHS_DEVEPTIFR_OVERFIS_Msk           (0x1U << USBHS_DEVEPTIFR_OVERFIS_Pos)          /**< (USBHS_DEVEPTIFR) Overflow Interrupt Set Mask */
#define USBHS_DEVEPTIFR_STALLEDIS_Pos         (6)                                            /**< (USBHS_DEVEPTIFR) STALLed Interrupt Set Position */
#define USBHS_DEVEPTIFR_STALLEDIS_Msk         (0x1U << USBHS_DEVEPTIFR_STALLEDIS_Pos)        /**< (USBHS_DEVEPTIFR) STALLed Interrupt Set Mask */
#define USBHS_DEVEPTIFR_SHORTPACKETS_Pos      (7)                                            /**< (USBHS_DEVEPTIFR) Short Packet Interrupt Set Position */
#define USBHS_DEVEPTIFR_SHORTPACKETS_Msk      (0x1U << USBHS_DEVEPTIFR_SHORTPACKETS_Pos)     /**< (USBHS_DEVEPTIFR) Short Packet Interrupt Set Mask */
#define USBHS_DEVEPTIFR_NBUSYBKS_Pos          (12)                                           /**< (USBHS_DEVEPTIFR) Number of Busy Banks Interrupt Set Position */
#define USBHS_DEVEPTIFR_NBUSYBKS_Msk          (0x1U << USBHS_DEVEPTIFR_NBUSYBKS_Pos)         /**< (USBHS_DEVEPTIFR) Number of Busy Banks Interrupt Set Mask */
/* Isochronous Endpoints mode */
#define USBHS_DEVEPTIFR_UNDERFIS_Pos          (2)                                            /**< (USBHS_DEVEPTIFR) Underflow Interrupt Set Position */
#define USBHS_DEVEPTIFR_UNDERFIS_Msk          (0x1U << USBHS_DEVEPTIFR_UNDERFIS_Pos)         /**< (USBHS_DEVEPTIFR) Underflow Interrupt Set Mask */
#define USBHS_DEVEPTIFR_HBISOINERRIS_Pos      (3)                                            /**< (USBHS_DEVEPTIFR) High Bandwidth Isochronous IN Underflow Error Interrupt Set Position */
#define USBHS_DEVEPTIFR_HBISOINERRIS_Msk      (0x1U << USBHS_DEVEPTIFR_HBISOINERRIS_Pos)     /**< (USBHS_DEVEPTIFR) High Bandwidth Isochronous IN Underflow Error Interrupt Set Mask */
#define USBHS_DEVEPTIFR_HBISOFLUSHIS_Pos      (4)                                            /**< (USBHS_DEVEPTIFR) High Bandwidth Isochronous IN Flush Interrupt Set Position */
#define USBHS_DEVEPTIFR_HBISOFLUSHIS_Msk      (0x1U << USBHS_DEVEPTIFR_HBISOFLUSHIS_Pos)     /**< (USBHS_DEVEPTIFR) High Bandwidth Isochronous IN Flush Interrupt Set Mask */
#define USBHS_DEVEPTIFR_CRCERRIS_Pos          (6)                                            /**< (USBHS_DEVEPTIFR) CRC Error Interrupt Set Position */
#define USBHS_DEVEPTIFR_CRCERRIS_Msk          (0x1U << USBHS_DEVEPTIFR_CRCERRIS_Pos)         /**< (USBHS_DEVEPTIFR) CRC Error Interrupt Set Mask */

