zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_DEVEPTIMR : (USBHS Offset: 0x1c0) (R/ 32) Device Endpoint Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t TXINE:1;                   /**< bit:      0  Transmitted IN Data Interrupt                 */
    uint32_t RXOUTE:1;                  /**< bit:      1  Received OUT Data Interrupt                   */
    uint32_t RXSTPE:1;                  /**< bit:      2  Received SETUP Interrupt                      */
    uint32_t NAKOUTE:1;                 /**< bit:      3  NAKed OUT Interrupt                           */
    uint32_t NAKINE:1;                  /**< bit:      4  NAKed IN Interrupt                            */
    uint32_t OVERFE:1;                  /**< bit:      5  Overflow Interrupt                            */
    uint32_t STALLEDE:1;                /**< bit:      6  STALLed Interrupt                             */
    uint32_t SHORTPACKETE:1;            /**< bit:      7  Short Packet Interrupt                        */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t NBUSYBKE:1;                /**< bit:     12  Number of Busy Banks Interrupt                */
    uint32_t KILLBK:1;                  /**< bit:     13  Kill IN Bank                                  */
    uint32_t FIFOCON:1;                 /**< bit:     14  FIFO Control                                  */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t EPDISHDMA:1;               /**< bit:     16  Endpoint Interrupts Disable HDMA Request      */
    uint32_t :1;                        /**< bit:     17  Reserved                                      */
    uint32_t RSTDT:1;                   /**< bit:     18  Reset Data Toggle                             */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  struct
  { // Control, Bulk and Interrupt Endpoints mode
    uint32_t :17;                       /**< bit:  0..16  Reserved                                      */
    uint32_t NYETDIS:1;                 /**< bit:     17  NYET Token Disable                            */
    uint32_t :1;                        /**< bit:     18  Reserved                                      */
    uint32_t STALLRQ:1;                 /**< bit:     19  STALL Request                                 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFE:1;                 /**< bit:      2  Underflow Interrupt                           */
    uint32_t HBISOINERRE:1;             /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt */
    uint32_t HBISOFLUSHE:1;             /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt */
    uint32_t :1;                        /**< bit:      5  Reserved                                      */
    uint32_t CRCERRE:1;                 /**< bit:      6  CRC Error Interrupt                           */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t MDATAE:1;                  /**< bit:      8  MData Interrupt                               */
    uint32_t DATAXE:1;                  /**< bit:      9  DataX Interrupt                               */
    uint32_t ERRORTRANSE:1;             /**< bit:     10  Transaction Error Interrupt                   */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVEPTIMR_bits_t;

#define USBHS_DEVEPTIMR_TXINE_Pos             (0)                                            /**< (USBHS_DEVEPTIMR) Transmitted IN Data Interrupt Position */
#define USBHS_DEVEPTIMR_TXINE_Msk             (0x1U << USBHS_DEVEPTIMR_TXINE_Pos)            /**< (USBHS_DEVEPTIMR) Transmitted IN Data Interrupt Mask */
#define USBHS_DEVEPTIMR_RXOUTE_Pos            (1)                                            /**< (USBHS_DEVEPTIMR) Received OUT Data Interrupt Position */
#define USBHS_DEVEPTIMR_RXOUTE_Msk            (0x1U << USBHS_DEVEPTIMR_RXOUTE_Pos)           /**< (USBHS_DEVEPTIMR) Received OUT Data Interrupt Mask */
#define USBHS_DEVEPTIMR_RXSTPE_Pos            (2)                                            /**< (USBHS_DEVEPTIMR) Received SETUP Interrupt Position */
#define USBHS_DEVEPTIMR_RXSTPE_Msk            (0x1U << USBHS_DEVEPTIMR_RXSTPE_Pos)           /**< (USBHS_DEVEPTIMR) Received SETUP Interrupt Mask */
#define USBHS_DEVEPTIMR_NAKOUTE_Pos           (3)                                            /**< (USBHS_DEVEPTIMR) NAKed OUT Interrupt Position */
#define USBHS_DEVEPTIMR_NAKOUTE_Msk           (0x1U << USBHS_DEVEPTIMR_NAKOUTE_Pos)          /**< (USBHS_DEVEPTIMR) NAKed OUT Interrupt Mask */
#define USBHS_DEVEPTIMR_NAKINE_Pos            (4)                                            /**< (USBHS_DEVEPTIMR) NAKed IN Interrupt Position */
#define USBHS_DEVEPTIMR_NAKINE_Msk            (0x1U << USBHS_DEVEPTIMR_NAKINE_Pos)           /**< (USBHS_DEVEPTIMR) NAKed IN Interrupt Mask */
#define USBHS_DEVEPTIMR_OVERFE_Pos            (5)                                            /**< (USBHS_DEVEPTIMR) Overflow Interrupt Position */
#define USBHS_DEVEPTIMR_OVERFE_Msk            (0x1U << USBHS_DEVEPTIMR_OVERFE_Pos)           /**< (USBHS_DEVEPTIMR) Overflow Interrupt Mask */
#define USBHS_DEVEPTIMR_STALLEDE_Pos          (6)                                            /**< (USBHS_DEVEPTIMR) STALLed Interrupt Position */
#define USBHS_DEVEPTIMR_STALLEDE_Msk          (0x1U << USBHS_DEVEPTIMR_STALLEDE_Pos)         /**< (USBHS_DEVEPTIMR) STALLed Interrupt Mask */
#define USBHS_DEVEPTIMR_SHORTPACKETE_Pos      (7)                                            /**< (USBHS_DEVEPTIMR) Short Packet Interrupt Position */
#define USBHS_DEVEPTIMR_SHORTPACKETE_Msk      (0x1U << USBHS_DEVEPTIMR_SHORTPACKETE_Pos)     /**< (USBHS_DEVEPTIMR) Short Packet Interrupt Mask */
#define USBHS_DEVEPTIMR_NBUSYBKE_Pos          (12)                                           /**< (USBHS_DEVEPTIMR) Number of Busy Banks Interrupt Position */
#define USBHS_DEVEPTIMR_NBUSYBKE_Msk          (0x1U << USBHS_DEVEPTIMR_NBUSYBKE_Pos)         /**< (USBHS_DEVEPTIMR) Number of Busy Banks Interrupt Mask */
#define USBHS_DEVEPTIMR_KILLBK_Pos            (13)                                           /**< (USBHS_DEVEPTIMR) Kill IN Bank Position */
#define USBHS_DEVEPTIMR_KILLBK_Msk            (0x1U << USBHS_DEVEPTIMR_KILLBK_Pos)           /**< (USBHS_DEVEPTIMR) Kill IN Bank Mask */
#define USBHS_DEVEPTIMR_FIFOCON_Pos           (14)                                           /**< (USBHS_DEVEPTIMR) FIFO Control Position */
#define USBHS_DEVEPTIMR_FIFOCON_Msk           (0x1U << USBHS_DEVEPTIMR_FIFOCON_Pos)          /**< (USBHS_DEVEPTIMR) FIFO Control Mask */
#define USBHS_DEVEPTIMR_EPDISHDMA_Pos         (16)                                           /**< (USBHS_DEVEPTIMR) Endpoint Interrupts Disable HDMA Request Position */
#define USBHS_DEVEPTIMR_EPDISHDMA_Msk         (0x1U << USBHS_DEVEPTIMR_EPDISHDMA_Pos)        /**< (USBHS_DEVEPTIMR) Endpoint Interrupts Disable HDMA Request Mask */
#define USBHS_DEVEPTIMR_RSTDT_Pos             (18)                                           /**< (USBHS_DEVEPTIMR) Reset Data Toggle Position */
#define USBHS_DEVEPTIMR_RSTDT_Msk             (0x1U << USBHS_DEVEPTIMR_RSTDT_Pos)            /**< (USBHS_DEVEPTIMR) Reset Data Toggle Mask */
/* Control, Bulk and Interrupt Endpoints mode */
#define USBHS_DEVEPTIMR_NYETDIS_Pos           (17)                                           /**< (USBHS_DEVEPTIMR) NYET Token Disable Position */
#define USBHS_DEVEPTIMR_NYETDIS_Msk           (0x1U << USBHS_DEVEPTIMR_NYETDIS_Pos)          /**< (USBHS_DEVEPTIMR) NYET Token Disable Mask */
#define USBHS_DEVEPTIMR_STALLRQ_Pos           (19)                                           /**< (USBHS_DEVEPTIMR) STALL Request Position */
#define USBHS_DEVEPTIMR_STALLRQ_Msk           (0x1U << USBHS_DEVEPTIMR_STALLRQ_Pos)          /**< (USBHS_DEVEPTIMR) STALL Request Mask */
/* Isochronous Endpoints mode */
#define USBHS_DEVEPTIMR_UNDERFE_Pos           (2)                                            /**< (USBHS_DEVEPTIMR) Underflow Interrupt Position */
#define USBHS_DEVEPTIMR_UNDERFE_Msk           (0x1U << USBHS_DEVEPTIMR_UNDERFE_Pos)          /**< (USBHS_DEVEPTIMR) Underflow Interrupt Mask */
#define USBHS_DEVEPTIMR_HBISOINERRE_Pos       (3)                                            /**< (USBHS_DEVEPTIMR) High Bandwidth Isochronous IN Underflow Error Interrupt Position */
#define USBHS_DEVEPTIMR_HBISOINERRE_Msk       (0x1U << USBHS_DEVEPTIMR_HBISOINERRE_Pos)      /**< (USBHS_DEVEPTIMR) High Bandwidth Isochronous IN Underflow Error Interrupt Mask */
#define USBHS_DEVEPTIMR_HBISOFLUSHE_Pos       (4)                                            /**< (USBHS_DEVEPTIMR) High Bandwidth Isochronous IN Flush Interrupt Position */
#define USBHS_DEVEPTIMR_HBISOFLUSHE_Msk       (0x1U << USBHS_DEVEPTIMR_HBISOFLUSHE_Pos)      /**< (USBHS_DEVEPTIMR) High Bandwidth Isochronous IN Flush Interrupt Mask */
#define USBHS_DEVEPTIMR_CRCERRE_Pos           (6)                                            /**< (USBHS_DEVEPTIMR) CRC Error Interrupt Position */
#define USBHS_DEVEPTIMR_CRCERRE_Msk           (0x1U << USBHS_DEVEPTIMR_CRCERRE_Pos)          /**< (USBHS_DEVEPTIMR) CRC Error Interrupt Mask */
#define USBHS_DEVEPTIMR_MDATAE_Pos            (8)                                            /**< (USBHS_DEVEPTIMR) MData Interrupt Position */
#define USBHS_DEVEPTIMR_MDATAE_Msk            (0x1U << USBHS_DEVEPTIMR_MDATAE_Pos)           /**< (USBHS_DEVEPTIMR) MData Interrupt Mask */
#define USBHS_DEVEPTIMR_DATAXE_Pos            (9)                                            /**< (USBHS_DEVEPTIMR) DataX Interrupt Position */
#define USBHS_DEVEPTIMR_DATAXE_Msk            (0x1U << USBHS_DEVEPTIMR_DATAXE_Pos)           /**< (USBHS_DEVEPTIMR) DataX Interrupt Mask */
#define USBHS_DEVEPTIMR_ERRORTRANSE_Pos       (10)                                           /**< (USBHS_DEVEPTIMR) Transaction Error Interrupt Position */
#define USBHS_DEVEPTIMR_ERRORTRANSE_Msk       (0x1U << USBHS_DEVEPTIMR_ERRORTRANSE_Pos)      /**< (USBHS_DEVEPTIMR) Transaction Error Interrupt Mask */

/* -------- USBHS_DEVEPTIER : (USBHS Offset: 0x1f0) (/W 32) Device Endpoint Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t TXINES:1;                  /**< bit:      0  Transmitted IN Data Interrupt Enable          */
    uint32_t RXOUTES:1;                 /**< bit:      1  Received OUT Data Interrupt Enable            */
    uint32_t RXSTPES:1;                 /**< bit:      2  Received SETUP Interrupt Enable               */
    uint32_t NAKOUTES:1;                /**< bit:      3  NAKed OUT Interrupt Enable                    */
    uint32_t NAKINES:1;                 /**< bit:      4  NAKed IN Interrupt Enable                     */
    uint32_t OVERFES:1;                 /**< bit:      5  Overflow Interrupt Enable                     */
    uint32_t STALLEDES:1;               /**< bit:      6  STALLed Interrupt Enable                      */
    uint32_t SHORTPACKETES:1;           /**< bit:      7  Short Packet Interrupt Enable                 */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t NBUSYBKES:1;               /**< bit:     12  Number of Busy Banks Interrupt Enable         */
    uint32_t KILLBKS:1;                 /**< bit:     13  Kill IN Bank                                  */
    uint32_t FIFOCONS:1;                /**< bit:     14  FIFO Control                                  */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t EPDISHDMAS:1;              /**< bit:     16  Endpoint Interrupts Disable HDMA Request Enable */
    uint32_t :1;                        /**< bit:     17  Reserved                                      */
    uint32_t RSTDTS:1;                  /**< bit:     18  Reset Data Toggle Enable                      */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  struct
  { // Control, Bulk and Interrupt Endpoints mode
    uint32_t :17;                       /**< bit:  0..16  Reserved                                      */
    uint32_t NYETDISS:1;                /**< bit:     17  NYET Token Disable Enable                     */
    uint32_t :1;                        /**< bit:     18  Reserved                                      */
    uint32_t STALLRQS:1;                /**< bit:     19  STALL Request Enable                          */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFES:1;                /**< bit:      2  Underflow Interrupt Enable                    */
    uint32_t HBISOINERRES:1;            /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt Enable */
    uint32_t HBISOFLUSHES:1;            /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt Enable */
    uint32_t :1;                        /**< bit:      5  Reserved                                      */
    uint32_t CRCERRES:1;                /**< bit:      6  CRC Error Interrupt Enable                    */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t MDATAES:1;                 /**< bit:      8  MData Interrupt Enable                        */
    uint32_t DATAXES:1;                 /**< bit:      9  DataX Interrupt Enable                        */
    uint32_t ERRORTRANSES:1;            /**< bit:     10  Transaction Error Interrupt Enable            */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVEPTIER_bits_t;

