zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_DEVEPTIER_TXINES_Pos            (0)                                            /**< (USBHS_DEVEPTIER) Transmitted IN Data Interrupt Enable Position */
#define USBHS_DEVEPTIER_TXINES_Msk            (0x1U << USBHS_DEVEPTIER_TXINES_Pos)           /**< (USBHS_DEVEPTIER) Transmitted IN Data Interrupt Enable Mask */
#define USBHS_DEVEPTIER_RXOUTES_Pos           (1)                                            /**< (USBHS_DEVEPTIER) Received OUT Data Interrupt Enable Position */
#define USBHS_DEVEPTIER_RXOUTES_Msk           (0x1U << USBHS_DEVEPTIER_RXOUTES_Pos)          /**< (USBHS_DEVEPTIER) Received OUT Data Interrupt Enable Mask */
#define USBHS_DEVEPTIER_RXSTPES_Pos           (2)                                            /**< (USBHS_DEVEPTIER) Received SETUP Interrupt Enable Position */
#define USBHS_DEVEPTIER_RXSTPES_Msk           (0x1U << USBHS_DEVEPTIER_RXSTPES_Pos)          /**< (USBHS_DEVEPTIER) Received SETUP Interrupt Enable Mask */
#define USBHS_DEVEPTIER_NAKOUTES_Pos          (3)                                            /**< (USBHS_DEVEPTIER) NAKed OUT Interrupt Enable Position */
#define USBHS_DEVEPTIER_NAKOUTES_Msk          (0x1U << USBHS_DEVEPTIER_NAKOUTES_Pos)         /**< (USBHS_DEVEPTIER) NAKed OUT Interrupt Enable Mask */
#define USBHS_DEVEPTIER_NAKINES_Pos           (4)                                            /**< (USBHS_DEVEPTIER) NAKed IN Interrupt Enable Position */
#define USBHS_DEVEPTIER_NAKINES_Msk           (0x1U << USBHS_DEVEPTIER_NAKINES_Pos)          /**< (USBHS_DEVEPTIER) NAKed IN Interrupt Enable Mask */
#define USBHS_DEVEPTIER_OVERFES_Pos           (5)                                            /**< (USBHS_DEVEPTIER) Overflow Interrupt Enable Position */
#define USBHS_DEVEPTIER_OVERFES_Msk           (0x1U << USBHS_DEVEPTIER_OVERFES_Pos)          /**< (USBHS_DEVEPTIER) Overflow Interrupt Enable Mask */
#define USBHS_DEVEPTIER_STALLEDES_Pos         (6)                                            /**< (USBHS_DEVEPTIER) STALLed Interrupt Enable Position */
#define USBHS_DEVEPTIER_STALLEDES_Msk         (0x1U << USBHS_DEVEPTIER_STALLEDES_Pos)        /**< (USBHS_DEVEPTIER) STALLed Interrupt Enable Mask */
#define USBHS_DEVEPTIER_SHORTPACKETES_Pos     (7)                                            /**< (USBHS_DEVEPTIER) Short Packet Interrupt Enable Position */
#define USBHS_DEVEPTIER_SHORTPACKETES_Msk     (0x1U << USBHS_DEVEPTIER_SHORTPACKETES_Pos)    /**< (USBHS_DEVEPTIER) Short Packet Interrupt Enable Mask */
#define USBHS_DEVEPTIER_NBUSYBKES_Pos         (12)                                           /**< (USBHS_DEVEPTIER) Number of Busy Banks Interrupt Enable Position */
#define USBHS_DEVEPTIER_NBUSYBKES_Msk         (0x1U << USBHS_DEVEPTIER_NBUSYBKES_Pos)        /**< (USBHS_DEVEPTIER) Number of Busy Banks Interrupt Enable Mask */
#define USBHS_DEVEPTIER_KILLBKS_Pos           (13)                                           /**< (USBHS_DEVEPTIER) Kill IN Bank Position */
#define USBHS_DEVEPTIER_KILLBKS_Msk           (0x1U << USBHS_DEVEPTIER_KILLBKS_Pos)          /**< (USBHS_DEVEPTIER) Kill IN Bank Mask */
#define USBHS_DEVEPTIER_FIFOCONS_Pos          (14)                                           /**< (USBHS_DEVEPTIER) FIFO Control Position */
#define USBHS_DEVEPTIER_FIFOCONS_Msk          (0x1U << USBHS_DEVEPTIER_FIFOCONS_Pos)         /**< (USBHS_DEVEPTIER) FIFO Control Mask */
#define USBHS_DEVEPTIER_EPDISHDMAS_Pos        (16)                                           /**< (USBHS_DEVEPTIER) Endpoint Interrupts Disable HDMA Request Enable Position */
#define USBHS_DEVEPTIER_EPDISHDMAS_Msk        (0x1U << USBHS_DEVEPTIER_EPDISHDMAS_Pos)       /**< (USBHS_DEVEPTIER) Endpoint Interrupts Disable HDMA Request Enable Mask */
#define USBHS_DEVEPTIER_RSTDTS_Pos            (18)                                           /**< (USBHS_DEVEPTIER) Reset Data Toggle Enable Position */
#define USBHS_DEVEPTIER_RSTDTS_Msk            (0x1U << USBHS_DEVEPTIER_RSTDTS_Pos)           /**< (USBHS_DEVEPTIER) Reset Data Toggle Enable Mask */
/* Control, Bulk and Interrupt Endpoints mode */
#define USBHS_DEVEPTIER_NYETDISS_Pos          (17)                                           /**< (USBHS_DEVEPTIER) NYET Token Disable Enable Position */
#define USBHS_DEVEPTIER_NYETDISS_Msk          (0x1U << USBHS_DEVEPTIER_NYETDISS_Pos)         /**< (USBHS_DEVEPTIER) NYET Token Disable Enable Mask */
#define USBHS_DEVEPTIER_STALLRQS_Pos          (19)                                           /**< (USBHS_DEVEPTIER) STALL Request Enable Position */
#define USBHS_DEVEPTIER_STALLRQS_Msk          (0x1U << USBHS_DEVEPTIER_STALLRQS_Pos)         /**< (USBHS_DEVEPTIER) STALL Request Enable Mask */
/* Isochronous Endpoints mode */
#define USBHS_DEVEPTIER_UNDERFES_Pos          (2)                                            /**< (USBHS_DEVEPTIER) Underflow Interrupt Enable Position */
#define USBHS_DEVEPTIER_UNDERFES_Msk          (0x1U << USBHS_DEVEPTIER_UNDERFES_Pos)         /**< (USBHS_DEVEPTIER) Underflow Interrupt Enable Mask */
#define USBHS_DEVEPTIER_HBISOINERRES_Pos      (3)                                            /**< (USBHS_DEVEPTIER) High Bandwidth Isochronous IN Underflow Error Interrupt Enable Position */
#define USBHS_DEVEPTIER_HBISOINERRES_Msk      (0x1U << USBHS_DEVEPTIER_HBISOINERRES_Pos)     /**< (USBHS_DEVEPTIER) High Bandwidth Isochronous IN Underflow Error Interrupt Enable Mask */
#define USBHS_DEVEPTIER_HBISOFLUSHES_Pos      (4)                                            /**< (USBHS_DEVEPTIER) High Bandwidth Isochronous IN Flush Interrupt Enable Position */
#define USBHS_DEVEPTIER_HBISOFLUSHES_Msk      (0x1U << USBHS_DEVEPTIER_HBISOFLUSHES_Pos)     /**< (USBHS_DEVEPTIER) High Bandwidth Isochronous IN Flush Interrupt Enable Mask */
#define USBHS_DEVEPTIER_CRCERRES_Pos          (6)                                            /**< (USBHS_DEVEPTIER) CRC Error Interrupt Enable Position */
#define USBHS_DEVEPTIER_CRCERRES_Msk          (0x1U << USBHS_DEVEPTIER_CRCERRES_Pos)         /**< (USBHS_DEVEPTIER) CRC Error Interrupt Enable Mask */
#define USBHS_DEVEPTIER_MDATAES_Pos           (8)                                            /**< (USBHS_DEVEPTIER) MData Interrupt Enable Position */
#define USBHS_DEVEPTIER_MDATAES_Msk           (0x1U << USBHS_DEVEPTIER_MDATAES_Pos)          /**< (USBHS_DEVEPTIER) MData Interrupt Enable Mask */
#define USBHS_DEVEPTIER_DATAXES_Pos           (9)                                            /**< (USBHS_DEVEPTIER) DataX Interrupt Enable Position */
#define USBHS_DEVEPTIER_DATAXES_Msk           (0x1U << USBHS_DEVEPTIER_DATAXES_Pos)          /**< (USBHS_DEVEPTIER) DataX Interrupt Enable Mask */
#define USBHS_DEVEPTIER_ERRORTRANSES_Pos      (10)                                           /**< (USBHS_DEVEPTIER) Transaction Error Interrupt Enable Position */
#define USBHS_DEVEPTIER_ERRORTRANSES_Msk      (0x1U << USBHS_DEVEPTIER_ERRORTRANSES_Pos)     /**< (USBHS_DEVEPTIER) Transaction Error Interrupt Enable Mask */

