zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_DEVEPTIDR : (USBHS Offset: 0x220) (/W 32) Device Endpoint Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t TXINEC:1;                  /**< bit:      0  Transmitted IN Interrupt Clear                */
    uint32_t RXOUTEC:1;                 /**< bit:      1  Received OUT Data Interrupt Clear             */
    uint32_t RXSTPEC:1;                 /**< bit:      2  Received SETUP Interrupt Clear                */
    uint32_t NAKOUTEC:1;                /**< bit:      3  NAKed OUT Interrupt Clear                     */
    uint32_t NAKINEC:1;                 /**< bit:      4  NAKed IN Interrupt Clear                      */
    uint32_t OVERFEC:1;                 /**< bit:      5  Overflow Interrupt Clear                      */
    uint32_t STALLEDEC:1;               /**< bit:      6  STALLed Interrupt Clear                       */
    uint32_t SHORTPACKETEC:1;           /**< bit:      7  Shortpacket Interrupt Clear                   */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t NBUSYBKEC:1;               /**< bit:     12  Number of Busy Banks Interrupt Clear          */
    uint32_t :1;                        /**< bit:     13  Reserved                                      */
    uint32_t FIFOCONC:1;                /**< bit:     14  FIFO Control Clear                            */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t EPDISHDMAC:1;              /**< bit:     16  Endpoint Interrupts Disable HDMA Request Clear */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  struct
  { // Control, Bulk and Interrupt Endpoints mode
    uint32_t :17;                       /**< bit:  0..16  Reserved                                      */
    uint32_t NYETDISC:1;                /**< bit:     17  NYET Token Disable Clear                      */
    uint32_t :1;                        /**< bit:     18  Reserved                                      */
    uint32_t STALLRQC:1;                /**< bit:     19  STALL Request Clear                           */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFEC:1;                /**< bit:      2  Underflow Interrupt Clear                     */
    uint32_t HBISOINERREC:1;            /**< bit:      3  High Bandwidth Isochronous IN Underflow Error Interrupt Clear */
    uint32_t HBISOFLUSHEC:1;            /**< bit:      4  High Bandwidth Isochronous IN Flush Interrupt Clear */
    uint32_t :3;                        /**< bit:   5..7  Reserved                                      */
    uint32_t MDATAEC:1;                 /**< bit:      8  MData Interrupt Clear                         */
    uint32_t DATAXEC:1;                 /**< bit:      9  DataX Interrupt Clear                         */
    uint32_t ERRORTRANSEC:1;            /**< bit:     10  Transaction Error Interrupt Clear             */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_DEVEPTIDR_bits_t;

#define USBHS_DEVEPTIDR_TXINEC_Pos            (0)                                            /**< (USBHS_DEVEPTIDR) Transmitted IN Interrupt Clear Position */
#define USBHS_DEVEPTIDR_TXINEC_Msk            (0x1U << USBHS_DEVEPTIDR_TXINEC_Pos)           /**< (USBHS_DEVEPTIDR) Transmitted IN Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_RXOUTEC_Pos           (1)                                            /**< (USBHS_DEVEPTIDR) Received OUT Data Interrupt Clear Position */
#define USBHS_DEVEPTIDR_RXOUTEC_Msk           (0x1U << USBHS_DEVEPTIDR_RXOUTEC_Pos)          /**< (USBHS_DEVEPTIDR) Received OUT Data Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_RXSTPEC_Pos           (2)                                            /**< (USBHS_DEVEPTIDR) Received SETUP Interrupt Clear Position */
#define USBHS_DEVEPTIDR_RXSTPEC_Msk           (0x1U << USBHS_DEVEPTIDR_RXSTPEC_Pos)          /**< (USBHS_DEVEPTIDR) Received SETUP Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_NAKOUTEC_Pos          (3)                                            /**< (USBHS_DEVEPTIDR) NAKed OUT Interrupt Clear Position */
#define USBHS_DEVEPTIDR_NAKOUTEC_Msk          (0x1U << USBHS_DEVEPTIDR_NAKOUTEC_Pos)         /**< (USBHS_DEVEPTIDR) NAKed OUT Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_NAKINEC_Pos           (4)                                            /**< (USBHS_DEVEPTIDR) NAKed IN Interrupt Clear Position */
#define USBHS_DEVEPTIDR_NAKINEC_Msk           (0x1U << USBHS_DEVEPTIDR_NAKINEC_Pos)          /**< (USBHS_DEVEPTIDR) NAKed IN Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_OVERFEC_Pos           (5)                                            /**< (USBHS_DEVEPTIDR) Overflow Interrupt Clear Position */
#define USBHS_DEVEPTIDR_OVERFEC_Msk           (0x1U << USBHS_DEVEPTIDR_OVERFEC_Pos)          /**< (USBHS_DEVEPTIDR) Overflow Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_STALLEDEC_Pos         (6)                                            /**< (USBHS_DEVEPTIDR) STALLed Interrupt Clear Position */
#define USBHS_DEVEPTIDR_STALLEDEC_Msk         (0x1U << USBHS_DEVEPTIDR_STALLEDEC_Pos)        /**< (USBHS_DEVEPTIDR) STALLed Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_SHORTPACKETEC_Pos     (7)                                            /**< (USBHS_DEVEPTIDR) Shortpacket Interrupt Clear Position */
#define USBHS_DEVEPTIDR_SHORTPACKETEC_Msk     (0x1U << USBHS_DEVEPTIDR_SHORTPACKETEC_Pos)    /**< (USBHS_DEVEPTIDR) Shortpacket Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_NBUSYBKEC_Pos         (12)                                           /**< (USBHS_DEVEPTIDR) Number of Busy Banks Interrupt Clear Position */
#define USBHS_DEVEPTIDR_NBUSYBKEC_Msk         (0x1U << USBHS_DEVEPTIDR_NBUSYBKEC_Pos)        /**< (USBHS_DEVEPTIDR) Number of Busy Banks Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_FIFOCONC_Pos          (14)                                           /**< (USBHS_DEVEPTIDR) FIFO Control Clear Position */
#define USBHS_DEVEPTIDR_FIFOCONC_Msk          (0x1U << USBHS_DEVEPTIDR_FIFOCONC_Pos)         /**< (USBHS_DEVEPTIDR) FIFO Control Clear Mask */
#define USBHS_DEVEPTIDR_EPDISHDMAC_Pos        (16)                                           /**< (USBHS_DEVEPTIDR) Endpoint Interrupts Disable HDMA Request Clear Position */
#define USBHS_DEVEPTIDR_EPDISHDMAC_Msk        (0x1U << USBHS_DEVEPTIDR_EPDISHDMAC_Pos)       /**< (USBHS_DEVEPTIDR) Endpoint Interrupts Disable HDMA Request Clear Mask */
/* Control, Bulk and Interrupt Endpoints mode */
#define USBHS_DEVEPTIDR_NYETDISC_Pos          (17)                                           /**< (USBHS_DEVEPTIDR) NYET Token Disable Clear Position */
#define USBHS_DEVEPTIDR_NYETDISC_Msk          (0x1U << USBHS_DEVEPTIDR_NYETDISC_Pos)         /**< (USBHS_DEVEPTIDR) NYET Token Disable Clear Mask */
#define USBHS_DEVEPTIDR_STALLRQC_Pos          (19)                                           /**< (USBHS_DEVEPTIDR) STALL Request Clear Position */
#define USBHS_DEVEPTIDR_STALLRQC_Msk          (0x1U << USBHS_DEVEPTIDR_STALLRQC_Pos)         /**< (USBHS_DEVEPTIDR) STALL Request Clear Mask */
/* Isochronous Endpoints mode */
#define USBHS_DEVEPTIDR_UNDERFEC_Pos          (2)                                            /**< (USBHS_DEVEPTIDR) Underflow Interrupt Clear Position */
#define USBHS_DEVEPTIDR_UNDERFEC_Msk          (0x1U << USBHS_DEVEPTIDR_UNDERFEC_Pos)         /**< (USBHS_DEVEPTIDR) Underflow Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_HBISOINERREC_Pos      (3)                                            /**< (USBHS_DEVEPTIDR) High Bandwidth Isochronous IN Underflow Error Interrupt Clear Position */
#define USBHS_DEVEPTIDR_HBISOINERREC_Msk      (0x1U << USBHS_DEVEPTIDR_HBISOINERREC_Pos)     /**< (USBHS_DEVEPTIDR) High Bandwidth Isochronous IN Underflow Error Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_HBISOFLUSHEC_Pos      (4)                                            /**< (USBHS_DEVEPTIDR) High Bandwidth Isochronous IN Flush Interrupt Clear Position */
#define USBHS_DEVEPTIDR_HBISOFLUSHEC_Msk      (0x1U << USBHS_DEVEPTIDR_HBISOFLUSHEC_Pos)     /**< (USBHS_DEVEPTIDR) High Bandwidth Isochronous IN Flush Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_MDATAEC_Pos           (8)                                            /**< (USBHS_DEVEPTIDR) MData Interrupt Clear Position */
#define USBHS_DEVEPTIDR_MDATAEC_Msk           (0x1U << USBHS_DEVEPTIDR_MDATAEC_Pos)          /**< (USBHS_DEVEPTIDR) MData Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_DATAXEC_Pos           (9)                                            /**< (USBHS_DEVEPTIDR) DataX Interrupt Clear Position */
#define USBHS_DEVEPTIDR_DATAXEC_Msk           (0x1U << USBHS_DEVEPTIDR_DATAXEC_Pos)          /**< (USBHS_DEVEPTIDR) DataX Interrupt Clear Mask */
#define USBHS_DEVEPTIDR_ERRORTRANSEC_Pos      (10)                                           /**< (USBHS_DEVEPTIDR) Transaction Error Interrupt Clear Position */
#define USBHS_DEVEPTIDR_ERRORTRANSEC_Msk      (0x1U << USBHS_DEVEPTIDR_ERRORTRANSEC_Pos)     /**< (USBHS_DEVEPTIDR) Transaction Error Interrupt Clear Mask */

