zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_HSTCTRL : (USBHS Offset: 0x400) (R/W 32) Host General Control Register -------- */

typedef union
{
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t SOFE:1;                    /**< bit:      8  Start of Frame Generation Enable              */
    uint32_t RESET:1;                   /**< bit:      9  Send USB Reset                                */
    uint32_t RESUME:1;                  /**< bit:     10  Send USB Resume                               */
    uint32_t :1;                        /**< bit:     11  Reserved                                      */
    uint32_t SPDCONF:2;                 /**< bit: 12..13  Mode Configuration                            */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTCTRL_bits_t;

#define USBHS_HSTCTRL_SOFE_Pos                (8)                                            /**< (USBHS_HSTCTRL) Start of Frame Generation Enable Position */
#define USBHS_HSTCTRL_SOFE_Msk                (0x1U << USBHS_HSTCTRL_SOFE_Pos)               /**< (USBHS_HSTCTRL) Start of Frame Generation Enable Mask */
#define USBHS_HSTCTRL_RESET_Pos               (9)                                            /**< (USBHS_HSTCTRL) Send USB Reset Position */
#define USBHS_HSTCTRL_RESET_Msk               (0x1U << USBHS_HSTCTRL_RESET_Pos)              /**< (USBHS_HSTCTRL) Send USB Reset Mask */
#define USBHS_HSTCTRL_RESUME_Pos              (10)                                           /**< (USBHS_HSTCTRL) Send USB Resume Position */
#define USBHS_HSTCTRL_RESUME_Msk              (0x1U << USBHS_HSTCTRL_RESUME_Pos)             /**< (USBHS_HSTCTRL) Send USB Resume Mask */
#define USBHS_HSTCTRL_SPDCONF_Pos             (12)                                           /**< (USBHS_HSTCTRL) Mode Configuration Position */
#define USBHS_HSTCTRL_SPDCONF_Msk             (0x3U << USBHS_HSTCTRL_SPDCONF_Pos)            /**< (USBHS_HSTCTRL) Mode Configuration Mask */
#define USBHS_HSTCTRL_SPDCONF(value)          (USBHS_HSTCTRL_SPDCONF_Msk & ((value) << USBHS_HSTCTRL_SPDCONF_Pos))
#define   USBHS_HSTCTRL_SPDCONF_NORMAL_Val    (0x0U)                                         /**< (USBHS_HSTCTRL) The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable.  */
#define   USBHS_HSTCTRL_SPDCONF_LOW_POWER_Val (0x1U)                                         /**< (USBHS_HSTCTRL) For a better consumption, if high speed is not needed.  */
#define   USBHS_HSTCTRL_SPDCONF_HIGH_SPEED_Val (0x2U)                                         /**< (USBHS_HSTCTRL) Forced high speed.  */
#define   USBHS_HSTCTRL_SPDCONF_FORCED_FS_Val (0x3U)                                         /**< (USBHS_HSTCTRL) The host remains in Full-speed mode whatever the peripheral speed capability.  */
#define USBHS_HSTCTRL_SPDCONF_NORMAL          (USBHS_HSTCTRL_SPDCONF_NORMAL_Val << USBHS_HSTCTRL_SPDCONF_Pos)  /**< (USBHS_HSTCTRL) The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable. Position  */
#define USBHS_HSTCTRL_SPDCONF_LOW_POWER       (USBHS_HSTCTRL_SPDCONF_LOW_POWER_Val << USBHS_HSTCTRL_SPDCONF_Pos)  /**< (USBHS_HSTCTRL) For a better consumption, if high speed is not needed. Position  */
#define USBHS_HSTCTRL_SPDCONF_HIGH_SPEED      (USBHS_HSTCTRL_SPDCONF_HIGH_SPEED_Val << USBHS_HSTCTRL_SPDCONF_Pos)  /**< (USBHS_HSTCTRL) Forced high speed. Position  */
#define USBHS_HSTCTRL_SPDCONF_FORCED_FS       (USBHS_HSTCTRL_SPDCONF_FORCED_FS_Val << USBHS_HSTCTRL_SPDCONF_Pos)  /**< (USBHS_HSTCTRL) The host remains in Full-speed mode whatever the peripheral speed capability. Position  */
#define USBHS_HSTCTRL_Msk                     (0x00003700UL)                                 /**< (USBHS_HSTCTRL) Register Mask  */

/* -------- USBHS_HSTISR : (USBHS Offset: 0x404) (R/ 32) Host Global Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t DCONNI:1;                  /**< bit:      0  Device Connection Interrupt                   */
    uint32_t DDISCI:1;                  /**< bit:      1  Device Disconnection Interrupt                */
    uint32_t RSTI:1;                    /**< bit:      2  USB Reset Sent Interrupt                      */
    uint32_t RSMEDI:1;                  /**< bit:      3  Downstream Resume Sent Interrupt              */
    uint32_t RXRSMI:1;                  /**< bit:      4  Upstream Resume Received Interrupt            */
    uint32_t HSOFI:1;                   /**< bit:      5  Host Start of Frame Interrupt                 */
    uint32_t HWUPI:1;                   /**< bit:      6  Host Wake-Up Interrupt                        */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t PEP_0:1;                   /**< bit:      8  Pipe 0 Interrupt                              */
    uint32_t PEP_1:1;                   /**< bit:      9  Pipe 1 Interrupt                              */
    uint32_t PEP_2:1;                   /**< bit:     10  Pipe 2 Interrupt                              */
    uint32_t PEP_3:1;                   /**< bit:     11  Pipe 3 Interrupt                              */
    uint32_t PEP_4:1;                   /**< bit:     12  Pipe 4 Interrupt                              */
    uint32_t PEP_5:1;                   /**< bit:     13  Pipe 5 Interrupt                              */
    uint32_t PEP_6:1;                   /**< bit:     14  Pipe 6 Interrupt                              */
    uint32_t PEP_7:1;                   /**< bit:     15  Pipe 7 Interrupt                              */
    uint32_t PEP_8:1;                   /**< bit:     16  Pipe 8 Interrupt                              */
    uint32_t PEP_9:1;                   /**< bit:     17  Pipe 9 Interrupt                              */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt                       */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt                       */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt                       */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt                       */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt                       */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt                       */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt                       */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PEP_:10;                   /**< bit:  8..17  Pipe x Interrupt                              */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt                       */
  };
  uint32_t w;
} __USBHS_HSTISR_bits_t;

#define USBHS_HSTISR_DCONNI_Pos               (0)                                            /**< (USBHS_HSTISR) Device Connection Interrupt Position */
#define USBHS_HSTISR_DCONNI_Msk               (0x1U << USBHS_HSTISR_DCONNI_Pos)              /**< (USBHS_HSTISR) Device Connection Interrupt Mask */
#define USBHS_HSTISR_DDISCI_Pos               (1)                                            /**< (USBHS_HSTISR) Device Disconnection Interrupt Position */
#define USBHS_HSTISR_DDISCI_Msk               (0x1U << USBHS_HSTISR_DDISCI_Pos)              /**< (USBHS_HSTISR) Device Disconnection Interrupt Mask */
#define USBHS_HSTISR_RSTI_Pos                 (2)                                            /**< (USBHS_HSTISR) USB Reset Sent Interrupt Position */
#define USBHS_HSTISR_RSTI_Msk                 (0x1U << USBHS_HSTISR_RSTI_Pos)                /**< (USBHS_HSTISR) USB Reset Sent Interrupt Mask */
#define USBHS_HSTISR_RSMEDI_Pos               (3)                                            /**< (USBHS_HSTISR) Downstream Resume Sent Interrupt Position */
#define USBHS_HSTISR_RSMEDI_Msk               (0x1U << USBHS_HSTISR_RSMEDI_Pos)              /**< (USBHS_HSTISR) Downstream Resume Sent Interrupt Mask */
#define USBHS_HSTISR_RXRSMI_Pos               (4)                                            /**< (USBHS_HSTISR) Upstream Resume Received Interrupt Position */
#define USBHS_HSTISR_RXRSMI_Msk               (0x1U << USBHS_HSTISR_RXRSMI_Pos)              /**< (USBHS_HSTISR) Upstream Resume Received Interrupt Mask */
#define USBHS_HSTISR_HSOFI_Pos                (5)                                            /**< (USBHS_HSTISR) Host Start of Frame Interrupt Position */
#define USBHS_HSTISR_HSOFI_Msk                (0x1U << USBHS_HSTISR_HSOFI_Pos)               /**< (USBHS_HSTISR) Host Start of Frame Interrupt Mask */
#define USBHS_HSTISR_HWUPI_Pos                (6)                                            /**< (USBHS_HSTISR) Host Wake-Up Interrupt Position */
#define USBHS_HSTISR_HWUPI_Msk                (0x1U << USBHS_HSTISR_HWUPI_Pos)               /**< (USBHS_HSTISR) Host Wake-Up Interrupt Mask */
#define USBHS_HSTISR_PEP_0_Pos                (8)                                            /**< (USBHS_HSTISR) Pipe 0 Interrupt Position */
#define USBHS_HSTISR_PEP_0_Msk                (0x1U << USBHS_HSTISR_PEP_0_Pos)               /**< (USBHS_HSTISR) Pipe 0 Interrupt Mask */
#define USBHS_HSTISR_PEP_1_Pos                (9)                                            /**< (USBHS_HSTISR) Pipe 1 Interrupt Position */
#define USBHS_HSTISR_PEP_1_Msk                (0x1U << USBHS_HSTISR_PEP_1_Pos)               /**< (USBHS_HSTISR) Pipe 1 Interrupt Mask */
#define USBHS_HSTISR_PEP_2_Pos                (10)                                           /**< (USBHS_HSTISR) Pipe 2 Interrupt Position */
#define USBHS_HSTISR_PEP_2_Msk                (0x1U << USBHS_HSTISR_PEP_2_Pos)               /**< (USBHS_HSTISR) Pipe 2 Interrupt Mask */
#define USBHS_HSTISR_PEP_3_Pos                (11)                                           /**< (USBHS_HSTISR) Pipe 3 Interrupt Position */
#define USBHS_HSTISR_PEP_3_Msk                (0x1U << USBHS_HSTISR_PEP_3_Pos)               /**< (USBHS_HSTISR) Pipe 3 Interrupt Mask */
#define USBHS_HSTISR_PEP_4_Pos                (12)                                           /**< (USBHS_HSTISR) Pipe 4 Interrupt Position */
#define USBHS_HSTISR_PEP_4_Msk                (0x1U << USBHS_HSTISR_PEP_4_Pos)               /**< (USBHS_HSTISR) Pipe 4 Interrupt Mask */
#define USBHS_HSTISR_PEP_5_Pos                (13)                                           /**< (USBHS_HSTISR) Pipe 5 Interrupt Position */
#define USBHS_HSTISR_PEP_5_Msk                (0x1U << USBHS_HSTISR_PEP_5_Pos)               /**< (USBHS_HSTISR) Pipe 5 Interrupt Mask */
#define USBHS_HSTISR_PEP_6_Pos                (14)                                           /**< (USBHS_HSTISR) Pipe 6 Interrupt Position */
#define USBHS_HSTISR_PEP_6_Msk                (0x1U << USBHS_HSTISR_PEP_6_Pos)               /**< (USBHS_HSTISR) Pipe 6 Interrupt Mask */
#define USBHS_HSTISR_PEP_7_Pos                (15)                                           /**< (USBHS_HSTISR) Pipe 7 Interrupt Position */
#define USBHS_HSTISR_PEP_7_Msk                (0x1U << USBHS_HSTISR_PEP_7_Pos)               /**< (USBHS_HSTISR) Pipe 7 Interrupt Mask */
#define USBHS_HSTISR_PEP_8_Pos                (16)                                           /**< (USBHS_HSTISR) Pipe 8 Interrupt Position */
#define USBHS_HSTISR_PEP_8_Msk                (0x1U << USBHS_HSTISR_PEP_8_Pos)               /**< (USBHS_HSTISR) Pipe 8 Interrupt Mask */
#define USBHS_HSTISR_PEP_9_Pos                (17)                                           /**< (USBHS_HSTISR) Pipe 9 Interrupt Position */
#define USBHS_HSTISR_PEP_9_Msk                (0x1U << USBHS_HSTISR_PEP_9_Pos)               /**< (USBHS_HSTISR) Pipe 9 Interrupt Mask */
#define USBHS_HSTISR_DMA_1_Pos                (25)                                           /**< (USBHS_HSTISR) DMA Channel 1 Interrupt Position */
#define USBHS_HSTISR_DMA_1_Msk                (0x1U << USBHS_HSTISR_DMA_1_Pos)               /**< (USBHS_HSTISR) DMA Channel 1 Interrupt Mask */
#define USBHS_HSTISR_DMA_2_Pos                (26)                                           /**< (USBHS_HSTISR) DMA Channel 2 Interrupt Position */
#define USBHS_HSTISR_DMA_2_Msk                (0x1U << USBHS_HSTISR_DMA_2_Pos)               /**< (USBHS_HSTISR) DMA Channel 2 Interrupt Mask */
#define USBHS_HSTISR_DMA_3_Pos                (27)                                           /**< (USBHS_HSTISR) DMA Channel 3 Interrupt Position */
#define USBHS_HSTISR_DMA_3_Msk                (0x1U << USBHS_HSTISR_DMA_3_Pos)               /**< (USBHS_HSTISR) DMA Channel 3 Interrupt Mask */
#define USBHS_HSTISR_DMA_4_Pos                (28)                                           /**< (USBHS_HSTISR) DMA Channel 4 Interrupt Position */
#define USBHS_HSTISR_DMA_4_Msk                (0x1U << USBHS_HSTISR_DMA_4_Pos)               /**< (USBHS_HSTISR) DMA Channel 4 Interrupt Mask */
#define USBHS_HSTISR_DMA_5_Pos                (29)                                           /**< (USBHS_HSTISR) DMA Channel 5 Interrupt Position */
#define USBHS_HSTISR_DMA_5_Msk                (0x1U << USBHS_HSTISR_DMA_5_Pos)               /**< (USBHS_HSTISR) DMA Channel 5 Interrupt Mask */
#define USBHS_HSTISR_DMA_6_Pos                (30)                                           /**< (USBHS_HSTISR) DMA Channel 6 Interrupt Position */
#define USBHS_HSTISR_DMA_6_Msk                (0x1U << USBHS_HSTISR_DMA_6_Pos)               /**< (USBHS_HSTISR) DMA Channel 6 Interrupt Mask */
#define USBHS_HSTISR_DMA_7_Pos                (31)                                           /**< (USBHS_HSTISR) DMA Channel 7 Interrupt Position */
#define USBHS_HSTISR_DMA_7_Msk                (0x1U << USBHS_HSTISR_DMA_7_Pos)               /**< (USBHS_HSTISR) DMA Channel 7 Interrupt Mask */
#define USBHS_HSTISR_Msk                      (0xFE03FF7FUL)                                 /**< (USBHS_HSTISR) Register Mask  */
#define USBHS_HSTISR_PEP__Pos                 (8)                                            /**< (USBHS_HSTISR Position) Pipe x Interrupt */
#define USBHS_HSTISR_PEP__Msk                 (0x3FFU << USBHS_HSTISR_PEP__Pos)              /**< (USBHS_HSTISR Mask) PEP_ */
#define USBHS_HSTISR_PEP_(value)              (USBHS_HSTISR_PEP__Msk & ((value) << USBHS_HSTISR_PEP__Pos))
#define USBHS_HSTISR_DMA__Pos                 (25)                                           /**< (USBHS_HSTISR Position) DMA Channel 7 Interrupt */
#define USBHS_HSTISR_DMA__Msk                 (0x7FU << USBHS_HSTISR_DMA__Pos)               /**< (USBHS_HSTISR Mask) DMA_ */
#define USBHS_HSTISR_DMA_(value)              (USBHS_HSTISR_DMA__Msk & ((value) << USBHS_HSTISR_DMA__Pos))

/* -------- USBHS_HSTICR : (USBHS Offset: 0x408) (/W 32) Host Global Interrupt Clear Register -------- */

typedef union
{
  struct
  {
    uint32_t DCONNIC:1;                 /**< bit:      0  Device Connection Interrupt Clear             */
    uint32_t DDISCIC:1;                 /**< bit:      1  Device Disconnection Interrupt Clear          */
    uint32_t RSTIC:1;                   /**< bit:      2  USB Reset Sent Interrupt Clear                */
    uint32_t RSMEDIC:1;                 /**< bit:      3  Downstream Resume Sent Interrupt Clear        */
    uint32_t RXRSMIC:1;                 /**< bit:      4  Upstream Resume Received Interrupt Clear      */
    uint32_t HSOFIC:1;                  /**< bit:      5  Host Start of Frame Interrupt Clear           */
    uint32_t HWUPIC:1;                  /**< bit:      6  Host Wake-Up Interrupt Clear                  */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTICR_bits_t;

#define USBHS_HSTICR_DCONNIC_Pos              (0)                                            /**< (USBHS_HSTICR) Device Connection Interrupt Clear Position */
#define USBHS_HSTICR_DCONNIC_Msk              (0x1U << USBHS_HSTICR_DCONNIC_Pos)             /**< (USBHS_HSTICR) Device Connection Interrupt Clear Mask */
#define USBHS_HSTICR_DDISCIC_Pos              (1)                                            /**< (USBHS_HSTICR) Device Disconnection Interrupt Clear Position */
#define USBHS_HSTICR_DDISCIC_Msk              (0x1U << USBHS_HSTICR_DDISCIC_Pos)             /**< (USBHS_HSTICR) Device Disconnection Interrupt Clear Mask */
#define USBHS_HSTICR_RSTIC_Pos                (2)                                            /**< (USBHS_HSTICR) USB Reset Sent Interrupt Clear Position */
#define USBHS_HSTICR_RSTIC_Msk                (0x1U << USBHS_HSTICR_RSTIC_Pos)               /**< (USBHS_HSTICR) USB Reset Sent Interrupt Clear Mask */
#define USBHS_HSTICR_RSMEDIC_Pos              (3)                                            /**< (USBHS_HSTICR) Downstream Resume Sent Interrupt Clear Position */
#define USBHS_HSTICR_RSMEDIC_Msk              (0x1U << USBHS_HSTICR_RSMEDIC_Pos)             /**< (USBHS_HSTICR) Downstream Resume Sent Interrupt Clear Mask */
#define USBHS_HSTICR_RXRSMIC_Pos              (4)                                            /**< (USBHS_HSTICR) Upstream Resume Received Interrupt Clear Position */
#define USBHS_HSTICR_RXRSMIC_Msk              (0x1U << USBHS_HSTICR_RXRSMIC_Pos)             /**< (USBHS_HSTICR) Upstream Resume Received Interrupt Clear Mask */
#define USBHS_HSTICR_HSOFIC_Pos               (5)                                            /**< (USBHS_HSTICR) Host Start of Frame Interrupt Clear Position */
#define USBHS_HSTICR_HSOFIC_Msk               (0x1U << USBHS_HSTICR_HSOFIC_Pos)              /**< (USBHS_HSTICR) Host Start of Frame Interrupt Clear Mask */
#define USBHS_HSTICR_HWUPIC_Pos               (6)                                            /**< (USBHS_HSTICR) Host Wake-Up Interrupt Clear Position */
#define USBHS_HSTICR_HWUPIC_Msk               (0x1U << USBHS_HSTICR_HWUPIC_Pos)              /**< (USBHS_HSTICR) Host Wake-Up Interrupt Clear Mask */
#define USBHS_HSTICR_Msk                      (0x0000007FUL)                                 /**< (USBHS_HSTICR) Register Mask  */

/* -------- USBHS_HSTIFR : (USBHS Offset: 0x40c) (/W 32) Host Global Interrupt Set Register -------- */

typedef union
{
  struct
  {
    uint32_t DCONNIS:1;                 /**< bit:      0  Device Connection Interrupt Set               */
    uint32_t DDISCIS:1;                 /**< bit:      1  Device Disconnection Interrupt Set            */
    uint32_t RSTIS:1;                   /**< bit:      2  USB Reset Sent Interrupt Set                  */
    uint32_t RSMEDIS:1;                 /**< bit:      3  Downstream Resume Sent Interrupt Set          */
    uint32_t RXRSMIS:1;                 /**< bit:      4  Upstream Resume Received Interrupt Set        */
    uint32_t HSOFIS:1;                  /**< bit:      5  Host Start of Frame Interrupt Set             */
    uint32_t HWUPIS:1;                  /**< bit:      6  Host Wake-Up Interrupt Set                    */
    uint32_t :18;                       /**< bit:  7..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt Set                   */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt Set                   */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt Set                   */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt Set                   */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt Set                   */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt Set                   */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt Set                   */
  };
  struct
  {
    uint32_t :25;                       /**< bit:  0..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt Set                   */
  };
  uint32_t w;
} __USBHS_HSTIFR_bits_t;

