zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_HSTIFR_DCONNIS_Pos              (0)                                            /**< (USBHS_HSTIFR) Device Connection Interrupt Set Position */
#define USBHS_HSTIFR_DCONNIS_Msk              (0x1U << USBHS_HSTIFR_DCONNIS_Pos)             /**< (USBHS_HSTIFR) Device Connection Interrupt Set Mask */
#define USBHS_HSTIFR_DDISCIS_Pos              (1)                                            /**< (USBHS_HSTIFR) Device Disconnection Interrupt Set Position */
#define USBHS_HSTIFR_DDISCIS_Msk              (0x1U << USBHS_HSTIFR_DDISCIS_Pos)             /**< (USBHS_HSTIFR) Device Disconnection Interrupt Set Mask */
#define USBHS_HSTIFR_RSTIS_Pos                (2)                                            /**< (USBHS_HSTIFR) USB Reset Sent Interrupt Set Position */
#define USBHS_HSTIFR_RSTIS_Msk                (0x1U << USBHS_HSTIFR_RSTIS_Pos)               /**< (USBHS_HSTIFR) USB Reset Sent Interrupt Set Mask */
#define USBHS_HSTIFR_RSMEDIS_Pos              (3)                                            /**< (USBHS_HSTIFR) Downstream Resume Sent Interrupt Set Position */
#define USBHS_HSTIFR_RSMEDIS_Msk              (0x1U << USBHS_HSTIFR_RSMEDIS_Pos)             /**< (USBHS_HSTIFR) Downstream Resume Sent Interrupt Set Mask */
#define USBHS_HSTIFR_RXRSMIS_Pos              (4)                                            /**< (USBHS_HSTIFR) Upstream Resume Received Interrupt Set Position */
#define USBHS_HSTIFR_RXRSMIS_Msk              (0x1U << USBHS_HSTIFR_RXRSMIS_Pos)             /**< (USBHS_HSTIFR) Upstream Resume Received Interrupt Set Mask */
#define USBHS_HSTIFR_HSOFIS_Pos               (5)                                            /**< (USBHS_HSTIFR) Host Start of Frame Interrupt Set Position */
#define USBHS_HSTIFR_HSOFIS_Msk               (0x1U << USBHS_HSTIFR_HSOFIS_Pos)              /**< (USBHS_HSTIFR) Host Start of Frame Interrupt Set Mask */
#define USBHS_HSTIFR_HWUPIS_Pos               (6)                                            /**< (USBHS_HSTIFR) Host Wake-Up Interrupt Set Position */
#define USBHS_HSTIFR_HWUPIS_Msk               (0x1U << USBHS_HSTIFR_HWUPIS_Pos)              /**< (USBHS_HSTIFR) Host Wake-Up Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_1_Pos                (25)                                           /**< (USBHS_HSTIFR) DMA Channel 1 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_1_Msk                (0x1U << USBHS_HSTIFR_DMA_1_Pos)               /**< (USBHS_HSTIFR) DMA Channel 1 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_2_Pos                (26)                                           /**< (USBHS_HSTIFR) DMA Channel 2 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_2_Msk                (0x1U << USBHS_HSTIFR_DMA_2_Pos)               /**< (USBHS_HSTIFR) DMA Channel 2 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_3_Pos                (27)                                           /**< (USBHS_HSTIFR) DMA Channel 3 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_3_Msk                (0x1U << USBHS_HSTIFR_DMA_3_Pos)               /**< (USBHS_HSTIFR) DMA Channel 3 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_4_Pos                (28)                                           /**< (USBHS_HSTIFR) DMA Channel 4 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_4_Msk                (0x1U << USBHS_HSTIFR_DMA_4_Pos)               /**< (USBHS_HSTIFR) DMA Channel 4 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_5_Pos                (29)                                           /**< (USBHS_HSTIFR) DMA Channel 5 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_5_Msk                (0x1U << USBHS_HSTIFR_DMA_5_Pos)               /**< (USBHS_HSTIFR) DMA Channel 5 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_6_Pos                (30)                                           /**< (USBHS_HSTIFR) DMA Channel 6 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_6_Msk                (0x1U << USBHS_HSTIFR_DMA_6_Pos)               /**< (USBHS_HSTIFR) DMA Channel 6 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_7_Pos                (31)                                           /**< (USBHS_HSTIFR) DMA Channel 7 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_7_Msk                (0x1U << USBHS_HSTIFR_DMA_7_Pos)               /**< (USBHS_HSTIFR) DMA Channel 7 Interrupt Set Mask */
#define USBHS_HSTIFR_Msk                      (0xFE00007FUL)                                 /**< (USBHS_HSTIFR) Register Mask  */
#define USBHS_HSTIFR_DMA__Pos                 (25)                                           /**< (USBHS_HSTIFR Position) DMA Channel 7 Interrupt Set */
#define USBHS_HSTIFR_DMA__Msk                 (0x7FU << USBHS_HSTIFR_DMA__Pos)               /**< (USBHS_HSTIFR Mask) DMA_ */
#define USBHS_HSTIFR_DMA_(value)              (USBHS_HSTIFR_DMA__Msk & ((value) << USBHS_HSTIFR_DMA__Pos))

/* -------- USBHS_HSTIMR : (USBHS Offset: 0x410) (R/ 32) Host Global Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t DCONNIE:1;                 /**< bit:      0  Device Connection Interrupt Enable            */
    uint32_t DDISCIE:1;                 /**< bit:      1  Device Disconnection Interrupt Enable         */
    uint32_t RSTIE:1;                   /**< bit:      2  USB Reset Sent Interrupt Enable               */
    uint32_t RSMEDIE:1;                 /**< bit:      3  Downstream Resume Sent Interrupt Enable       */
    uint32_t RXRSMIE:1;                 /**< bit:      4  Upstream Resume Received Interrupt Enable     */
    uint32_t HSOFIE:1;                  /**< bit:      5  Host Start of Frame Interrupt Enable          */
    uint32_t HWUPIE:1;                  /**< bit:      6  Host Wake-Up Interrupt Enable                 */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t PEP_0:1;                   /**< bit:      8  Pipe 0 Interrupt Enable                       */
    uint32_t PEP_1:1;                   /**< bit:      9  Pipe 1 Interrupt Enable                       */
    uint32_t PEP_2:1;                   /**< bit:     10  Pipe 2 Interrupt Enable                       */
    uint32_t PEP_3:1;                   /**< bit:     11  Pipe 3 Interrupt Enable                       */
    uint32_t PEP_4:1;                   /**< bit:     12  Pipe 4 Interrupt Enable                       */
    uint32_t PEP_5:1;                   /**< bit:     13  Pipe 5 Interrupt Enable                       */
    uint32_t PEP_6:1;                   /**< bit:     14  Pipe 6 Interrupt Enable                       */
    uint32_t PEP_7:1;                   /**< bit:     15  Pipe 7 Interrupt Enable                       */
    uint32_t PEP_8:1;                   /**< bit:     16  Pipe 8 Interrupt Enable                       */
    uint32_t PEP_9:1;                   /**< bit:     17  Pipe 9 Interrupt Enable                       */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt Enable                */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt Enable                */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt Enable                */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt Enable                */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt Enable                */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt Enable                */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt Enable                */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PEP_:10;                   /**< bit:  8..17  Pipe x Interrupt Enable                       */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt Enable                */
  };
  uint32_t w;
} __USBHS_HSTIMR_bits_t;

#define USBHS_HSTIMR_DCONNIE_Pos              (0)                                            /**< (USBHS_HSTIMR) Device Connection Interrupt Enable Position */
#define USBHS_HSTIMR_DCONNIE_Msk              (0x1U << USBHS_HSTIMR_DCONNIE_Pos)             /**< (USBHS_HSTIMR) Device Connection Interrupt Enable Mask */
#define USBHS_HSTIMR_DDISCIE_Pos              (1)                                            /**< (USBHS_HSTIMR) Device Disconnection Interrupt Enable Position */
#define USBHS_HSTIMR_DDISCIE_Msk              (0x1U << USBHS_HSTIMR_DDISCIE_Pos)             /**< (USBHS_HSTIMR) Device Disconnection Interrupt Enable Mask */
#define USBHS_HSTIMR_RSTIE_Pos                (2)                                            /**< (USBHS_HSTIMR) USB Reset Sent Interrupt Enable Position */
#define USBHS_HSTIMR_RSTIE_Msk                (0x1U << USBHS_HSTIMR_RSTIE_Pos)               /**< (USBHS_HSTIMR) USB Reset Sent Interrupt Enable Mask */
#define USBHS_HSTIMR_RSMEDIE_Pos              (3)                                            /**< (USBHS_HSTIMR) Downstream Resume Sent Interrupt Enable Position */
#define USBHS_HSTIMR_RSMEDIE_Msk              (0x1U << USBHS_HSTIMR_RSMEDIE_Pos)             /**< (USBHS_HSTIMR) Downstream Resume Sent Interrupt Enable Mask */
#define USBHS_HSTIMR_RXRSMIE_Pos              (4)                                            /**< (USBHS_HSTIMR) Upstream Resume Received Interrupt Enable Position */
#define USBHS_HSTIMR_RXRSMIE_Msk              (0x1U << USBHS_HSTIMR_RXRSMIE_Pos)             /**< (USBHS_HSTIMR) Upstream Resume Received Interrupt Enable Mask */
#define USBHS_HSTIMR_HSOFIE_Pos               (5)                                            /**< (USBHS_HSTIMR) Host Start of Frame Interrupt Enable Position */
#define USBHS_HSTIMR_HSOFIE_Msk               (0x1U << USBHS_HSTIMR_HSOFIE_Pos)              /**< (USBHS_HSTIMR) Host Start of Frame Interrupt Enable Mask */
#define USBHS_HSTIMR_HWUPIE_Pos               (6)                                            /**< (USBHS_HSTIMR) Host Wake-Up Interrupt Enable Position */
#define USBHS_HSTIMR_HWUPIE_Msk               (0x1U << USBHS_HSTIMR_HWUPIE_Pos)              /**< (USBHS_HSTIMR) Host Wake-Up Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_0_Pos                (8)                                            /**< (USBHS_HSTIMR) Pipe 0 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_0_Msk                (0x1U << USBHS_HSTIMR_PEP_0_Pos)               /**< (USBHS_HSTIMR) Pipe 0 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_1_Pos                (9)                                            /**< (USBHS_HSTIMR) Pipe 1 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_1_Msk                (0x1U << USBHS_HSTIMR_PEP_1_Pos)               /**< (USBHS_HSTIMR) Pipe 1 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_2_Pos                (10)                                           /**< (USBHS_HSTIMR) Pipe 2 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_2_Msk                (0x1U << USBHS_HSTIMR_PEP_2_Pos)               /**< (USBHS_HSTIMR) Pipe 2 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_3_Pos                (11)                                           /**< (USBHS_HSTIMR) Pipe 3 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_3_Msk                (0x1U << USBHS_HSTIMR_PEP_3_Pos)               /**< (USBHS_HSTIMR) Pipe 3 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_4_Pos                (12)                                           /**< (USBHS_HSTIMR) Pipe 4 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_4_Msk                (0x1U << USBHS_HSTIMR_PEP_4_Pos)               /**< (USBHS_HSTIMR) Pipe 4 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_5_Pos                (13)                                           /**< (USBHS_HSTIMR) Pipe 5 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_5_Msk                (0x1U << USBHS_HSTIMR_PEP_5_Pos)               /**< (USBHS_HSTIMR) Pipe 5 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_6_Pos                (14)                                           /**< (USBHS_HSTIMR) Pipe 6 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_6_Msk                (0x1U << USBHS_HSTIMR_PEP_6_Pos)               /**< (USBHS_HSTIMR) Pipe 6 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_7_Pos                (15)                                           /**< (USBHS_HSTIMR) Pipe 7 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_7_Msk                (0x1U << USBHS_HSTIMR_PEP_7_Pos)               /**< (USBHS_HSTIMR) Pipe 7 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_8_Pos                (16)                                           /**< (USBHS_HSTIMR) Pipe 8 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_8_Msk                (0x1U << USBHS_HSTIMR_PEP_8_Pos)               /**< (USBHS_HSTIMR) Pipe 8 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_9_Pos                (17)                                           /**< (USBHS_HSTIMR) Pipe 9 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_9_Msk                (0x1U << USBHS_HSTIMR_PEP_9_Pos)               /**< (USBHS_HSTIMR) Pipe 9 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_1_Pos                (25)                                           /**< (USBHS_HSTIMR) DMA Channel 1 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_1_Msk                (0x1U << USBHS_HSTIMR_DMA_1_Pos)               /**< (USBHS_HSTIMR) DMA Channel 1 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_2_Pos                (26)                                           /**< (USBHS_HSTIMR) DMA Channel 2 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_2_Msk                (0x1U << USBHS_HSTIMR_DMA_2_Pos)               /**< (USBHS_HSTIMR) DMA Channel 2 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_3_Pos                (27)                                           /**< (USBHS_HSTIMR) DMA Channel 3 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_3_Msk                (0x1U << USBHS_HSTIMR_DMA_3_Pos)               /**< (USBHS_HSTIMR) DMA Channel 3 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_4_Pos                (28)                                           /**< (USBHS_HSTIMR) DMA Channel 4 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_4_Msk                (0x1U << USBHS_HSTIMR_DMA_4_Pos)               /**< (USBHS_HSTIMR) DMA Channel 4 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_5_Pos                (29)                                           /**< (USBHS_HSTIMR) DMA Channel 5 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_5_Msk                (0x1U << USBHS_HSTIMR_DMA_5_Pos)               /**< (USBHS_HSTIMR) DMA Channel 5 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_6_Pos                (30)                                           /**< (USBHS_HSTIMR) DMA Channel 6 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_6_Msk                (0x1U << USBHS_HSTIMR_DMA_6_Pos)               /**< (USBHS_HSTIMR) DMA Channel 6 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_7_Pos                (31)                                           /**< (USBHS_HSTIMR) DMA Channel 7 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_7_Msk                (0x1U << USBHS_HSTIMR_DMA_7_Pos)               /**< (USBHS_HSTIMR) DMA Channel 7 Interrupt Enable Mask */
#define USBHS_HSTIMR_Msk                      (0xFE03FF7FUL)                                 /**< (USBHS_HSTIMR) Register Mask  */
#define USBHS_HSTIMR_PEP__Pos                 (8)                                            /**< (USBHS_HSTIMR Position) Pipe x Interrupt Enable */
#define USBHS_HSTIMR_PEP__Msk                 (0x3FFU << USBHS_HSTIMR_PEP__Pos)              /**< (USBHS_HSTIMR Mask) PEP_ */
#define USBHS_HSTIMR_PEP_(value)              (USBHS_HSTIMR_PEP__Msk & ((value) << USBHS_HSTIMR_PEP__Pos))
#define USBHS_HSTIMR_DMA__Pos                 (25)                                           /**< (USBHS_HSTIMR Position) DMA Channel 7 Interrupt Enable */
#define USBHS_HSTIMR_DMA__Msk                 (0x7FU << USBHS_HSTIMR_DMA__Pos)               /**< (USBHS_HSTIMR Mask) DMA_ */
#define USBHS_HSTIMR_DMA_(value)              (USBHS_HSTIMR_DMA__Msk & ((value) << USBHS_HSTIMR_DMA__Pos))

/* -------- USBHS_HSTIDR : (USBHS Offset: 0x414) (/W 32) Host Global Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t DCONNIEC:1;                /**< bit:      0  Device Connection Interrupt Disable           */
    uint32_t DDISCIEC:1;                /**< bit:      1  Device Disconnection Interrupt Disable        */
    uint32_t RSTIEC:1;                  /**< bit:      2  USB Reset Sent Interrupt Disable              */
    uint32_t RSMEDIEC:1;                /**< bit:      3  Downstream Resume Sent Interrupt Disable      */
    uint32_t RXRSMIEC:1;                /**< bit:      4  Upstream Resume Received Interrupt Disable    */
    uint32_t HSOFIEC:1;                 /**< bit:      5  Host Start of Frame Interrupt Disable         */
    uint32_t HWUPIEC:1;                 /**< bit:      6  Host Wake-Up Interrupt Disable                */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t PEP_0:1;                   /**< bit:      8  Pipe 0 Interrupt Disable                      */
    uint32_t PEP_1:1;                   /**< bit:      9  Pipe 1 Interrupt Disable                      */
    uint32_t PEP_2:1;                   /**< bit:     10  Pipe 2 Interrupt Disable                      */
    uint32_t PEP_3:1;                   /**< bit:     11  Pipe 3 Interrupt Disable                      */
    uint32_t PEP_4:1;                   /**< bit:     12  Pipe 4 Interrupt Disable                      */
    uint32_t PEP_5:1;                   /**< bit:     13  Pipe 5 Interrupt Disable                      */
    uint32_t PEP_6:1;                   /**< bit:     14  Pipe 6 Interrupt Disable                      */
    uint32_t PEP_7:1;                   /**< bit:     15  Pipe 7 Interrupt Disable                      */
    uint32_t PEP_8:1;                   /**< bit:     16  Pipe 8 Interrupt Disable                      */
    uint32_t PEP_9:1;                   /**< bit:     17  Pipe 9 Interrupt Disable                      */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt Disable               */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt Disable               */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt Disable               */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt Disable               */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt Disable               */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt Disable               */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt Disable               */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PEP_:10;                   /**< bit:  8..17  Pipe x Interrupt Disable                      */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt Disable               */
  };
  uint32_t w;
} __USBHS_HSTIDR_bits_t;

