zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_HSTIDR_DCONNIEC_Pos             (0)                                            /**< (USBHS_HSTIDR) Device Connection Interrupt Disable Position */
#define USBHS_HSTIDR_DCONNIEC_Msk             (0x1U << USBHS_HSTIDR_DCONNIEC_Pos)            /**< (USBHS_HSTIDR) Device Connection Interrupt Disable Mask */
#define USBHS_HSTIDR_DDISCIEC_Pos             (1)                                            /**< (USBHS_HSTIDR) Device Disconnection Interrupt Disable Position */
#define USBHS_HSTIDR_DDISCIEC_Msk             (0x1U << USBHS_HSTIDR_DDISCIEC_Pos)            /**< (USBHS_HSTIDR) Device Disconnection Interrupt Disable Mask */
#define USBHS_HSTIDR_RSTIEC_Pos               (2)                                            /**< (USBHS_HSTIDR) USB Reset Sent Interrupt Disable Position */
#define USBHS_HSTIDR_RSTIEC_Msk               (0x1U << USBHS_HSTIDR_RSTIEC_Pos)              /**< (USBHS_HSTIDR) USB Reset Sent Interrupt Disable Mask */
#define USBHS_HSTIDR_RSMEDIEC_Pos             (3)                                            /**< (USBHS_HSTIDR) Downstream Resume Sent Interrupt Disable Position */
#define USBHS_HSTIDR_RSMEDIEC_Msk             (0x1U << USBHS_HSTIDR_RSMEDIEC_Pos)            /**< (USBHS_HSTIDR) Downstream Resume Sent Interrupt Disable Mask */
#define USBHS_HSTIDR_RXRSMIEC_Pos             (4)                                            /**< (USBHS_HSTIDR) Upstream Resume Received Interrupt Disable Position */
#define USBHS_HSTIDR_RXRSMIEC_Msk             (0x1U << USBHS_HSTIDR_RXRSMIEC_Pos)            /**< (USBHS_HSTIDR) Upstream Resume Received Interrupt Disable Mask */
#define USBHS_HSTIDR_HSOFIEC_Pos              (5)                                            /**< (USBHS_HSTIDR) Host Start of Frame Interrupt Disable Position */
#define USBHS_HSTIDR_HSOFIEC_Msk              (0x1U << USBHS_HSTIDR_HSOFIEC_Pos)             /**< (USBHS_HSTIDR) Host Start of Frame Interrupt Disable Mask */
#define USBHS_HSTIDR_HWUPIEC_Pos              (6)                                            /**< (USBHS_HSTIDR) Host Wake-Up Interrupt Disable Position */
#define USBHS_HSTIDR_HWUPIEC_Msk              (0x1U << USBHS_HSTIDR_HWUPIEC_Pos)             /**< (USBHS_HSTIDR) Host Wake-Up Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_0_Pos                (8)                                            /**< (USBHS_HSTIDR) Pipe 0 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_0_Msk                (0x1U << USBHS_HSTIDR_PEP_0_Pos)               /**< (USBHS_HSTIDR) Pipe 0 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_1_Pos                (9)                                            /**< (USBHS_HSTIDR) Pipe 1 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_1_Msk                (0x1U << USBHS_HSTIDR_PEP_1_Pos)               /**< (USBHS_HSTIDR) Pipe 1 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_2_Pos                (10)                                           /**< (USBHS_HSTIDR) Pipe 2 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_2_Msk                (0x1U << USBHS_HSTIDR_PEP_2_Pos)               /**< (USBHS_HSTIDR) Pipe 2 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_3_Pos                (11)                                           /**< (USBHS_HSTIDR) Pipe 3 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_3_Msk                (0x1U << USBHS_HSTIDR_PEP_3_Pos)               /**< (USBHS_HSTIDR) Pipe 3 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_4_Pos                (12)                                           /**< (USBHS_HSTIDR) Pipe 4 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_4_Msk                (0x1U << USBHS_HSTIDR_PEP_4_Pos)               /**< (USBHS_HSTIDR) Pipe 4 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_5_Pos                (13)                                           /**< (USBHS_HSTIDR) Pipe 5 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_5_Msk                (0x1U << USBHS_HSTIDR_PEP_5_Pos)               /**< (USBHS_HSTIDR) Pipe 5 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_6_Pos                (14)                                           /**< (USBHS_HSTIDR) Pipe 6 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_6_Msk                (0x1U << USBHS_HSTIDR_PEP_6_Pos)               /**< (USBHS_HSTIDR) Pipe 6 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_7_Pos                (15)                                           /**< (USBHS_HSTIDR) Pipe 7 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_7_Msk                (0x1U << USBHS_HSTIDR_PEP_7_Pos)               /**< (USBHS_HSTIDR) Pipe 7 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_8_Pos                (16)                                           /**< (USBHS_HSTIDR) Pipe 8 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_8_Msk                (0x1U << USBHS_HSTIDR_PEP_8_Pos)               /**< (USBHS_HSTIDR) Pipe 8 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_9_Pos                (17)                                           /**< (USBHS_HSTIDR) Pipe 9 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_9_Msk                (0x1U << USBHS_HSTIDR_PEP_9_Pos)               /**< (USBHS_HSTIDR) Pipe 9 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_1_Pos                (25)                                           /**< (USBHS_HSTIDR) DMA Channel 1 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_1_Msk                (0x1U << USBHS_HSTIDR_DMA_1_Pos)               /**< (USBHS_HSTIDR) DMA Channel 1 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_2_Pos                (26)                                           /**< (USBHS_HSTIDR) DMA Channel 2 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_2_Msk                (0x1U << USBHS_HSTIDR_DMA_2_Pos)               /**< (USBHS_HSTIDR) DMA Channel 2 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_3_Pos                (27)                                           /**< (USBHS_HSTIDR) DMA Channel 3 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_3_Msk                (0x1U << USBHS_HSTIDR_DMA_3_Pos)               /**< (USBHS_HSTIDR) DMA Channel 3 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_4_Pos                (28)                                           /**< (USBHS_HSTIDR) DMA Channel 4 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_4_Msk                (0x1U << USBHS_HSTIDR_DMA_4_Pos)               /**< (USBHS_HSTIDR) DMA Channel 4 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_5_Pos                (29)                                           /**< (USBHS_HSTIDR) DMA Channel 5 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_5_Msk                (0x1U << USBHS_HSTIDR_DMA_5_Pos)               /**< (USBHS_HSTIDR) DMA Channel 5 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_6_Pos                (30)                                           /**< (USBHS_HSTIDR) DMA Channel 6 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_6_Msk                (0x1U << USBHS_HSTIDR_DMA_6_Pos)               /**< (USBHS_HSTIDR) DMA Channel 6 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_7_Pos                (31)                                           /**< (USBHS_HSTIDR) DMA Channel 7 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_7_Msk                (0x1U << USBHS_HSTIDR_DMA_7_Pos)               /**< (USBHS_HSTIDR) DMA Channel 7 Interrupt Disable Mask */
#define USBHS_HSTIDR_Msk                      (0xFE03FF7FUL)                                 /**< (USBHS_HSTIDR) Register Mask  */
#define USBHS_HSTIDR_PEP__Pos                 (8)                                            /**< (USBHS_HSTIDR Position) Pipe x Interrupt Disable */
#define USBHS_HSTIDR_PEP__Msk                 (0x3FFU << USBHS_HSTIDR_PEP__Pos)              /**< (USBHS_HSTIDR Mask) PEP_ */
#define USBHS_HSTIDR_PEP_(value)              (USBHS_HSTIDR_PEP__Msk & ((value) << USBHS_HSTIDR_PEP__Pos))
#define USBHS_HSTIDR_DMA__Pos                 (25)                                           /**< (USBHS_HSTIDR Position) DMA Channel 7 Interrupt Disable */
#define USBHS_HSTIDR_DMA__Msk                 (0x7FU << USBHS_HSTIDR_DMA__Pos)               /**< (USBHS_HSTIDR Mask) DMA_ */
#define USBHS_HSTIDR_DMA_(value)              (USBHS_HSTIDR_DMA__Msk & ((value) << USBHS_HSTIDR_DMA__Pos))

/* -------- USBHS_HSTIER : (USBHS Offset: 0x418) (/W 32) Host Global Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t DCONNIES:1;                /**< bit:      0  Device Connection Interrupt Enable            */
    uint32_t DDISCIES:1;                /**< bit:      1  Device Disconnection Interrupt Enable         */
    uint32_t RSTIES:1;                  /**< bit:      2  USB Reset Sent Interrupt Enable               */
    uint32_t RSMEDIES:1;                /**< bit:      3  Downstream Resume Sent Interrupt Enable       */
    uint32_t RXRSMIES:1;                /**< bit:      4  Upstream Resume Received Interrupt Enable     */
    uint32_t HSOFIES:1;                 /**< bit:      5  Host Start of Frame Interrupt Enable          */
    uint32_t HWUPIES:1;                 /**< bit:      6  Host Wake-Up Interrupt Enable                 */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t PEP_0:1;                   /**< bit:      8  Pipe 0 Interrupt Enable                       */
    uint32_t PEP_1:1;                   /**< bit:      9  Pipe 1 Interrupt Enable                       */
    uint32_t PEP_2:1;                   /**< bit:     10  Pipe 2 Interrupt Enable                       */
    uint32_t PEP_3:1;                   /**< bit:     11  Pipe 3 Interrupt Enable                       */
    uint32_t PEP_4:1;                   /**< bit:     12  Pipe 4 Interrupt Enable                       */
    uint32_t PEP_5:1;                   /**< bit:     13  Pipe 5 Interrupt Enable                       */
    uint32_t PEP_6:1;                   /**< bit:     14  Pipe 6 Interrupt Enable                       */
    uint32_t PEP_7:1;                   /**< bit:     15  Pipe 7 Interrupt Enable                       */
    uint32_t PEP_8:1;                   /**< bit:     16  Pipe 8 Interrupt Enable                       */
    uint32_t PEP_9:1;                   /**< bit:     17  Pipe 9 Interrupt Enable                       */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt Enable                */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt Enable                */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt Enable                */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt Enable                */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt Enable                */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt Enable                */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt Enable                */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PEP_:10;                   /**< bit:  8..17  Pipe x Interrupt Enable                       */
    uint32_t :7;                        /**< bit: 18..24  Reserved                                      */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt Enable                */
  };
  uint32_t w;
} __USBHS_HSTIER_bits_t;

#define USBHS_HSTIER_DCONNIES_Pos             (0)                                            /**< (USBHS_HSTIER) Device Connection Interrupt Enable Position */
#define USBHS_HSTIER_DCONNIES_Msk             (0x1U << USBHS_HSTIER_DCONNIES_Pos)            /**< (USBHS_HSTIER) Device Connection Interrupt Enable Mask */
#define USBHS_HSTIER_DDISCIES_Pos             (1)                                            /**< (USBHS_HSTIER) Device Disconnection Interrupt Enable Position */
#define USBHS_HSTIER_DDISCIES_Msk             (0x1U << USBHS_HSTIER_DDISCIES_Pos)            /**< (USBHS_HSTIER) Device Disconnection Interrupt Enable Mask */
#define USBHS_HSTIER_RSTIES_Pos               (2)                                            /**< (USBHS_HSTIER) USB Reset Sent Interrupt Enable Position */
#define USBHS_HSTIER_RSTIES_Msk               (0x1U << USBHS_HSTIER_RSTIES_Pos)              /**< (USBHS_HSTIER) USB Reset Sent Interrupt Enable Mask */
#define USBHS_HSTIER_RSMEDIES_Pos             (3)                                            /**< (USBHS_HSTIER) Downstream Resume Sent Interrupt Enable Position */
#define USBHS_HSTIER_RSMEDIES_Msk             (0x1U << USBHS_HSTIER_RSMEDIES_Pos)            /**< (USBHS_HSTIER) Downstream Resume Sent Interrupt Enable Mask */
#define USBHS_HSTIER_RXRSMIES_Pos             (4)                                            /**< (USBHS_HSTIER) Upstream Resume Received Interrupt Enable Position */
#define USBHS_HSTIER_RXRSMIES_Msk             (0x1U << USBHS_HSTIER_RXRSMIES_Pos)            /**< (USBHS_HSTIER) Upstream Resume Received Interrupt Enable Mask */
#define USBHS_HSTIER_HSOFIES_Pos              (5)                                            /**< (USBHS_HSTIER) Host Start of Frame Interrupt Enable Position */
#define USBHS_HSTIER_HSOFIES_Msk              (0x1U << USBHS_HSTIER_HSOFIES_Pos)             /**< (USBHS_HSTIER) Host Start of Frame Interrupt Enable Mask */
#define USBHS_HSTIER_HWUPIES_Pos              (6)                                            /**< (USBHS_HSTIER) Host Wake-Up Interrupt Enable Position */
#define USBHS_HSTIER_HWUPIES_Msk              (0x1U << USBHS_HSTIER_HWUPIES_Pos)             /**< (USBHS_HSTIER) Host Wake-Up Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_0_Pos                (8)                                            /**< (USBHS_HSTIER) Pipe 0 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_0_Msk                (0x1U << USBHS_HSTIER_PEP_0_Pos)               /**< (USBHS_HSTIER) Pipe 0 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_1_Pos                (9)                                            /**< (USBHS_HSTIER) Pipe 1 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_1_Msk                (0x1U << USBHS_HSTIER_PEP_1_Pos)               /**< (USBHS_HSTIER) Pipe 1 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_2_Pos                (10)                                           /**< (USBHS_HSTIER) Pipe 2 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_2_Msk                (0x1U << USBHS_HSTIER_PEP_2_Pos)               /**< (USBHS_HSTIER) Pipe 2 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_3_Pos                (11)                                           /**< (USBHS_HSTIER) Pipe 3 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_3_Msk                (0x1U << USBHS_HSTIER_PEP_3_Pos)               /**< (USBHS_HSTIER) Pipe 3 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_4_Pos                (12)                                           /**< (USBHS_HSTIER) Pipe 4 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_4_Msk                (0x1U << USBHS_HSTIER_PEP_4_Pos)               /**< (USBHS_HSTIER) Pipe 4 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_5_Pos                (13)                                           /**< (USBHS_HSTIER) Pipe 5 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_5_Msk                (0x1U << USBHS_HSTIER_PEP_5_Pos)               /**< (USBHS_HSTIER) Pipe 5 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_6_Pos                (14)                                           /**< (USBHS_HSTIER) Pipe 6 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_6_Msk                (0x1U << USBHS_HSTIER_PEP_6_Pos)               /**< (USBHS_HSTIER) Pipe 6 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_7_Pos                (15)                                           /**< (USBHS_HSTIER) Pipe 7 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_7_Msk                (0x1U << USBHS_HSTIER_PEP_7_Pos)               /**< (USBHS_HSTIER) Pipe 7 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_8_Pos                (16)                                           /**< (USBHS_HSTIER) Pipe 8 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_8_Msk                (0x1U << USBHS_HSTIER_PEP_8_Pos)               /**< (USBHS_HSTIER) Pipe 8 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_9_Pos                (17)                                           /**< (USBHS_HSTIER) Pipe 9 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_9_Msk                (0x1U << USBHS_HSTIER_PEP_9_Pos)               /**< (USBHS_HSTIER) Pipe 9 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_1_Pos                (25)                                           /**< (USBHS_HSTIER) DMA Channel 1 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_1_Msk                (0x1U << USBHS_HSTIER_DMA_1_Pos)               /**< (USBHS_HSTIER) DMA Channel 1 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_2_Pos                (26)                                           /**< (USBHS_HSTIER) DMA Channel 2 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_2_Msk                (0x1U << USBHS_HSTIER_DMA_2_Pos)               /**< (USBHS_HSTIER) DMA Channel 2 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_3_Pos                (27)                                           /**< (USBHS_HSTIER) DMA Channel 3 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_3_Msk                (0x1U << USBHS_HSTIER_DMA_3_Pos)               /**< (USBHS_HSTIER) DMA Channel 3 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_4_Pos                (28)                                           /**< (USBHS_HSTIER) DMA Channel 4 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_4_Msk                (0x1U << USBHS_HSTIER_DMA_4_Pos)               /**< (USBHS_HSTIER) DMA Channel 4 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_5_Pos                (29)                                           /**< (USBHS_HSTIER) DMA Channel 5 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_5_Msk                (0x1U << USBHS_HSTIER_DMA_5_Pos)               /**< (USBHS_HSTIER) DMA Channel 5 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_6_Pos                (30)                                           /**< (USBHS_HSTIER) DMA Channel 6 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_6_Msk                (0x1U << USBHS_HSTIER_DMA_6_Pos)               /**< (USBHS_HSTIER) DMA Channel 6 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_7_Pos                (31)                                           /**< (USBHS_HSTIER) DMA Channel 7 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_7_Msk                (0x1U << USBHS_HSTIER_DMA_7_Pos)               /**< (USBHS_HSTIER) DMA Channel 7 Interrupt Enable Mask */
#define USBHS_HSTIER_Msk                      (0xFE03FF7FUL)                                 /**< (USBHS_HSTIER) Register Mask  */
#define USBHS_HSTIER_PEP__Pos                 (8)                                            /**< (USBHS_HSTIER Position) Pipe x Interrupt Enable */
#define USBHS_HSTIER_PEP__Msk                 (0x3FFU << USBHS_HSTIER_PEP__Pos)              /**< (USBHS_HSTIER Mask) PEP_ */
#define USBHS_HSTIER_PEP_(value)              (USBHS_HSTIER_PEP__Msk & ((value) << USBHS_HSTIER_PEP__Pos))
#define USBHS_HSTIER_DMA__Pos                 (25)                                           /**< (USBHS_HSTIER Position) DMA Channel 7 Interrupt Enable */
#define USBHS_HSTIER_DMA__Msk                 (0x7FU << USBHS_HSTIER_DMA__Pos)               /**< (USBHS_HSTIER Mask) DMA_ */
#define USBHS_HSTIER_DMA_(value)              (USBHS_HSTIER_DMA__Msk & ((value) << USBHS_HSTIER_DMA__Pos))

/* -------- USBHS_HSTPIP : (USBHS Offset: 0x41c) (R/W 32) Host Pipe Register -------- */

typedef union
{
  struct
  {
    uint32_t PEN0:1;                    /**< bit:      0  Pipe 0 Enable                                 */
    uint32_t PEN1:1;                    /**< bit:      1  Pipe 1 Enable                                 */
    uint32_t PEN2:1;                    /**< bit:      2  Pipe 2 Enable                                 */
    uint32_t PEN3:1;                    /**< bit:      3  Pipe 3 Enable                                 */
    uint32_t PEN4:1;                    /**< bit:      4  Pipe 4 Enable                                 */
    uint32_t PEN5:1;                    /**< bit:      5  Pipe 5 Enable                                 */
    uint32_t PEN6:1;                    /**< bit:      6  Pipe 6 Enable                                 */
    uint32_t PEN7:1;                    /**< bit:      7  Pipe 7 Enable                                 */
    uint32_t PEN8:1;                    /**< bit:      8  Pipe 8 Enable                                 */
    uint32_t :7;                        /**< bit:  9..15  Reserved                                      */
    uint32_t PRST0:1;                   /**< bit:     16  Pipe 0 Reset                                  */
    uint32_t PRST1:1;                   /**< bit:     17  Pipe 1 Reset                                  */
    uint32_t PRST2:1;                   /**< bit:     18  Pipe 2 Reset                                  */
    uint32_t PRST3:1;                   /**< bit:     19  Pipe 3 Reset                                  */
    uint32_t PRST4:1;                   /**< bit:     20  Pipe 4 Reset                                  */
    uint32_t PRST5:1;                   /**< bit:     21  Pipe 5 Reset                                  */
    uint32_t PRST6:1;                   /**< bit:     22  Pipe 6 Reset                                  */
    uint32_t PRST7:1;                   /**< bit:     23  Pipe 7 Reset                                  */
    uint32_t PRST8:1;                   /**< bit:     24  Pipe 8 Reset                                  */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  struct
  {
    uint32_t PEN:9;                     /**< bit:   0..8  Pipe x Enable                                 */
    uint32_t :7;                        /**< bit:  9..15  Reserved                                      */
    uint32_t PRST:9;                    /**< bit: 16..24  Pipe 8 Reset                                  */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIP_bits_t;

