zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_HSTPIP_PEN0_Pos                 (0)                                            /**< (USBHS_HSTPIP) Pipe 0 Enable Position */
#define USBHS_HSTPIP_PEN0_Msk                 (0x1U << USBHS_HSTPIP_PEN0_Pos)                /**< (USBHS_HSTPIP) Pipe 0 Enable Mask */
#define USBHS_HSTPIP_PEN1_Pos                 (1)                                            /**< (USBHS_HSTPIP) Pipe 1 Enable Position */
#define USBHS_HSTPIP_PEN1_Msk                 (0x1U << USBHS_HSTPIP_PEN1_Pos)                /**< (USBHS_HSTPIP) Pipe 1 Enable Mask */
#define USBHS_HSTPIP_PEN2_Pos                 (2)                                            /**< (USBHS_HSTPIP) Pipe 2 Enable Position */
#define USBHS_HSTPIP_PEN2_Msk                 (0x1U << USBHS_HSTPIP_PEN2_Pos)                /**< (USBHS_HSTPIP) Pipe 2 Enable Mask */
#define USBHS_HSTPIP_PEN3_Pos                 (3)                                            /**< (USBHS_HSTPIP) Pipe 3 Enable Position */
#define USBHS_HSTPIP_PEN3_Msk                 (0x1U << USBHS_HSTPIP_PEN3_Pos)                /**< (USBHS_HSTPIP) Pipe 3 Enable Mask */
#define USBHS_HSTPIP_PEN4_Pos                 (4)                                            /**< (USBHS_HSTPIP) Pipe 4 Enable Position */
#define USBHS_HSTPIP_PEN4_Msk                 (0x1U << USBHS_HSTPIP_PEN4_Pos)                /**< (USBHS_HSTPIP) Pipe 4 Enable Mask */
#define USBHS_HSTPIP_PEN5_Pos                 (5)                                            /**< (USBHS_HSTPIP) Pipe 5 Enable Position */
#define USBHS_HSTPIP_PEN5_Msk                 (0x1U << USBHS_HSTPIP_PEN5_Pos)                /**< (USBHS_HSTPIP) Pipe 5 Enable Mask */
#define USBHS_HSTPIP_PEN6_Pos                 (6)                                            /**< (USBHS_HSTPIP) Pipe 6 Enable Position */
#define USBHS_HSTPIP_PEN6_Msk                 (0x1U << USBHS_HSTPIP_PEN6_Pos)                /**< (USBHS_HSTPIP) Pipe 6 Enable Mask */
#define USBHS_HSTPIP_PEN7_Pos                 (7)                                            /**< (USBHS_HSTPIP) Pipe 7 Enable Position */
#define USBHS_HSTPIP_PEN7_Msk                 (0x1U << USBHS_HSTPIP_PEN7_Pos)                /**< (USBHS_HSTPIP) Pipe 7 Enable Mask */
#define USBHS_HSTPIP_PEN8_Pos                 (8)                                            /**< (USBHS_HSTPIP) Pipe 8 Enable Position */
#define USBHS_HSTPIP_PEN8_Msk                 (0x1U << USBHS_HSTPIP_PEN8_Pos)                /**< (USBHS_HSTPIP) Pipe 8 Enable Mask */
#define USBHS_HSTPIP_PRST0_Pos                (16)                                           /**< (USBHS_HSTPIP) Pipe 0 Reset Position */
#define USBHS_HSTPIP_PRST0_Msk                (0x1U << USBHS_HSTPIP_PRST0_Pos)               /**< (USBHS_HSTPIP) Pipe 0 Reset Mask */
#define USBHS_HSTPIP_PRST1_Pos                (17)                                           /**< (USBHS_HSTPIP) Pipe 1 Reset Position */
#define USBHS_HSTPIP_PRST1_Msk                (0x1U << USBHS_HSTPIP_PRST1_Pos)               /**< (USBHS_HSTPIP) Pipe 1 Reset Mask */
#define USBHS_HSTPIP_PRST2_Pos                (18)                                           /**< (USBHS_HSTPIP) Pipe 2 Reset Position */
#define USBHS_HSTPIP_PRST2_Msk                (0x1U << USBHS_HSTPIP_PRST2_Pos)               /**< (USBHS_HSTPIP) Pipe 2 Reset Mask */
#define USBHS_HSTPIP_PRST3_Pos                (19)                                           /**< (USBHS_HSTPIP) Pipe 3 Reset Position */
#define USBHS_HSTPIP_PRST3_Msk                (0x1U << USBHS_HSTPIP_PRST3_Pos)               /**< (USBHS_HSTPIP) Pipe 3 Reset Mask */
#define USBHS_HSTPIP_PRST4_Pos                (20)                                           /**< (USBHS_HSTPIP) Pipe 4 Reset Position */
#define USBHS_HSTPIP_PRST4_Msk                (0x1U << USBHS_HSTPIP_PRST4_Pos)               /**< (USBHS_HSTPIP) Pipe 4 Reset Mask */
#define USBHS_HSTPIP_PRST5_Pos                (21)                                           /**< (USBHS_HSTPIP) Pipe 5 Reset Position */
#define USBHS_HSTPIP_PRST5_Msk                (0x1U << USBHS_HSTPIP_PRST5_Pos)               /**< (USBHS_HSTPIP) Pipe 5 Reset Mask */
#define USBHS_HSTPIP_PRST6_Pos                (22)                                           /**< (USBHS_HSTPIP) Pipe 6 Reset Position */
#define USBHS_HSTPIP_PRST6_Msk                (0x1U << USBHS_HSTPIP_PRST6_Pos)               /**< (USBHS_HSTPIP) Pipe 6 Reset Mask */
#define USBHS_HSTPIP_PRST7_Pos                (23)                                           /**< (USBHS_HSTPIP) Pipe 7 Reset Position */
#define USBHS_HSTPIP_PRST7_Msk                (0x1U << USBHS_HSTPIP_PRST7_Pos)               /**< (USBHS_HSTPIP) Pipe 7 Reset Mask */
#define USBHS_HSTPIP_PRST8_Pos                (24)                                           /**< (USBHS_HSTPIP) Pipe 8 Reset Position */
#define USBHS_HSTPIP_PRST8_Msk                (0x1U << USBHS_HSTPIP_PRST8_Pos)               /**< (USBHS_HSTPIP) Pipe 8 Reset Mask */
#define USBHS_HSTPIP_Msk                      (0x01FF01FFUL)                                 /**< (USBHS_HSTPIP) Register Mask  */
#define USBHS_HSTPIP_PEN_Pos                  (0)                                            /**< (USBHS_HSTPIP Position) Pipe x Enable */
#define USBHS_HSTPIP_PEN_Msk                  (0x1FFU << USBHS_HSTPIP_PEN_Pos)               /**< (USBHS_HSTPIP Mask) PEN */
#define USBHS_HSTPIP_PEN(value)               (USBHS_HSTPIP_PEN_Msk & ((value) << USBHS_HSTPIP_PEN_Pos))
#define USBHS_HSTPIP_PRST_Pos                 (16)                                           /**< (USBHS_HSTPIP Position) Pipe 8 Reset */
#define USBHS_HSTPIP_PRST_Msk                 (0x1FFU << USBHS_HSTPIP_PRST_Pos)              /**< (USBHS_HSTPIP Mask) PRST */
#define USBHS_HSTPIP_PRST(value)              (USBHS_HSTPIP_PRST_Msk & ((value) << USBHS_HSTPIP_PRST_Pos))

/* -------- USBHS_HSTFNUM : (USBHS Offset: 0x420) (R/W 32) Host Frame Number Register -------- */

typedef union
{
  struct
  {
    uint32_t MFNUM:3;                   /**< bit:   0..2  Micro Frame Number                            */
    uint32_t FNUM:11;                   /**< bit:  3..13  Frame Number                                  */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t FLENHIGH:8;                /**< bit: 16..23  Frame Length                                  */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTFNUM_bits_t;

#define USBHS_HSTFNUM_MFNUM_Pos               (0)                                            /**< (USBHS_HSTFNUM) Micro Frame Number Position */
#define USBHS_HSTFNUM_MFNUM_Msk               (0x7U << USBHS_HSTFNUM_MFNUM_Pos)              /**< (USBHS_HSTFNUM) Micro Frame Number Mask */
#define USBHS_HSTFNUM_MFNUM(value)            (USBHS_HSTFNUM_MFNUM_Msk & ((value) << USBHS_HSTFNUM_MFNUM_Pos))
#define USBHS_HSTFNUM_FNUM_Pos                (3)                                            /**< (USBHS_HSTFNUM) Frame Number Position */
#define USBHS_HSTFNUM_FNUM_Msk                (0x7FFU << USBHS_HSTFNUM_FNUM_Pos)             /**< (USBHS_HSTFNUM) Frame Number Mask */
#define USBHS_HSTFNUM_FNUM(value)             (USBHS_HSTFNUM_FNUM_Msk & ((value) << USBHS_HSTFNUM_FNUM_Pos))
#define USBHS_HSTFNUM_FLENHIGH_Pos            (16)                                           /**< (USBHS_HSTFNUM) Frame Length Position */
#define USBHS_HSTFNUM_FLENHIGH_Msk            (0xFFU << USBHS_HSTFNUM_FLENHIGH_Pos)          /**< (USBHS_HSTFNUM) Frame Length Mask */
#define USBHS_HSTFNUM_FLENHIGH(value)         (USBHS_HSTFNUM_FLENHIGH_Msk & ((value) << USBHS_HSTFNUM_FLENHIGH_Pos))
#define USBHS_HSTFNUM_Msk                     (0x00FF3FFFUL)                                 /**< (USBHS_HSTFNUM) Register Mask  */

/* -------- USBHS_HSTADDR1 : (USBHS Offset: 0x424) (R/W 32) Host Address 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t HSTADDRP0:7;               /**< bit:   0..6  USB Host Address                              */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t HSTADDRP1:7;               /**< bit:  8..14  USB Host Address                              */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t HSTADDRP2:7;               /**< bit: 16..22  USB Host Address                              */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t HSTADDRP3:7;               /**< bit: 24..30  USB Host Address                              */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTADDR1_bits_t;

#define USBHS_HSTADDR1_HSTADDRP0_Pos          (0)                                            /**< (USBHS_HSTADDR1) USB Host Address Position */
#define USBHS_HSTADDR1_HSTADDRP0_Msk          (0x7FU << USBHS_HSTADDR1_HSTADDRP0_Pos)        /**< (USBHS_HSTADDR1) USB Host Address Mask */
#define USBHS_HSTADDR1_HSTADDRP0(value)       (USBHS_HSTADDR1_HSTADDRP0_Msk & ((value) << USBHS_HSTADDR1_HSTADDRP0_Pos))
#define USBHS_HSTADDR1_HSTADDRP1_Pos          (8)                                            /**< (USBHS_HSTADDR1) USB Host Address Position */
#define USBHS_HSTADDR1_HSTADDRP1_Msk          (0x7FU << USBHS_HSTADDR1_HSTADDRP1_Pos)        /**< (USBHS_HSTADDR1) USB Host Address Mask */
#define USBHS_HSTADDR1_HSTADDRP1(value)       (USBHS_HSTADDR1_HSTADDRP1_Msk & ((value) << USBHS_HSTADDR1_HSTADDRP1_Pos))
#define USBHS_HSTADDR1_HSTADDRP2_Pos          (16)                                           /**< (USBHS_HSTADDR1) USB Host Address Position */
#define USBHS_HSTADDR1_HSTADDRP2_Msk          (0x7FU << USBHS_HSTADDR1_HSTADDRP2_Pos)        /**< (USBHS_HSTADDR1) USB Host Address Mask */
#define USBHS_HSTADDR1_HSTADDRP2(value)       (USBHS_HSTADDR1_HSTADDRP2_Msk & ((value) << USBHS_HSTADDR1_HSTADDRP2_Pos))
#define USBHS_HSTADDR1_HSTADDRP3_Pos          (24)                                           /**< (USBHS_HSTADDR1) USB Host Address Position */
#define USBHS_HSTADDR1_HSTADDRP3_Msk          (0x7FU << USBHS_HSTADDR1_HSTADDRP3_Pos)        /**< (USBHS_HSTADDR1) USB Host Address Mask */
#define USBHS_HSTADDR1_HSTADDRP3(value)       (USBHS_HSTADDR1_HSTADDRP3_Msk & ((value) << USBHS_HSTADDR1_HSTADDRP3_Pos))
#define USBHS_HSTADDR1_Msk                    (0x7F7F7F7FUL)                                 /**< (USBHS_HSTADDR1) Register Mask  */

/* -------- USBHS_HSTADDR2 : (USBHS Offset: 0x428) (R/W 32) Host Address 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t HSTADDRP4:7;               /**< bit:   0..6  USB Host Address                              */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t HSTADDRP5:7;               /**< bit:  8..14  USB Host Address                              */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t HSTADDRP6:7;               /**< bit: 16..22  USB Host Address                              */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t HSTADDRP7:7;               /**< bit: 24..30  USB Host Address                              */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTADDR2_bits_t;

#define USBHS_HSTADDR2_HSTADDRP4_Pos          (0)                                            /**< (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP4_Msk          (0x7FU << USBHS_HSTADDR2_HSTADDRP4_Pos)        /**< (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP4(value)       (USBHS_HSTADDR2_HSTADDRP4_Msk & ((value) << USBHS_HSTADDR2_HSTADDRP4_Pos))
#define USBHS_HSTADDR2_HSTADDRP5_Pos          (8)                                            /**< (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP5_Msk          (0x7FU << USBHS_HSTADDR2_HSTADDRP5_Pos)        /**< (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP5(value)       (USBHS_HSTADDR2_HSTADDRP5_Msk & ((value) << USBHS_HSTADDR2_HSTADDRP5_Pos))
#define USBHS_HSTADDR2_HSTADDRP6_Pos          (16)                                           /**< (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP6_Msk          (0x7FU << USBHS_HSTADDR2_HSTADDRP6_Pos)        /**< (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP6(value)       (USBHS_HSTADDR2_HSTADDRP6_Msk & ((value) << USBHS_HSTADDR2_HSTADDRP6_Pos))
#define USBHS_HSTADDR2_HSTADDRP7_Pos          (24)                                           /**< (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP7_Msk          (0x7FU << USBHS_HSTADDR2_HSTADDRP7_Pos)        /**< (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP7(value)       (USBHS_HSTADDR2_HSTADDRP7_Msk & ((value) << USBHS_HSTADDR2_HSTADDRP7_Pos))
#define USBHS_HSTADDR2_Msk                    (0x7F7F7F7FUL)                                 /**< (USBHS_HSTADDR2) Register Mask  */

/* -------- USBHS_HSTADDR3 : (USBHS Offset: 0x42c) (R/W 32) Host Address 3 Register -------- */

typedef union
{
  struct
  {
    uint32_t HSTADDRP8:7;               /**< bit:   0..6  USB Host Address                              */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t HSTADDRP9:7;               /**< bit:  8..14  USB Host Address                              */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTADDR3_bits_t;

