zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_HSTADDR3_HSTADDRP8_Pos          (0)                                            /**< (USBHS_HSTADDR3) USB Host Address Position */
#define USBHS_HSTADDR3_HSTADDRP8_Msk          (0x7FU << USBHS_HSTADDR3_HSTADDRP8_Pos)        /**< (USBHS_HSTADDR3) USB Host Address Mask */
#define USBHS_HSTADDR3_HSTADDRP8(value)       (USBHS_HSTADDR3_HSTADDRP8_Msk & ((value) << USBHS_HSTADDR3_HSTADDRP8_Pos))
#define USBHS_HSTADDR3_HSTADDRP9_Pos          (8)                                            /**< (USBHS_HSTADDR3) USB Host Address Position */
#define USBHS_HSTADDR3_HSTADDRP9_Msk          (0x7FU << USBHS_HSTADDR3_HSTADDRP9_Pos)        /**< (USBHS_HSTADDR3) USB Host Address Mask */
#define USBHS_HSTADDR3_HSTADDRP9(value)       (USBHS_HSTADDR3_HSTADDRP9_Msk & ((value) << USBHS_HSTADDR3_HSTADDRP9_Pos))
#define USBHS_HSTADDR3_Msk                    (0x00007F7FUL)                                 /**< (USBHS_HSTADDR3) Register Mask  */

/* -------- USBHS_HSTPIPCFG : (USBHS Offset: 0x500) (R/W 32) Host Pipe Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t ALLOC:1;                   /**< bit:      1  Pipe Memory Allocate                          */
    uint32_t PBK:2;                     /**< bit:   2..3  Pipe Banks                                    */
    uint32_t PSIZE:3;                   /**< bit:   4..6  Pipe Size                                     */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t PTOKEN:2;                  /**< bit:   8..9  Pipe Token                                    */
    uint32_t AUTOSW:1;                  /**< bit:     10  Automatic Switch                              */
    uint32_t :1;                        /**< bit:     11  Reserved                                      */
    uint32_t PTYPE:2;                   /**< bit: 12..13  Pipe Type                                     */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t PEPNUM:4;                  /**< bit: 16..19  Pipe Endpoint Number                          */
    uint32_t :4;                        /**< bit: 20..23  Reserved                                      */
    uint32_t INTFRQ:8;                  /**< bit: 24..31  Pipe Interrupt Request Frequency              */
  };
  struct
  { // Control and Bulk Endpoints mode
    uint32_t :20;                       /**< bit:  0..19  Reserved                                      */
    uint32_t PINGEN:1;                  /**< bit:     20  Ping Enable                                   */
    uint32_t :3;                        /**< bit: 21..23  Reserved                                      */
    uint32_t BINTERVAL:8;               /**< bit: 24..31  bInterval Parameter for the Bulk-Out/Ping Transaction */
  };
  uint32_t w;
} __USBHS_HSTPIPCFG_bits_t;

#define USBHS_HSTPIPCFG_ALLOC_Pos             (1)                                            /**< (USBHS_HSTPIPCFG) Pipe Memory Allocate Position */
#define USBHS_HSTPIPCFG_ALLOC_Msk             (0x1U << USBHS_HSTPIPCFG_ALLOC_Pos)            /**< (USBHS_HSTPIPCFG) Pipe Memory Allocate Mask */
#define USBHS_HSTPIPCFG_PBK_Pos               (2)                                            /**< (USBHS_HSTPIPCFG) Pipe Banks Position */
#define USBHS_HSTPIPCFG_PBK_Msk               (0x3U << USBHS_HSTPIPCFG_PBK_Pos)              /**< (USBHS_HSTPIPCFG) Pipe Banks Mask */
#define USBHS_HSTPIPCFG_PBK(value)            (USBHS_HSTPIPCFG_PBK_Msk & ((value) << USBHS_HSTPIPCFG_PBK_Pos))
#define   USBHS_HSTPIPCFG_PBK_1_BANK_Val      (0x0U)                                         /**< (USBHS_HSTPIPCFG) Single-bank pipe  */
#define   USBHS_HSTPIPCFG_PBK_2_BANK_Val      (0x1U)                                         /**< (USBHS_HSTPIPCFG) Double-bank pipe  */
#define   USBHS_HSTPIPCFG_PBK_3_BANK_Val      (0x2U)                                         /**< (USBHS_HSTPIPCFG) Triple-bank pipe  */
#define USBHS_HSTPIPCFG_PBK_1_BANK            (USBHS_HSTPIPCFG_PBK_1_BANK_Val << USBHS_HSTPIPCFG_PBK_Pos)  /**< (USBHS_HSTPIPCFG) Single-bank pipe Position  */
#define USBHS_HSTPIPCFG_PBK_2_BANK            (USBHS_HSTPIPCFG_PBK_2_BANK_Val << USBHS_HSTPIPCFG_PBK_Pos)  /**< (USBHS_HSTPIPCFG) Double-bank pipe Position  */
#define USBHS_HSTPIPCFG_PBK_3_BANK            (USBHS_HSTPIPCFG_PBK_3_BANK_Val << USBHS_HSTPIPCFG_PBK_Pos)  /**< (USBHS_HSTPIPCFG) Triple-bank pipe Position  */
#define USBHS_HSTPIPCFG_PSIZE_Pos             (4)                                            /**< (USBHS_HSTPIPCFG) Pipe Size Position */
#define USBHS_HSTPIPCFG_PSIZE_Msk             (0x7U << USBHS_HSTPIPCFG_PSIZE_Pos)            /**< (USBHS_HSTPIPCFG) Pipe Size Mask */
#define USBHS_HSTPIPCFG_PSIZE(value)          (USBHS_HSTPIPCFG_PSIZE_Msk & ((value) << USBHS_HSTPIPCFG_PSIZE_Pos))
#define   USBHS_HSTPIPCFG_PSIZE_8_BYTE_Val    (0x0U)                                         /**< (USBHS_HSTPIPCFG) 8 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_16_BYTE_Val   (0x1U)                                         /**< (USBHS_HSTPIPCFG) 16 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_32_BYTE_Val   (0x2U)                                         /**< (USBHS_HSTPIPCFG) 32 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_64_BYTE_Val   (0x3U)                                         /**< (USBHS_HSTPIPCFG) 64 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_128_BYTE_Val  (0x4U)                                         /**< (USBHS_HSTPIPCFG) 128 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_256_BYTE_Val  (0x5U)                                         /**< (USBHS_HSTPIPCFG) 256 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_512_BYTE_Val  (0x6U)                                         /**< (USBHS_HSTPIPCFG) 512 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_1024_BYTE_Val (0x7U)                                         /**< (USBHS_HSTPIPCFG) 1024 bytes  */
#define USBHS_HSTPIPCFG_PSIZE_8_BYTE          (USBHS_HSTPIPCFG_PSIZE_8_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos)  /**< (USBHS_HSTPIPCFG) 8 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_16_BYTE         (USBHS_HSTPIPCFG_PSIZE_16_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos)  /**< (USBHS_HSTPIPCFG) 16 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_32_BYTE         (USBHS_HSTPIPCFG_PSIZE_32_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos)  /**< (USBHS_HSTPIPCFG) 32 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_64_BYTE         (USBHS_HSTPIPCFG_PSIZE_64_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos)  /**< (USBHS_HSTPIPCFG) 64 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_128_BYTE        (USBHS_HSTPIPCFG_PSIZE_128_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos)  /**< (USBHS_HSTPIPCFG) 128 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_256_BYTE        (USBHS_HSTPIPCFG_PSIZE_256_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos)  /**< (USBHS_HSTPIPCFG) 256 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_512_BYTE        (USBHS_HSTPIPCFG_PSIZE_512_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos)  /**< (USBHS_HSTPIPCFG) 512 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_1024_BYTE       (USBHS_HSTPIPCFG_PSIZE_1024_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos)  /**< (USBHS_HSTPIPCFG) 1024 bytes Position  */
#define USBHS_HSTPIPCFG_PTOKEN_Pos            (8)                                            /**< (USBHS_HSTPIPCFG) Pipe Token Position */
#define USBHS_HSTPIPCFG_PTOKEN_Msk            (0x3U << USBHS_HSTPIPCFG_PTOKEN_Pos)           /**< (USBHS_HSTPIPCFG) Pipe Token Mask */
#define USBHS_HSTPIPCFG_PTOKEN(value)         (USBHS_HSTPIPCFG_PTOKEN_Msk & ((value) << USBHS_HSTPIPCFG_PTOKEN_Pos))
#define   USBHS_HSTPIPCFG_PTOKEN_SETUP_Val    (0x0U)                                         /**< (USBHS_HSTPIPCFG) SETUP  */
#define   USBHS_HSTPIPCFG_PTOKEN_IN_Val       (0x1U)                                         /**< (USBHS_HSTPIPCFG) IN  */
#define   USBHS_HSTPIPCFG_PTOKEN_OUT_Val      (0x2U)                                         /**< (USBHS_HSTPIPCFG) OUT  */
#define USBHS_HSTPIPCFG_PTOKEN_SETUP          (USBHS_HSTPIPCFG_PTOKEN_SETUP_Val << USBHS_HSTPIPCFG_PTOKEN_Pos)  /**< (USBHS_HSTPIPCFG) SETUP Position  */
#define USBHS_HSTPIPCFG_PTOKEN_IN             (USBHS_HSTPIPCFG_PTOKEN_IN_Val << USBHS_HSTPIPCFG_PTOKEN_Pos)  /**< (USBHS_HSTPIPCFG) IN Position  */
#define USBHS_HSTPIPCFG_PTOKEN_OUT            (USBHS_HSTPIPCFG_PTOKEN_OUT_Val << USBHS_HSTPIPCFG_PTOKEN_Pos)  /**< (USBHS_HSTPIPCFG) OUT Position  */
#define USBHS_HSTPIPCFG_AUTOSW_Pos            (10)                                           /**< (USBHS_HSTPIPCFG) Automatic Switch Position */
#define USBHS_HSTPIPCFG_AUTOSW_Msk            (0x1U << USBHS_HSTPIPCFG_AUTOSW_Pos)           /**< (USBHS_HSTPIPCFG) Automatic Switch Mask */
#define USBHS_HSTPIPCFG_PTYPE_Pos             (12)                                           /**< (USBHS_HSTPIPCFG) Pipe Type Position */
#define USBHS_HSTPIPCFG_PTYPE_Msk             (0x3U << USBHS_HSTPIPCFG_PTYPE_Pos)            /**< (USBHS_HSTPIPCFG) Pipe Type Mask */
#define USBHS_HSTPIPCFG_PTYPE(value)          (USBHS_HSTPIPCFG_PTYPE_Msk & ((value) << USBHS_HSTPIPCFG_PTYPE_Pos))
#define   USBHS_HSTPIPCFG_PTYPE_CTRL_Val      (0x0U)                                         /**< (USBHS_HSTPIPCFG) Control  */
#define   USBHS_HSTPIPCFG_PTYPE_ISO_Val       (0x1U)                                         /**< (USBHS_HSTPIPCFG) Isochronous  */
#define   USBHS_HSTPIPCFG_PTYPE_BLK_Val       (0x2U)                                         /**< (USBHS_HSTPIPCFG) Bulk  */
#define   USBHS_HSTPIPCFG_PTYPE_INTRPT_Val    (0x3U)                                         /**< (USBHS_HSTPIPCFG) Interrupt  */
#define USBHS_HSTPIPCFG_PTYPE_CTRL            (USBHS_HSTPIPCFG_PTYPE_CTRL_Val << USBHS_HSTPIPCFG_PTYPE_Pos)  /**< (USBHS_HSTPIPCFG) Control Position  */
#define USBHS_HSTPIPCFG_PTYPE_ISO             (USBHS_HSTPIPCFG_PTYPE_ISO_Val << USBHS_HSTPIPCFG_PTYPE_Pos)  /**< (USBHS_HSTPIPCFG) Isochronous Position  */
#define USBHS_HSTPIPCFG_PTYPE_BLK             (USBHS_HSTPIPCFG_PTYPE_BLK_Val << USBHS_HSTPIPCFG_PTYPE_Pos)  /**< (USBHS_HSTPIPCFG) Bulk Position  */
#define USBHS_HSTPIPCFG_PTYPE_INTRPT          (USBHS_HSTPIPCFG_PTYPE_INTRPT_Val << USBHS_HSTPIPCFG_PTYPE_Pos)  /**< (USBHS_HSTPIPCFG) Interrupt Position  */
#define USBHS_HSTPIPCFG_PEPNUM_Pos            (16)                                           /**< (USBHS_HSTPIPCFG) Pipe Endpoint Number Position */
#define USBHS_HSTPIPCFG_PEPNUM_Msk            (0xFU << USBHS_HSTPIPCFG_PEPNUM_Pos)           /**< (USBHS_HSTPIPCFG) Pipe Endpoint Number Mask */
#define USBHS_HSTPIPCFG_PEPNUM(value)         (USBHS_HSTPIPCFG_PEPNUM_Msk & ((value) << USBHS_HSTPIPCFG_PEPNUM_Pos))
#define USBHS_HSTPIPCFG_INTFRQ_Pos            (24)                                           /**< (USBHS_HSTPIPCFG) Pipe Interrupt Request Frequency Position */
#define USBHS_HSTPIPCFG_INTFRQ_Msk            (0xFFU << USBHS_HSTPIPCFG_INTFRQ_Pos)          /**< (USBHS_HSTPIPCFG) Pipe Interrupt Request Frequency Mask */
#define USBHS_HSTPIPCFG_INTFRQ(value)         (USBHS_HSTPIPCFG_INTFRQ_Msk & ((value) << USBHS_HSTPIPCFG_INTFRQ_Pos))
/* Control and Bulk Endpoints mode */
#define USBHS_HSTPIPCFG_PINGEN_Pos            (20)                                           /**< (USBHS_HSTPIPCFG) Ping Enable Position */
#define USBHS_HSTPIPCFG_PINGEN_Msk            (0x1U << USBHS_HSTPIPCFG_PINGEN_Pos)           /**< (USBHS_HSTPIPCFG) Ping Enable Mask */
#define USBHS_HSTPIPCFG_BINTERVAL_Pos         (24)                                           /**< (USBHS_HSTPIPCFG) bInterval Parameter for the Bulk-Out/Ping Transaction Position */
#define USBHS_HSTPIPCFG_BINTERVAL_Msk         (0xFFU << USBHS_HSTPIPCFG_BINTERVAL_Pos)       /**< (USBHS_HSTPIPCFG) bInterval Parameter for the Bulk-Out/Ping Transaction Mask */
#define USBHS_HSTPIPCFG_BINTERVAL(value)      (USBHS_HSTPIPCFG_BINTERVAL_Msk & ((value) << USBHS_HSTPIPCFG_BINTERVAL_Pos))

/* -------- USBHS_HSTPIPISR : (USBHS Offset: 0x530) (R/ 32) Host Pipe Status Register -------- */

typedef union
{
  struct
  {
    uint32_t RXINI:1;                   /**< bit:      0  Received IN Data Interrupt                    */
    uint32_t TXOUTI:1;                  /**< bit:      1  Transmitted OUT Data Interrupt                */
    uint32_t TXSTPI:1;                  /**< bit:      2  Transmitted SETUP Interrupt                   */
    uint32_t PERRI:1;                   /**< bit:      3  Pipe Error Interrupt                          */
    uint32_t NAKEDI:1;                  /**< bit:      4  NAKed Interrupt                               */
    uint32_t OVERFI:1;                  /**< bit:      5  Overflow Interrupt                            */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t SHORTPACKETI:1;            /**< bit:      7  Short Packet Interrupt                        */
    uint32_t DTSEQ:2;                   /**< bit:   8..9  Data Toggle Sequence                          */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t NBUSYBK:2;                 /**< bit: 12..13  Number of Busy Banks                          */
    uint32_t CURRBK:2;                  /**< bit: 14..15  Current Bank                                  */
    uint32_t RWALL:1;                   /**< bit:     16  Read/Write Allowed                            */
    uint32_t :1;                        /**< bit:     17  Reserved                                      */
    uint32_t CFGOK:1;                   /**< bit:     18  Configuration OK Status                       */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t PBYCT:11;                  /**< bit: 20..30  Pipe Byte Count                               */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  struct
  { // Control, Interrupt and Bulk Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t RXSTALLDI:1;               /**< bit:      6  Received STALLed Interrupt                    */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  struct
  { // Interrupt and Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFI:1;                 /**< bit:      2  Underflow Interrupt                           */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t CRCERRI:1;                 /**< bit:      6  CRC Error Interrupt                           */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIPISR_bits_t;

