zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_HSTPIPISR_RXINI_Pos             (0)                                            /**< (USBHS_HSTPIPISR) Received IN Data Interrupt Position */
#define USBHS_HSTPIPISR_RXINI_Msk             (0x1U << USBHS_HSTPIPISR_RXINI_Pos)            /**< (USBHS_HSTPIPISR) Received IN Data Interrupt Mask */
#define USBHS_HSTPIPISR_TXOUTI_Pos            (1)                                            /**< (USBHS_HSTPIPISR) Transmitted OUT Data Interrupt Position */
#define USBHS_HSTPIPISR_TXOUTI_Msk            (0x1U << USBHS_HSTPIPISR_TXOUTI_Pos)           /**< (USBHS_HSTPIPISR) Transmitted OUT Data Interrupt Mask */
#define USBHS_HSTPIPISR_TXSTPI_Pos            (2)                                            /**< (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Position */
#define USBHS_HSTPIPISR_TXSTPI_Msk            (0x1U << USBHS_HSTPIPISR_TXSTPI_Pos)           /**< (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Mask */
#define USBHS_HSTPIPISR_PERRI_Pos             (3)                                            /**< (USBHS_HSTPIPISR) Pipe Error Interrupt Position */
#define USBHS_HSTPIPISR_PERRI_Msk             (0x1U << USBHS_HSTPIPISR_PERRI_Pos)            /**< (USBHS_HSTPIPISR) Pipe Error Interrupt Mask */
#define USBHS_HSTPIPISR_NAKEDI_Pos            (4)                                            /**< (USBHS_HSTPIPISR) NAKed Interrupt Position */
#define USBHS_HSTPIPISR_NAKEDI_Msk            (0x1U << USBHS_HSTPIPISR_NAKEDI_Pos)           /**< (USBHS_HSTPIPISR) NAKed Interrupt Mask */
#define USBHS_HSTPIPISR_OVERFI_Pos            (5)                                            /**< (USBHS_HSTPIPISR) Overflow Interrupt Position */
#define USBHS_HSTPIPISR_OVERFI_Msk            (0x1U << USBHS_HSTPIPISR_OVERFI_Pos)           /**< (USBHS_HSTPIPISR) Overflow Interrupt Mask */
#define USBHS_HSTPIPISR_SHORTPACKETI_Pos      (7)                                            /**< (USBHS_HSTPIPISR) Short Packet Interrupt Position */
#define USBHS_HSTPIPISR_SHORTPACKETI_Msk      (0x1U << USBHS_HSTPIPISR_SHORTPACKETI_Pos)     /**< (USBHS_HSTPIPISR) Short Packet Interrupt Mask */
#define USBHS_HSTPIPISR_DTSEQ_Pos             (8)                                            /**< (USBHS_HSTPIPISR) Data Toggle Sequence Position */
#define USBHS_HSTPIPISR_DTSEQ_Msk             (0x3U << USBHS_HSTPIPISR_DTSEQ_Pos)            /**< (USBHS_HSTPIPISR) Data Toggle Sequence Mask */
#define USBHS_HSTPIPISR_DTSEQ(value)          (USBHS_HSTPIPISR_DTSEQ_Msk & ((value) << USBHS_HSTPIPISR_DTSEQ_Pos))
#define   USBHS_HSTPIPISR_DTSEQ_DATA0_Val     (0x0U)                                         /**< (USBHS_HSTPIPISR) Data0 toggle sequence  */
#define   USBHS_HSTPIPISR_DTSEQ_DATA1_Val     (0x1U)                                         /**< (USBHS_HSTPIPISR) Data1 toggle sequence  */
#define USBHS_HSTPIPISR_DTSEQ_DATA0           (USBHS_HSTPIPISR_DTSEQ_DATA0_Val << USBHS_HSTPIPISR_DTSEQ_Pos)  /**< (USBHS_HSTPIPISR) Data0 toggle sequence Position  */
#define USBHS_HSTPIPISR_DTSEQ_DATA1           (USBHS_HSTPIPISR_DTSEQ_DATA1_Val << USBHS_HSTPIPISR_DTSEQ_Pos)  /**< (USBHS_HSTPIPISR) Data1 toggle sequence Position  */
#define USBHS_HSTPIPISR_NBUSYBK_Pos           (12)                                           /**< (USBHS_HSTPIPISR) Number of Busy Banks Position */
#define USBHS_HSTPIPISR_NBUSYBK_Msk           (0x3U << USBHS_HSTPIPISR_NBUSYBK_Pos)          /**< (USBHS_HSTPIPISR) Number of Busy Banks Mask */
#define USBHS_HSTPIPISR_NBUSYBK(value)        (USBHS_HSTPIPISR_NBUSYBK_Msk & ((value) << USBHS_HSTPIPISR_NBUSYBK_Pos))
#define   USBHS_HSTPIPISR_NBUSYBK_0_BUSY_Val  (0x0U)                                         /**< (USBHS_HSTPIPISR) 0 busy bank (all banks free)  */
#define   USBHS_HSTPIPISR_NBUSYBK_1_BUSY_Val  (0x1U)                                         /**< (USBHS_HSTPIPISR) 1 busy bank  */
#define   USBHS_HSTPIPISR_NBUSYBK_2_BUSY_Val  (0x2U)                                         /**< (USBHS_HSTPIPISR) 2 busy banks  */
#define   USBHS_HSTPIPISR_NBUSYBK_3_BUSY_Val  (0x3U)                                         /**< (USBHS_HSTPIPISR) 3 busy banks  */
#define USBHS_HSTPIPISR_NBUSYBK_0_BUSY        (USBHS_HSTPIPISR_NBUSYBK_0_BUSY_Val << USBHS_HSTPIPISR_NBUSYBK_Pos)  /**< (USBHS_HSTPIPISR) 0 busy bank (all banks free) Position  */
#define USBHS_HSTPIPISR_NBUSYBK_1_BUSY        (USBHS_HSTPIPISR_NBUSYBK_1_BUSY_Val << USBHS_HSTPIPISR_NBUSYBK_Pos)  /**< (USBHS_HSTPIPISR) 1 busy bank Position  */
#define USBHS_HSTPIPISR_NBUSYBK_2_BUSY        (USBHS_HSTPIPISR_NBUSYBK_2_BUSY_Val << USBHS_HSTPIPISR_NBUSYBK_Pos)  /**< (USBHS_HSTPIPISR) 2 busy banks Position  */
#define USBHS_HSTPIPISR_NBUSYBK_3_BUSY        (USBHS_HSTPIPISR_NBUSYBK_3_BUSY_Val << USBHS_HSTPIPISR_NBUSYBK_Pos)  /**< (USBHS_HSTPIPISR) 3 busy banks Position  */
#define USBHS_HSTPIPISR_CURRBK_Pos            (14)                                           /**< (USBHS_HSTPIPISR) Current Bank Position */
#define USBHS_HSTPIPISR_CURRBK_Msk            (0x3U << USBHS_HSTPIPISR_CURRBK_Pos)           /**< (USBHS_HSTPIPISR) Current Bank Mask */
#define USBHS_HSTPIPISR_CURRBK(value)         (USBHS_HSTPIPISR_CURRBK_Msk & ((value) << USBHS_HSTPIPISR_CURRBK_Pos))
#define   USBHS_HSTPIPISR_CURRBK_BANK0_Val    (0x0U)                                         /**< (USBHS_HSTPIPISR) Current bank is bank0  */
#define   USBHS_HSTPIPISR_CURRBK_BANK1_Val    (0x1U)                                         /**< (USBHS_HSTPIPISR) Current bank is bank1  */
#define   USBHS_HSTPIPISR_CURRBK_BANK2_Val    (0x2U)                                         /**< (USBHS_HSTPIPISR) Current bank is bank2  */
#define USBHS_HSTPIPISR_CURRBK_BANK0          (USBHS_HSTPIPISR_CURRBK_BANK0_Val << USBHS_HSTPIPISR_CURRBK_Pos)  /**< (USBHS_HSTPIPISR) Current bank is bank0 Position  */
#define USBHS_HSTPIPISR_CURRBK_BANK1          (USBHS_HSTPIPISR_CURRBK_BANK1_Val << USBHS_HSTPIPISR_CURRBK_Pos)  /**< (USBHS_HSTPIPISR) Current bank is bank1 Position  */
#define USBHS_HSTPIPISR_CURRBK_BANK2          (USBHS_HSTPIPISR_CURRBK_BANK2_Val << USBHS_HSTPIPISR_CURRBK_Pos)  /**< (USBHS_HSTPIPISR) Current bank is bank2 Position  */
#define USBHS_HSTPIPISR_RWALL_Pos             (16)                                           /**< (USBHS_HSTPIPISR) Read/Write Allowed Position */
#define USBHS_HSTPIPISR_RWALL_Msk             (0x1U << USBHS_HSTPIPISR_RWALL_Pos)            /**< (USBHS_HSTPIPISR) Read/Write Allowed Mask */
#define USBHS_HSTPIPISR_CFGOK_Pos             (18)                                           /**< (USBHS_HSTPIPISR) Configuration OK Status Position */
#define USBHS_HSTPIPISR_CFGOK_Msk             (0x1U << USBHS_HSTPIPISR_CFGOK_Pos)            /**< (USBHS_HSTPIPISR) Configuration OK Status Mask */
#define USBHS_HSTPIPISR_PBYCT_Pos             (20)                                           /**< (USBHS_HSTPIPISR) Pipe Byte Count Position */
#define USBHS_HSTPIPISR_PBYCT_Msk             (0x7FFU << USBHS_HSTPIPISR_PBYCT_Pos)          /**< (USBHS_HSTPIPISR) Pipe Byte Count Mask */
#define USBHS_HSTPIPISR_PBYCT(value)          (USBHS_HSTPIPISR_PBYCT_Msk & ((value) << USBHS_HSTPIPISR_PBYCT_Pos))
/* Control, Interrupt and Bulk Endpoints mode */
#define USBHS_HSTPIPISR_RXSTALLDI_Pos         (6)                                            /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Position */
#define USBHS_HSTPIPISR_RXSTALLDI_Msk         (0x1U << USBHS_HSTPIPISR_RXSTALLDI_Pos)        /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Mask */
/* Interrupt and Isochronous Endpoints mode */
#define USBHS_HSTPIPISR_UNDERFI_Pos           (2)                                            /**< (USBHS_HSTPIPISR) Underflow Interrupt Position */
#define USBHS_HSTPIPISR_UNDERFI_Msk           (0x1U << USBHS_HSTPIPISR_UNDERFI_Pos)          /**< (USBHS_HSTPIPISR) Underflow Interrupt Mask */
/* Isochronous Endpoints mode */
#define USBHS_HSTPIPISR_CRCERRI_Pos           (6)                                            /**< (USBHS_HSTPIPISR) CRC Error Interrupt Position */
#define USBHS_HSTPIPISR_CRCERRI_Msk           (0x1U << USBHS_HSTPIPISR_CRCERRI_Pos)          /**< (USBHS_HSTPIPISR) CRC Error Interrupt Mask */

/* -------- USBHS_HSTPIPICR : (USBHS Offset: 0x560) (/W 32) Host Pipe Clear Register -------- */

typedef union
{
  struct
  {
    uint32_t RXINIC:1;                  /**< bit:      0  Received IN Data Interrupt Clear              */
    uint32_t TXOUTIC:1;                 /**< bit:      1  Transmitted OUT Data Interrupt Clear          */
    uint32_t TXSTPIC:1;                 /**< bit:      2  Transmitted SETUP Interrupt Clear             */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t NAKEDIC:1;                 /**< bit:      4  NAKed Interrupt Clear                         */
    uint32_t OVERFIC:1;                 /**< bit:      5  Overflow Interrupt Clear                      */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t SHORTPACKETIC:1;           /**< bit:      7  Short Packet Interrupt Clear                  */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  { // Control, Interrupt and Bulk Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t RXSTALLDIC:1;              /**< bit:      6  Received STALLed Interrupt Clear              */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  struct
  { // Interrupt and Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFIC:1;                /**< bit:      2  Underflow Interrupt Clear                     */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t CRCERRIC:1;                /**< bit:      6  CRC Error Interrupt Clear                     */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIPICR_bits_t;

#define USBHS_HSTPIPICR_RXINIC_Pos            (0)                                            /**< (USBHS_HSTPIPICR) Received IN Data Interrupt Clear Position */
#define USBHS_HSTPIPICR_RXINIC_Msk            (0x1U << USBHS_HSTPIPICR_RXINIC_Pos)           /**< (USBHS_HSTPIPICR) Received IN Data Interrupt Clear Mask */
#define USBHS_HSTPIPICR_TXOUTIC_Pos           (1)                                            /**< (USBHS_HSTPIPICR) Transmitted OUT Data Interrupt Clear Position */
#define USBHS_HSTPIPICR_TXOUTIC_Msk           (0x1U << USBHS_HSTPIPICR_TXOUTIC_Pos)          /**< (USBHS_HSTPIPICR) Transmitted OUT Data Interrupt Clear Mask */
#define USBHS_HSTPIPICR_TXSTPIC_Pos           (2)                                            /**< (USBHS_HSTPIPICR) Transmitted SETUP Interrupt Clear Position */
#define USBHS_HSTPIPICR_TXSTPIC_Msk           (0x1U << USBHS_HSTPIPICR_TXSTPIC_Pos)          /**< (USBHS_HSTPIPICR) Transmitted SETUP Interrupt Clear Mask */
#define USBHS_HSTPIPICR_NAKEDIC_Pos           (4)                                            /**< (USBHS_HSTPIPICR) NAKed Interrupt Clear Position */
#define USBHS_HSTPIPICR_NAKEDIC_Msk           (0x1U << USBHS_HSTPIPICR_NAKEDIC_Pos)          /**< (USBHS_HSTPIPICR) NAKed Interrupt Clear Mask */
#define USBHS_HSTPIPICR_OVERFIC_Pos           (5)                                            /**< (USBHS_HSTPIPICR) Overflow Interrupt Clear Position */
#define USBHS_HSTPIPICR_OVERFIC_Msk           (0x1U << USBHS_HSTPIPICR_OVERFIC_Pos)          /**< (USBHS_HSTPIPICR) Overflow Interrupt Clear Mask */
#define USBHS_HSTPIPICR_SHORTPACKETIC_Pos     (7)                                            /**< (USBHS_HSTPIPICR) Short Packet Interrupt Clear Position */
#define USBHS_HSTPIPICR_SHORTPACKETIC_Msk     (0x1U << USBHS_HSTPIPICR_SHORTPACKETIC_Pos)    /**< (USBHS_HSTPIPICR) Short Packet Interrupt Clear Mask */
/* Control, Interrupt and Bulk Endpoints mode */
#define USBHS_HSTPIPICR_RXSTALLDIC_Pos        (6)                                            /**< (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Position */
#define USBHS_HSTPIPICR_RXSTALLDIC_Msk        (0x1U << USBHS_HSTPIPICR_RXSTALLDIC_Pos)       /**< (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Mask */
/* Interrupt and Isochronous Endpoints mode */
#define USBHS_HSTPIPICR_UNDERFIC_Pos          (2)                                            /**< (USBHS_HSTPIPICR) Underflow Interrupt Clear Position */
#define USBHS_HSTPIPICR_UNDERFIC_Msk          (0x1U << USBHS_HSTPIPICR_UNDERFIC_Pos)         /**< (USBHS_HSTPIPICR) Underflow Interrupt Clear Mask */
/* Isochronous Endpoints mode */
#define USBHS_HSTPIPICR_CRCERRIC_Pos          (6)                                            /**< (USBHS_HSTPIPICR) CRC Error Interrupt Clear Position */
#define USBHS_HSTPIPICR_CRCERRIC_Msk          (0x1U << USBHS_HSTPIPICR_CRCERRIC_Pos)         /**< (USBHS_HSTPIPICR) CRC Error Interrupt Clear Mask */

