zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_HSTPIPIFR : (USBHS Offset: 0x590) (/W 32) Host Pipe Set Register -------- */

typedef union
{
  struct
  {
    uint32_t RXINIS:1;                  /**< bit:      0  Received IN Data Interrupt Set                */
    uint32_t TXOUTIS:1;                 /**< bit:      1  Transmitted OUT Data Interrupt Set            */
    uint32_t TXSTPIS:1;                 /**< bit:      2  Transmitted SETUP Interrupt Set               */
    uint32_t PERRIS:1;                  /**< bit:      3  Pipe Error Interrupt Set                      */
    uint32_t NAKEDIS:1;                 /**< bit:      4  NAKed Interrupt Set                           */
    uint32_t OVERFIS:1;                 /**< bit:      5  Overflow Interrupt Set                        */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t SHORTPACKETIS:1;           /**< bit:      7  Short Packet Interrupt Set                    */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t NBUSYBKS:1;                /**< bit:     12  Number of Busy Banks Set                      */
    uint32_t :19;                       /**< bit: 13..31  Reserved                                      */
  };
  struct
  { // Control, Interrupt and Bulk Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t RXSTALLDIS:1;              /**< bit:      6  Received STALLed Interrupt Set                */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  struct
  { // Interrupt and Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFIS:1;                /**< bit:      2  Underflow Interrupt Set                       */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t CRCERRIS:1;                /**< bit:      6  CRC Error Interrupt Set                       */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIPIFR_bits_t;

#define USBHS_HSTPIPIFR_RXINIS_Pos            (0)                                            /**< (USBHS_HSTPIPIFR) Received IN Data Interrupt Set Position */
#define USBHS_HSTPIPIFR_RXINIS_Msk            (0x1U << USBHS_HSTPIPIFR_RXINIS_Pos)           /**< (USBHS_HSTPIPIFR) Received IN Data Interrupt Set Mask */
#define USBHS_HSTPIPIFR_TXOUTIS_Pos           (1)                                            /**< (USBHS_HSTPIPIFR) Transmitted OUT Data Interrupt Set Position */
#define USBHS_HSTPIPIFR_TXOUTIS_Msk           (0x1U << USBHS_HSTPIPIFR_TXOUTIS_Pos)          /**< (USBHS_HSTPIPIFR) Transmitted OUT Data Interrupt Set Mask */
#define USBHS_HSTPIPIFR_TXSTPIS_Pos           (2)                                            /**< (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Position */
#define USBHS_HSTPIPIFR_TXSTPIS_Msk           (0x1U << USBHS_HSTPIPIFR_TXSTPIS_Pos)          /**< (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Mask */
#define USBHS_HSTPIPIFR_PERRIS_Pos            (3)                                            /**< (USBHS_HSTPIPIFR) Pipe Error Interrupt Set Position */
#define USBHS_HSTPIPIFR_PERRIS_Msk            (0x1U << USBHS_HSTPIPIFR_PERRIS_Pos)           /**< (USBHS_HSTPIPIFR) Pipe Error Interrupt Set Mask */
#define USBHS_HSTPIPIFR_NAKEDIS_Pos           (4)                                            /**< (USBHS_HSTPIPIFR) NAKed Interrupt Set Position */
#define USBHS_HSTPIPIFR_NAKEDIS_Msk           (0x1U << USBHS_HSTPIPIFR_NAKEDIS_Pos)          /**< (USBHS_HSTPIPIFR) NAKed Interrupt Set Mask */
#define USBHS_HSTPIPIFR_OVERFIS_Pos           (5)                                            /**< (USBHS_HSTPIPIFR) Overflow Interrupt Set Position */
#define USBHS_HSTPIPIFR_OVERFIS_Msk           (0x1U << USBHS_HSTPIPIFR_OVERFIS_Pos)          /**< (USBHS_HSTPIPIFR) Overflow Interrupt Set Mask */
#define USBHS_HSTPIPIFR_SHORTPACKETIS_Pos     (7)                                            /**< (USBHS_HSTPIPIFR) Short Packet Interrupt Set Position */
#define USBHS_HSTPIPIFR_SHORTPACKETIS_Msk     (0x1U << USBHS_HSTPIPIFR_SHORTPACKETIS_Pos)    /**< (USBHS_HSTPIPIFR) Short Packet Interrupt Set Mask */
#define USBHS_HSTPIPIFR_NBUSYBKS_Pos          (12)                                           /**< (USBHS_HSTPIPIFR) Number of Busy Banks Set Position */
#define USBHS_HSTPIPIFR_NBUSYBKS_Msk          (0x1U << USBHS_HSTPIPIFR_NBUSYBKS_Pos)         /**< (USBHS_HSTPIPIFR) Number of Busy Banks Set Mask */
/* Control, Interrupt and Bulk Endpoints mode */
#define USBHS_HSTPIPIFR_RXSTALLDIS_Pos        (6)                                            /**< (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Position */
#define USBHS_HSTPIPIFR_RXSTALLDIS_Msk        (0x1U << USBHS_HSTPIPIFR_RXSTALLDIS_Pos)       /**< (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Mask */
/* Interrupt and Isochronous Endpoints mode */
#define USBHS_HSTPIPIFR_UNDERFIS_Pos          (2)                                            /**< (USBHS_HSTPIPIFR) Underflow Interrupt Set Position */
#define USBHS_HSTPIPIFR_UNDERFIS_Msk          (0x1U << USBHS_HSTPIPIFR_UNDERFIS_Pos)         /**< (USBHS_HSTPIPIFR) Underflow Interrupt Set Mask */
/* Isochronous Endpoints mode */
#define USBHS_HSTPIPIFR_CRCERRIS_Pos          (6)                                            /**< (USBHS_HSTPIPIFR) CRC Error Interrupt Set Position */
#define USBHS_HSTPIPIFR_CRCERRIS_Msk          (0x1U << USBHS_HSTPIPIFR_CRCERRIS_Pos)         /**< (USBHS_HSTPIPIFR) CRC Error Interrupt Set Mask */

/* -------- USBHS_HSTPIPIMR : (USBHS Offset: 0x5c0) (R/ 32) Host Pipe Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t RXINE:1;                   /**< bit:      0  Received IN Data Interrupt Enable             */
    uint32_t TXOUTE:1;                  /**< bit:      1  Transmitted OUT Data Interrupt Enable         */
    uint32_t TXSTPE:1;                  /**< bit:      2  Transmitted SETUP Interrupt Enable            */
    uint32_t PERRE:1;                   /**< bit:      3  Pipe Error Interrupt Enable                   */
    uint32_t NAKEDE:1;                  /**< bit:      4  NAKed Interrupt Enable                        */
    uint32_t OVERFIE:1;                 /**< bit:      5  Overflow Interrupt Enable                     */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t SHORTPACKETIE:1;           /**< bit:      7  Short Packet Interrupt Enable                 */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t NBUSYBKE:1;                /**< bit:     12  Number of Busy Banks Interrupt Enable         */
    uint32_t :1;                        /**< bit:     13  Reserved                                      */
    uint32_t FIFOCON:1;                 /**< bit:     14  FIFO Control                                  */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t PDISHDMA:1;                /**< bit:     16  Pipe Interrupts Disable HDMA Request Enable   */
    uint32_t PFREEZE:1;                 /**< bit:     17  Pipe Freeze                                   */
    uint32_t RSTDT:1;                   /**< bit:     18  Reset Data Toggle                             */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  struct
  { // Control, Interrupt and Bulk Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t RXSTALLDE:1;               /**< bit:      6  Received STALLed Interrupt Enable             */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  struct
  { // Interrupt and Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFIE:1;                /**< bit:      2  Underflow Interrupt Enable                    */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t CRCERRE:1;                 /**< bit:      6  CRC Error Interrupt Enable                    */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIPIMR_bits_t;

#define USBHS_HSTPIPIMR_RXINE_Pos             (0)                                            /**< (USBHS_HSTPIPIMR) Received IN Data Interrupt Enable Position */
#define USBHS_HSTPIPIMR_RXINE_Msk             (0x1U << USBHS_HSTPIPIMR_RXINE_Pos)            /**< (USBHS_HSTPIPIMR) Received IN Data Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_TXOUTE_Pos            (1)                                            /**< (USBHS_HSTPIPIMR) Transmitted OUT Data Interrupt Enable Position */
#define USBHS_HSTPIPIMR_TXOUTE_Msk            (0x1U << USBHS_HSTPIPIMR_TXOUTE_Pos)           /**< (USBHS_HSTPIPIMR) Transmitted OUT Data Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_TXSTPE_Pos            (2)                                            /**< (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIMR_TXSTPE_Msk            (0x1U << USBHS_HSTPIPIMR_TXSTPE_Pos)           /**< (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_PERRE_Pos             (3)                                            /**< (USBHS_HSTPIPIMR) Pipe Error Interrupt Enable Position */
#define USBHS_HSTPIPIMR_PERRE_Msk             (0x1U << USBHS_HSTPIPIMR_PERRE_Pos)            /**< (USBHS_HSTPIPIMR) Pipe Error Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_NAKEDE_Pos            (4)                                            /**< (USBHS_HSTPIPIMR) NAKed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_NAKEDE_Msk            (0x1U << USBHS_HSTPIPIMR_NAKEDE_Pos)           /**< (USBHS_HSTPIPIMR) NAKed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_OVERFIE_Pos           (5)                                            /**< (USBHS_HSTPIPIMR) Overflow Interrupt Enable Position */
#define USBHS_HSTPIPIMR_OVERFIE_Msk           (0x1U << USBHS_HSTPIPIMR_OVERFIE_Pos)          /**< (USBHS_HSTPIPIMR) Overflow Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_SHORTPACKETIE_Pos     (7)                                            /**< (USBHS_HSTPIPIMR) Short Packet Interrupt Enable Position */
#define USBHS_HSTPIPIMR_SHORTPACKETIE_Msk     (0x1U << USBHS_HSTPIPIMR_SHORTPACKETIE_Pos)    /**< (USBHS_HSTPIPIMR) Short Packet Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_NBUSYBKE_Pos          (12)                                           /**< (USBHS_HSTPIPIMR) Number of Busy Banks Interrupt Enable Position */
#define USBHS_HSTPIPIMR_NBUSYBKE_Msk          (0x1U << USBHS_HSTPIPIMR_NBUSYBKE_Pos)         /**< (USBHS_HSTPIPIMR) Number of Busy Banks Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_FIFOCON_Pos           (14)                                           /**< (USBHS_HSTPIPIMR) FIFO Control Position */
#define USBHS_HSTPIPIMR_FIFOCON_Msk           (0x1U << USBHS_HSTPIPIMR_FIFOCON_Pos)          /**< (USBHS_HSTPIPIMR) FIFO Control Mask */
#define USBHS_HSTPIPIMR_PDISHDMA_Pos          (16)                                           /**< (USBHS_HSTPIPIMR) Pipe Interrupts Disable HDMA Request Enable Position */
#define USBHS_HSTPIPIMR_PDISHDMA_Msk          (0x1U << USBHS_HSTPIPIMR_PDISHDMA_Pos)         /**< (USBHS_HSTPIPIMR) Pipe Interrupts Disable HDMA Request Enable Mask */
#define USBHS_HSTPIPIMR_PFREEZE_Pos           (17)                                           /**< (USBHS_HSTPIPIMR) Pipe Freeze Position */
#define USBHS_HSTPIPIMR_PFREEZE_Msk           (0x1U << USBHS_HSTPIPIMR_PFREEZE_Pos)          /**< (USBHS_HSTPIPIMR) Pipe Freeze Mask */
#define USBHS_HSTPIPIMR_RSTDT_Pos             (18)                                           /**< (USBHS_HSTPIPIMR) Reset Data Toggle Position */
#define USBHS_HSTPIPIMR_RSTDT_Msk             (0x1U << USBHS_HSTPIPIMR_RSTDT_Pos)            /**< (USBHS_HSTPIPIMR) Reset Data Toggle Mask */
/* Control, Interrupt and Bulk Endpoints mode */
#define USBHS_HSTPIPIMR_RXSTALLDE_Pos         (6)                                            /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_RXSTALLDE_Msk         (0x1U << USBHS_HSTPIPIMR_RXSTALLDE_Pos)        /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Mask */
/* Interrupt and Isochronous Endpoints mode */
#define USBHS_HSTPIPIMR_UNDERFIE_Pos          (2)                                            /**< (USBHS_HSTPIPIMR) Underflow Interrupt Enable Position */
#define USBHS_HSTPIPIMR_UNDERFIE_Msk          (0x1U << USBHS_HSTPIPIMR_UNDERFIE_Pos)         /**< (USBHS_HSTPIPIMR) Underflow Interrupt Enable Mask */
/* Isochronous Endpoints mode */
#define USBHS_HSTPIPIMR_CRCERRE_Pos           (6)                                            /**< (USBHS_HSTPIPIMR) CRC Error Interrupt Enable Position */
#define USBHS_HSTPIPIMR_CRCERRE_Msk           (0x1U << USBHS_HSTPIPIMR_CRCERRE_Pos)          /**< (USBHS_HSTPIPIMR) CRC Error Interrupt Enable Mask */

/* -------- USBHS_HSTPIPIER : (USBHS Offset: 0x5f0) (/W 32) Host Pipe Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t RXINES:1;                  /**< bit:      0  Received IN Data Interrupt Enable             */
    uint32_t TXOUTES:1;                 /**< bit:      1  Transmitted OUT Data Interrupt Enable         */
    uint32_t TXSTPES:1;                 /**< bit:      2  Transmitted SETUP Interrupt Enable            */
    uint32_t PERRES:1;                  /**< bit:      3  Pipe Error Interrupt Enable                   */
    uint32_t NAKEDES:1;                 /**< bit:      4  NAKed Interrupt Enable                        */
    uint32_t OVERFIES:1;                /**< bit:      5  Overflow Interrupt Enable                     */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t SHORTPACKETIES:1;          /**< bit:      7  Short Packet Interrupt Enable                 */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t NBUSYBKES:1;               /**< bit:     12  Number of Busy Banks Enable                   */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t PDISHDMAS:1;               /**< bit:     16  Pipe Interrupts Disable HDMA Request Enable   */
    uint32_t PFREEZES:1;                /**< bit:     17  Pipe Freeze Enable                            */
    uint32_t RSTDTS:1;                  /**< bit:     18  Reset Data Toggle Enable                      */
    uint32_t :13;                       /**< bit: 19..31  Reserved                                      */
  };
  struct
  { // Control, Interrupt and Bulk Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t RXSTALLDES:1;              /**< bit:      6  Received STALLed Interrupt Enable             */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  struct
  { // Interrupt and Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFIES:1;               /**< bit:      2  Underflow Interrupt Enable                    */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t CRCERRES:1;                /**< bit:      6  CRC Error Interrupt Enable                    */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIPIER_bits_t;

#define USBHS_HSTPIPIER_RXINES_Pos            (0)                                            /**< (USBHS_HSTPIPIER) Received IN Data Interrupt Enable Position */
#define USBHS_HSTPIPIER_RXINES_Msk            (0x1U << USBHS_HSTPIPIER_RXINES_Pos)           /**< (USBHS_HSTPIPIER) Received IN Data Interrupt Enable Mask */
#define USBHS_HSTPIPIER_TXOUTES_Pos           (1)                                            /**< (USBHS_HSTPIPIER) Transmitted OUT Data Interrupt Enable Position */
#define USBHS_HSTPIPIER_TXOUTES_Msk           (0x1U << USBHS_HSTPIPIER_TXOUTES_Pos)          /**< (USBHS_HSTPIPIER) Transmitted OUT Data Interrupt Enable Mask */
#define USBHS_HSTPIPIER_TXSTPES_Pos           (2)                                            /**< (USBHS_HSTPIPIER) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIER_TXSTPES_Msk           (0x1U << USBHS_HSTPIPIER_TXSTPES_Pos)          /**< (USBHS_HSTPIPIER) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIER_PERRES_Pos            (3)                                            /**< (USBHS_HSTPIPIER) Pipe Error Interrupt Enable Position */
#define USBHS_HSTPIPIER_PERRES_Msk            (0x1U << USBHS_HSTPIPIER_PERRES_Pos)           /**< (USBHS_HSTPIPIER) Pipe Error Interrupt Enable Mask */
#define USBHS_HSTPIPIER_NAKEDES_Pos           (4)                                            /**< (USBHS_HSTPIPIER) NAKed Interrupt Enable Position */
#define USBHS_HSTPIPIER_NAKEDES_Msk           (0x1U << USBHS_HSTPIPIER_NAKEDES_Pos)          /**< (USBHS_HSTPIPIER) NAKed Interrupt Enable Mask */
#define USBHS_HSTPIPIER_OVERFIES_Pos          (5)                                            /**< (USBHS_HSTPIPIER) Overflow Interrupt Enable Position */
#define USBHS_HSTPIPIER_OVERFIES_Msk          (0x1U << USBHS_HSTPIPIER_OVERFIES_Pos)         /**< (USBHS_HSTPIPIER) Overflow Interrupt Enable Mask */
#define USBHS_HSTPIPIER_SHORTPACKETIES_Pos    (7)                                            /**< (USBHS_HSTPIPIER) Short Packet Interrupt Enable Position */
#define USBHS_HSTPIPIER_SHORTPACKETIES_Msk    (0x1U << USBHS_HSTPIPIER_SHORTPACKETIES_Pos)   /**< (USBHS_HSTPIPIER) Short Packet Interrupt Enable Mask */
#define USBHS_HSTPIPIER_NBUSYBKES_Pos         (12)                                           /**< (USBHS_HSTPIPIER) Number of Busy Banks Enable Position */
#define USBHS_HSTPIPIER_NBUSYBKES_Msk         (0x1U << USBHS_HSTPIPIER_NBUSYBKES_Pos)        /**< (USBHS_HSTPIPIER) Number of Busy Banks Enable Mask */
#define USBHS_HSTPIPIER_PDISHDMAS_Pos         (16)                                           /**< (USBHS_HSTPIPIER) Pipe Interrupts Disable HDMA Request Enable Position */
#define USBHS_HSTPIPIER_PDISHDMAS_Msk         (0x1U << USBHS_HSTPIPIER_PDISHDMAS_Pos)        /**< (USBHS_HSTPIPIER) Pipe Interrupts Disable HDMA Request Enable Mask */
#define USBHS_HSTPIPIER_PFREEZES_Pos          (17)                                           /**< (USBHS_HSTPIPIER) Pipe Freeze Enable Position */
#define USBHS_HSTPIPIER_PFREEZES_Msk          (0x1U << USBHS_HSTPIPIER_PFREEZES_Pos)         /**< (USBHS_HSTPIPIER) Pipe Freeze Enable Mask */
#define USBHS_HSTPIPIER_RSTDTS_Pos            (18)                                           /**< (USBHS_HSTPIPIER) Reset Data Toggle Enable Position */
#define USBHS_HSTPIPIER_RSTDTS_Msk            (0x1U << USBHS_HSTPIPIER_RSTDTS_Pos)           /**< (USBHS_HSTPIPIER) Reset Data Toggle Enable Mask */
/* Control, Interrupt and Bulk Endpoints mode */
#define USBHS_HSTPIPIER_RXSTALLDES_Pos        (6)                                            /**< (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIER_RXSTALLDES_Msk        (0x1U << USBHS_HSTPIPIER_RXSTALLDES_Pos)       /**< (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Mask */
/* Interrupt and Isochronous Endpoints mode */
#define USBHS_HSTPIPIER_UNDERFIES_Pos         (2)                                            /**< (USBHS_HSTPIPIER) Underflow Interrupt Enable Position */
#define USBHS_HSTPIPIER_UNDERFIES_Msk         (0x1U << USBHS_HSTPIPIER_UNDERFIES_Pos)        /**< (USBHS_HSTPIPIER) Underflow Interrupt Enable Mask */
/* Isochronous Endpoints mode */
#define USBHS_HSTPIPIER_CRCERRES_Pos          (6)                                            /**< (USBHS_HSTPIPIER) CRC Error Interrupt Enable Position */
#define USBHS_HSTPIPIER_CRCERRES_Msk          (0x1U << USBHS_HSTPIPIER_CRCERRES_Pos)         /**< (USBHS_HSTPIPIER) CRC Error Interrupt Enable Mask */

/* -------- USBHS_HSTPIPIDR : (USBHS Offset: 0x620) (/W 32) Host Pipe Disable Register -------- */

