zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
typedef union
{
  struct
  {
    uint32_t RXINEC:1;                  /**< bit:      0  Received IN Data Interrupt Disable            */
    uint32_t TXOUTEC:1;                 /**< bit:      1  Transmitted OUT Data Interrupt Disable        */
    uint32_t TXSTPEC:1;                 /**< bit:      2  Transmitted SETUP Interrupt Disable           */
    uint32_t PERREC:1;                  /**< bit:      3  Pipe Error Interrupt Disable                  */
    uint32_t NAKEDEC:1;                 /**< bit:      4  NAKed Interrupt Disable                       */
    uint32_t OVERFIEC:1;                /**< bit:      5  Overflow Interrupt Disable                    */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t SHORTPACKETIEC:1;          /**< bit:      7  Short Packet Interrupt Disable                */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t NBUSYBKEC:1;               /**< bit:     12  Number of Busy Banks Disable                  */
    uint32_t :1;                        /**< bit:     13  Reserved                                      */
    uint32_t FIFOCONC:1;                /**< bit:     14  FIFO Control Disable                          */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t PDISHDMAC:1;               /**< bit:     16  Pipe Interrupts Disable HDMA Request Disable  */
    uint32_t PFREEZEC:1;                /**< bit:     17  Pipe Freeze Disable                           */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  struct
  { // Control, Interrupt and Bulk Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t RXSTALLDEC:1;              /**< bit:      6  Received STALLed Interrupt Disable            */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  struct
  { // Interrupt and Isochronous Endpoints mode
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t UNDERFIEC:1;               /**< bit:      2  Underflow Interrupt Disable                   */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  struct
  { // Isochronous Endpoints mode
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t CRCERREC:1;                /**< bit:      6  CRC Error Interrupt Disable                   */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIPIDR_bits_t;

#define USBHS_HSTPIPIDR_RXINEC_Pos            (0)                                            /**< (USBHS_HSTPIPIDR) Received IN Data Interrupt Disable Position */
#define USBHS_HSTPIPIDR_RXINEC_Msk            (0x1U << USBHS_HSTPIPIDR_RXINEC_Pos)           /**< (USBHS_HSTPIPIDR) Received IN Data Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_TXOUTEC_Pos           (1)                                            /**< (USBHS_HSTPIPIDR) Transmitted OUT Data Interrupt Disable Position */
#define USBHS_HSTPIPIDR_TXOUTEC_Msk           (0x1U << USBHS_HSTPIPIDR_TXOUTEC_Pos)          /**< (USBHS_HSTPIPIDR) Transmitted OUT Data Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_TXSTPEC_Pos           (2)                                            /**< (USBHS_HSTPIPIDR) Transmitted SETUP Interrupt Disable Position */
#define USBHS_HSTPIPIDR_TXSTPEC_Msk           (0x1U << USBHS_HSTPIPIDR_TXSTPEC_Pos)          /**< (USBHS_HSTPIPIDR) Transmitted SETUP Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_PERREC_Pos            (3)                                            /**< (USBHS_HSTPIPIDR) Pipe Error Interrupt Disable Position */
#define USBHS_HSTPIPIDR_PERREC_Msk            (0x1U << USBHS_HSTPIPIDR_PERREC_Pos)           /**< (USBHS_HSTPIPIDR) Pipe Error Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_NAKEDEC_Pos           (4)                                            /**< (USBHS_HSTPIPIDR) NAKed Interrupt Disable Position */
#define USBHS_HSTPIPIDR_NAKEDEC_Msk           (0x1U << USBHS_HSTPIPIDR_NAKEDEC_Pos)          /**< (USBHS_HSTPIPIDR) NAKed Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_OVERFIEC_Pos          (5)                                            /**< (USBHS_HSTPIPIDR) Overflow Interrupt Disable Position */
#define USBHS_HSTPIPIDR_OVERFIEC_Msk          (0x1U << USBHS_HSTPIPIDR_OVERFIEC_Pos)         /**< (USBHS_HSTPIPIDR) Overflow Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_SHORTPACKETIEC_Pos    (7)                                            /**< (USBHS_HSTPIPIDR) Short Packet Interrupt Disable Position */
#define USBHS_HSTPIPIDR_SHORTPACKETIEC_Msk    (0x1U << USBHS_HSTPIPIDR_SHORTPACKETIEC_Pos)   /**< (USBHS_HSTPIPIDR) Short Packet Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_NBUSYBKEC_Pos         (12)                                           /**< (USBHS_HSTPIPIDR) Number of Busy Banks Disable Position */
#define USBHS_HSTPIPIDR_NBUSYBKEC_Msk         (0x1U << USBHS_HSTPIPIDR_NBUSYBKEC_Pos)        /**< (USBHS_HSTPIPIDR) Number of Busy Banks Disable Mask */
#define USBHS_HSTPIPIDR_FIFOCONC_Pos          (14)                                           /**< (USBHS_HSTPIPIDR) FIFO Control Disable Position */
#define USBHS_HSTPIPIDR_FIFOCONC_Msk          (0x1U << USBHS_HSTPIPIDR_FIFOCONC_Pos)         /**< (USBHS_HSTPIPIDR) FIFO Control Disable Mask */
#define USBHS_HSTPIPIDR_PDISHDMAC_Pos         (16)                                           /**< (USBHS_HSTPIPIDR) Pipe Interrupts Disable HDMA Request Disable Position */
#define USBHS_HSTPIPIDR_PDISHDMAC_Msk         (0x1U << USBHS_HSTPIPIDR_PDISHDMAC_Pos)        /**< (USBHS_HSTPIPIDR) Pipe Interrupts Disable HDMA Request Disable Mask */
#define USBHS_HSTPIPIDR_PFREEZEC_Pos          (17)                                           /**< (USBHS_HSTPIPIDR) Pipe Freeze Disable Position */
#define USBHS_HSTPIPIDR_PFREEZEC_Msk          (0x1U << USBHS_HSTPIPIDR_PFREEZEC_Pos)         /**< (USBHS_HSTPIPIDR) Pipe Freeze Disable Mask */
/* Control, Interrupt and Bulk Endpoints mode */
#define USBHS_HSTPIPIDR_RXSTALLDEC_Pos        (6)                                            /**< (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Position */
#define USBHS_HSTPIPIDR_RXSTALLDEC_Msk        (0x1U << USBHS_HSTPIPIDR_RXSTALLDEC_Pos)       /**< (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Mask */
/* Interrupt and Isochronous Endpoints mode */
#define USBHS_HSTPIPIDR_UNDERFIEC_Pos         (2)                                            /**< (USBHS_HSTPIPIDR) Underflow Interrupt Disable Position */
#define USBHS_HSTPIPIDR_UNDERFIEC_Msk         (0x1U << USBHS_HSTPIPIDR_UNDERFIEC_Pos)        /**< (USBHS_HSTPIPIDR) Underflow Interrupt Disable Mask */
/* Isochronous Endpoints mode */
#define USBHS_HSTPIPIDR_CRCERREC_Pos          (6)                                            /**< (USBHS_HSTPIPIDR) CRC Error Interrupt Disable Position */
#define USBHS_HSTPIPIDR_CRCERREC_Msk          (0x1U << USBHS_HSTPIPIDR_CRCERREC_Pos)         /**< (USBHS_HSTPIPIDR) CRC Error Interrupt Disable Mask */

/* -------- USBHS_HSTPIPINRQ : (USBHS Offset: 0x650) (R/W 32) Host Pipe IN Request Register -------- */

typedef union
{
  struct
  {
    uint32_t INRQ:8;                    /**< bit:   0..7  IN Request Number before Freeze               */
    uint32_t INMODE:1;                  /**< bit:      8  IN Request Mode                               */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIPINRQ_bits_t;

