zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_HSTPIPINRQ_INRQ_Pos             (0)                                            /**< (USBHS_HSTPIPINRQ) IN Request Number before Freeze Position */
#define USBHS_HSTPIPINRQ_INRQ_Msk             (0xFFU << USBHS_HSTPIPINRQ_INRQ_Pos)           /**< (USBHS_HSTPIPINRQ) IN Request Number before Freeze Mask */
#define USBHS_HSTPIPINRQ_INRQ(value)          (USBHS_HSTPIPINRQ_INRQ_Msk & ((value) << USBHS_HSTPIPINRQ_INRQ_Pos))
#define USBHS_HSTPIPINRQ_INMODE_Pos           (8)                                            /**< (USBHS_HSTPIPINRQ) IN Request Mode Position */
#define USBHS_HSTPIPINRQ_INMODE_Msk           (0x1U << USBHS_HSTPIPINRQ_INMODE_Pos)          /**< (USBHS_HSTPIPINRQ) IN Request Mode Mask */
#define USBHS_HSTPIPINRQ_Msk                  (0x000001FFUL)                                 /**< (USBHS_HSTPIPINRQ) Register Mask  */

/* -------- USBHS_HSTPIPERR : (USBHS Offset: 0x680) (R/W 32) Host Pipe Error Register -------- */

typedef union
{
  struct
  {
    uint32_t DATATGL:1;                 /**< bit:      0  Data Toggle Error                             */
    uint32_t DATAPID:1;                 /**< bit:      1  Data PID Error                                */
    uint32_t PID:1;                     /**< bit:      2  Data PID Error                                */
    uint32_t TIMEOUT:1;                 /**< bit:      3  Time-Out Error                                */
    uint32_t CRC16:1;                   /**< bit:      4  CRC16 Error                                   */
    uint32_t COUNTER:2;                 /**< bit:   5..6  Error Counter                                 */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_HSTPIPERR_bits_t;

#define USBHS_HSTPIPERR_DATATGL_Pos           (0)                                            /**< (USBHS_HSTPIPERR) Data Toggle Error Position */
#define USBHS_HSTPIPERR_DATATGL_Msk           (0x1U << USBHS_HSTPIPERR_DATATGL_Pos)          /**< (USBHS_HSTPIPERR) Data Toggle Error Mask */
#define USBHS_HSTPIPERR_DATAPID_Pos           (1)                                            /**< (USBHS_HSTPIPERR) Data PID Error Position */
#define USBHS_HSTPIPERR_DATAPID_Msk           (0x1U << USBHS_HSTPIPERR_DATAPID_Pos)          /**< (USBHS_HSTPIPERR) Data PID Error Mask */
#define USBHS_HSTPIPERR_PID_Pos               (2)                                            /**< (USBHS_HSTPIPERR) Data PID Error Position */
#define USBHS_HSTPIPERR_PID_Msk               (0x1U << USBHS_HSTPIPERR_PID_Pos)              /**< (USBHS_HSTPIPERR) Data PID Error Mask */
#define USBHS_HSTPIPERR_TIMEOUT_Pos           (3)                                            /**< (USBHS_HSTPIPERR) Time-Out Error Position */
#define USBHS_HSTPIPERR_TIMEOUT_Msk           (0x1U << USBHS_HSTPIPERR_TIMEOUT_Pos)          /**< (USBHS_HSTPIPERR) Time-Out Error Mask */
#define USBHS_HSTPIPERR_CRC16_Pos             (4)                                            /**< (USBHS_HSTPIPERR) CRC16 Error Position */
#define USBHS_HSTPIPERR_CRC16_Msk             (0x1U << USBHS_HSTPIPERR_CRC16_Pos)            /**< (USBHS_HSTPIPERR) CRC16 Error Mask */
#define USBHS_HSTPIPERR_COUNTER_Pos           (5)                                            /**< (USBHS_HSTPIPERR) Error Counter Position */
#define USBHS_HSTPIPERR_COUNTER_Msk           (0x3U << USBHS_HSTPIPERR_COUNTER_Pos)          /**< (USBHS_HSTPIPERR) Error Counter Mask */
#define USBHS_HSTPIPERR_COUNTER(value)        (USBHS_HSTPIPERR_COUNTER_Msk & ((value) << USBHS_HSTPIPERR_COUNTER_Pos))
#define USBHS_HSTPIPERR_Msk                   (0x0000007FUL)                                 /**< (USBHS_HSTPIPERR) Register Mask  */

/* -------- USBHS_CTRL : (USBHS Offset: 0x800) (R/W 32) General Control Register -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t RDERRE:1;                  /**< bit:      4  Remote Device Connection Error Interrupt Enable */
    uint32_t :3;                        /**< bit:   5..7  Reserved                                      */
    uint32_t VBUSHWC:1;                 /**< bit:      8  VBUS Hardware Control                         */
    uint32_t :5;                        /**< bit:  9..13  Reserved                                      */
    uint32_t FRZCLK:1;                  /**< bit:     14  Freeze USB Clock                              */
    uint32_t USBE:1;                    /**< bit:     15  USBHS Enable                                  */
    uint32_t :8;                        /**< bit: 16..23  Reserved                                      */
    uint32_t UID:1;                     /**< bit:     24  UID Pin Enable                                */
    uint32_t UIMOD:1;                   /**< bit:     25  USBHS Mode                                    */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_CTRL_bits_t;

#define USBHS_CTRL_RDERRE_Pos                 (4)                                            /**< (USBHS_CTRL) Remote Device Connection Error Interrupt Enable Position */
#define USBHS_CTRL_RDERRE_Msk                 (0x1U << USBHS_CTRL_RDERRE_Pos)                /**< (USBHS_CTRL) Remote Device Connection Error Interrupt Enable Mask */
#define USBHS_CTRL_VBUSHWC_Pos                (8)                                            /**< (USBHS_CTRL) VBUS Hardware Control Position */
#define USBHS_CTRL_VBUSHWC_Msk                (0x1U << USBHS_CTRL_VBUSHWC_Pos)               /**< (USBHS_CTRL) VBUS Hardware Control Mask */
#define USBHS_CTRL_FRZCLK_Pos                 (14)                                           /**< (USBHS_CTRL) Freeze USB Clock Position */
#define USBHS_CTRL_FRZCLK_Msk                 (0x1U << USBHS_CTRL_FRZCLK_Pos)                /**< (USBHS_CTRL) Freeze USB Clock Mask */
#define USBHS_CTRL_USBE_Pos                   (15)                                           /**< (USBHS_CTRL) USBHS Enable Position */
#define USBHS_CTRL_USBE_Msk                   (0x1U << USBHS_CTRL_USBE_Pos)                  /**< (USBHS_CTRL) USBHS Enable Mask */
#define USBHS_CTRL_UID_Pos                    (24)                                           /**< (USBHS_CTRL) UID Pin Enable Position */
#define USBHS_CTRL_UID_Msk                    (0x1U << USBHS_CTRL_UID_Pos)                   /**< (USBHS_CTRL) UID Pin Enable Mask */
#define USBHS_CTRL_UIMOD_Pos                  (25)                                           /**< (USBHS_CTRL) USBHS Mode Position */
#define USBHS_CTRL_UIMOD_Msk                  (0x1U << USBHS_CTRL_UIMOD_Pos)                 /**< (USBHS_CTRL) USBHS Mode Mask */
#define   USBHS_CTRL_UIMOD_HOST_Val           (0x0U)                                         /**< (USBHS_CTRL) The module is in USB Host mode.  */
#define   USBHS_CTRL_UIMOD_DEVICE_Val         (0x1U)                                         /**< (USBHS_CTRL) The module is in USB Device mode.  */
#define USBHS_CTRL_UIMOD_HOST                 (USBHS_CTRL_UIMOD_HOST_Val << USBHS_CTRL_UIMOD_Pos)  /**< (USBHS_CTRL) The module is in USB Host mode. Position  */
#define USBHS_CTRL_UIMOD_DEVICE               (USBHS_CTRL_UIMOD_DEVICE_Val << USBHS_CTRL_UIMOD_Pos)  /**< (USBHS_CTRL) The module is in USB Device mode. Position  */
#define USBHS_CTRL_Msk                        (0x0300C110UL)                                 /**< (USBHS_CTRL) Register Mask  */

/* -------- USBHS_SR : (USBHS Offset: 0x804) (R/ 32) General Status Register -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t RDERRI:1;                  /**< bit:      4  Remote Device Connection Error Interrupt (Host mode only) */
    uint32_t :7;                        /**< bit:  5..11  Reserved                                      */
    uint32_t SPEED:2;                   /**< bit: 12..13  Speed Status (Device mode only)               */
    uint32_t CLKUSABLE:1;               /**< bit:     14  UTMI Clock Usable                             */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_SR_bits_t;

#define USBHS_SR_RDERRI_Pos                   (4)                                            /**< (USBHS_SR) Remote Device Connection Error Interrupt (Host mode only) Position */
#define USBHS_SR_RDERRI_Msk                   (0x1U << USBHS_SR_RDERRI_Pos)                  /**< (USBHS_SR) Remote Device Connection Error Interrupt (Host mode only) Mask */
#define USBHS_SR_SPEED_Pos                    (12)                                           /**< (USBHS_SR) Speed Status (Device mode only) Position */
#define USBHS_SR_SPEED_Msk                    (0x3U << USBHS_SR_SPEED_Pos)                   /**< (USBHS_SR) Speed Status (Device mode only) Mask */
#define USBHS_SR_SPEED(value)                 (USBHS_SR_SPEED_Msk & ((value) << USBHS_SR_SPEED_Pos))
#define   USBHS_SR_SPEED_FULL_SPEED_Val       (0x0U)                                         /**< (USBHS_SR) Full-Speed mode  */
#define   USBHS_SR_SPEED_HIGH_SPEED_Val       (0x1U)                                         /**< (USBHS_SR) High-Speed mode  */
#define   USBHS_SR_SPEED_LOW_SPEED_Val        (0x2U)                                         /**< (USBHS_SR) Low-Speed mode  */
#define USBHS_SR_SPEED_FULL_SPEED             (USBHS_SR_SPEED_FULL_SPEED_Val << USBHS_SR_SPEED_Pos)  /**< (USBHS_SR) Full-Speed mode Position  */
#define USBHS_SR_SPEED_HIGH_SPEED             (USBHS_SR_SPEED_HIGH_SPEED_Val << USBHS_SR_SPEED_Pos)  /**< (USBHS_SR) High-Speed mode Position  */
#define USBHS_SR_SPEED_LOW_SPEED              (USBHS_SR_SPEED_LOW_SPEED_Val << USBHS_SR_SPEED_Pos)  /**< (USBHS_SR) Low-Speed mode Position  */
#define USBHS_SR_CLKUSABLE_Pos                (14)                                           /**< (USBHS_SR) UTMI Clock Usable Position */
#define USBHS_SR_CLKUSABLE_Msk                (0x1U << USBHS_SR_CLKUSABLE_Pos)               /**< (USBHS_SR) UTMI Clock Usable Mask */
#define USBHS_SR_Msk                          (0x00007010UL)                                 /**< (USBHS_SR) Register Mask  */

/* -------- USBHS_SCR : (USBHS Offset: 0x808) (/W 32) General Status Clear Register -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t RDERRIC:1;                 /**< bit:      4  Remote Device Connection Error Interrupt Clear */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_SCR_bits_t;

#define USBHS_SCR_RDERRIC_Pos                 (4)                                            /**< (USBHS_SCR) Remote Device Connection Error Interrupt Clear Position */
#define USBHS_SCR_RDERRIC_Msk                 (0x1U << USBHS_SCR_RDERRIC_Pos)                /**< (USBHS_SCR) Remote Device Connection Error Interrupt Clear Mask */
#define USBHS_SCR_Msk                         (0x00000010UL)                                 /**< (USBHS_SCR) Register Mask  */

/* -------- USBHS_SFR : (USBHS Offset: 0x80c) (/W 32) General Status Set Register -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t RDERRIS:1;                 /**< bit:      4  Remote Device Connection Error Interrupt Set  */
    uint32_t :4;                        /**< bit:   5..8  Reserved                                      */
    uint32_t VBUSRQS:1;                 /**< bit:      9  VBUS Request Set                              */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_SFR_bits_t;

#define USBHS_SFR_RDERRIS_Pos                 (4)                                            /**< (USBHS_SFR) Remote Device Connection Error Interrupt Set Position */
#define USBHS_SFR_RDERRIS_Msk                 (0x1U << USBHS_SFR_RDERRIS_Pos)                /**< (USBHS_SFR) Remote Device Connection Error Interrupt Set Mask */
#define USBHS_SFR_VBUSRQS_Pos                 (9)                                            /**< (USBHS_SFR) VBUS Request Set Position */
#define USBHS_SFR_VBUSRQS_Msk                 (0x1U << USBHS_SFR_VBUSRQS_Pos)                /**< (USBHS_SFR) VBUS Request Set Mask */
#define USBHS_SFR_Msk                         (0x00000210UL)                                 /**< (USBHS_SFR) Register Mask  */

