zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
/* -------- USBHS_TSTA1 : (USBHS Offset: 0x810) (R/W 32) General Test A1 Register -------- */

typedef union
{
  struct
  {
    uint32_t CounterA:15;               /**< bit:  0..14  Counter A                                     */
    uint32_t LoadCntA:1;                /**< bit:     15  Load CounterA                                 */
    uint32_t CounterB:6;                /**< bit: 16..21  Counter B                                     */
    uint32_t :1;                        /**< bit:     22  Reserved                                      */
    uint32_t LoadCntB:1;                /**< bit:     23  Load CounterB                                 */
    uint32_t SOFCntMa1:7;               /**< bit: 24..30  SOF Counter Max                               */
    uint32_t LoadSOFCnt:1;              /**< bit:     31  Load SOF Counter                              */
  };
  uint32_t w;
} __USBHS_TSTA1_bits_t;

#define USBHS_TSTA1_CounterA_Pos              (0)                                            /**< (USBHS_TSTA1) Counter A Position */
#define USBHS_TSTA1_CounterA_Msk              (0x7FFFU << USBHS_TSTA1_CounterA_Pos)          /**< (USBHS_TSTA1) Counter A Mask */
#define USBHS_TSTA1_CounterA(value)           (USBHS_TSTA1_CounterA_Msk & ((value) << USBHS_TSTA1_CounterA_Pos))
#define USBHS_TSTA1_LoadCntA_Pos              (15)                                           /**< (USBHS_TSTA1) Load CounterA Position */
#define USBHS_TSTA1_LoadCntA_Msk              (0x1U << USBHS_TSTA1_LoadCntA_Pos)             /**< (USBHS_TSTA1) Load CounterA Mask */
#define USBHS_TSTA1_CounterB_Pos              (16)                                           /**< (USBHS_TSTA1) Counter B Position */
#define USBHS_TSTA1_CounterB_Msk              (0x3FU << USBHS_TSTA1_CounterB_Pos)            /**< (USBHS_TSTA1) Counter B Mask */
#define USBHS_TSTA1_CounterB(value)           (USBHS_TSTA1_CounterB_Msk & ((value) << USBHS_TSTA1_CounterB_Pos))
#define USBHS_TSTA1_LoadCntB_Pos              (23)                                           /**< (USBHS_TSTA1) Load CounterB Position */
#define USBHS_TSTA1_LoadCntB_Msk              (0x1U << USBHS_TSTA1_LoadCntB_Pos)             /**< (USBHS_TSTA1) Load CounterB Mask */
#define USBHS_TSTA1_SOFCntMa1_Pos             (24)                                           /**< (USBHS_TSTA1) SOF Counter Max Position */
#define USBHS_TSTA1_SOFCntMa1_Msk             (0x7FU << USBHS_TSTA1_SOFCntMa1_Pos)           /**< (USBHS_TSTA1) SOF Counter Max Mask */
#define USBHS_TSTA1_SOFCntMa1(value)          (USBHS_TSTA1_SOFCntMa1_Msk & ((value) << USBHS_TSTA1_SOFCntMa1_Pos))
#define USBHS_TSTA1_LoadSOFCnt_Pos            (31)                                           /**< (USBHS_TSTA1) Load SOF Counter Position */
#define USBHS_TSTA1_LoadSOFCnt_Msk            (0x1U << USBHS_TSTA1_LoadSOFCnt_Pos)           /**< (USBHS_TSTA1) Load SOF Counter Mask */
#define USBHS_TSTA1_Msk                       (0xFFBFFFFFUL)                                 /**< (USBHS_TSTA1) Register Mask  */

/* -------- USBHS_TSTA2 : (USBHS Offset: 0x814) (R/W 32) General Test A2 Register -------- */

typedef union
{
  struct
  {
    uint32_t FullDetachEn:1;            /**< bit:      0  Full Detach Enable                            */
    uint32_t HSSerialMode:1;            /**< bit:      1  HS Serial Mode                                */
    uint32_t LoopBackMode:1;            /**< bit:      2  Loop-back Mode                                */
    uint32_t DisableGatedClock:1;       /**< bit:      3  Disable Gated Clock                           */
    uint32_t ForceSuspendMTo1:1;        /**< bit:      4  Force SuspendM to 1                           */
    uint32_t ByPassDpll:1;              /**< bit:      5  Bypass DPLL                                   */
    uint32_t HostHSDisconnectDisable:1;  /**< bit:      6  Host HS Disconnect Disable                    */
    uint32_t ForceHSRst_50ms:1;         /**< bit:      7  Force HS Reset to 50 ms                       */
    uint32_t :1;                        /**< bit:      8  Reserved                                      */
    uint32_t RemovePUWhenTX:1;          /**< bit:      9  Remove Pull-up When TX                        */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_TSTA2_bits_t;

#define USBHS_TSTA2_FullDetachEn_Pos          (0)                                            /**< (USBHS_TSTA2) Full Detach Enable Position */
#define USBHS_TSTA2_FullDetachEn_Msk          (0x1U << USBHS_TSTA2_FullDetachEn_Pos)         /**< (USBHS_TSTA2) Full Detach Enable Mask */
#define USBHS_TSTA2_HSSerialMode_Pos          (1)                                            /**< (USBHS_TSTA2) HS Serial Mode Position */
#define USBHS_TSTA2_HSSerialMode_Msk          (0x1U << USBHS_TSTA2_HSSerialMode_Pos)         /**< (USBHS_TSTA2) HS Serial Mode Mask */
#define USBHS_TSTA2_LoopBackMode_Pos          (2)                                            /**< (USBHS_TSTA2) Loop-back Mode Position */
#define USBHS_TSTA2_LoopBackMode_Msk          (0x1U << USBHS_TSTA2_LoopBackMode_Pos)         /**< (USBHS_TSTA2) Loop-back Mode Mask */
#define USBHS_TSTA2_DisableGatedClock_Pos     (3)                                            /**< (USBHS_TSTA2) Disable Gated Clock Position */
#define USBHS_TSTA2_DisableGatedClock_Msk     (0x1U << USBHS_TSTA2_DisableGatedClock_Pos)    /**< (USBHS_TSTA2) Disable Gated Clock Mask */
#define USBHS_TSTA2_ForceSuspendMTo1_Pos      (4)                                            /**< (USBHS_TSTA2) Force SuspendM to 1 Position */
#define USBHS_TSTA2_ForceSuspendMTo1_Msk      (0x1U << USBHS_TSTA2_ForceSuspendMTo1_Pos)     /**< (USBHS_TSTA2) Force SuspendM to 1 Mask */
#define USBHS_TSTA2_ByPassDpll_Pos            (5)                                            /**< (USBHS_TSTA2) Bypass DPLL Position */
#define USBHS_TSTA2_ByPassDpll_Msk            (0x1U << USBHS_TSTA2_ByPassDpll_Pos)           /**< (USBHS_TSTA2) Bypass DPLL Mask */
#define USBHS_TSTA2_HostHSDisconnectDisable_Pos (6)                                            /**< (USBHS_TSTA2) Host HS Disconnect Disable Position */
#define USBHS_TSTA2_HostHSDisconnectDisable_Msk (0x1U << USBHS_TSTA2_HostHSDisconnectDisable_Pos)  /**< (USBHS_TSTA2) Host HS Disconnect Disable Mask */
#define USBHS_TSTA2_ForceHSRst_50ms_Pos       (7)                                            /**< (USBHS_TSTA2) Force HS Reset to 50 ms Position */
#define USBHS_TSTA2_ForceHSRst_50ms_Msk       (0x1U << USBHS_TSTA2_ForceHSRst_50ms_Pos)      /**< (USBHS_TSTA2) Force HS Reset to 50 ms Mask */
#define USBHS_TSTA2_RemovePUWhenTX_Pos        (9)                                            /**< (USBHS_TSTA2) Remove Pull-up When TX Position */
#define USBHS_TSTA2_RemovePUWhenTX_Msk        (0x1U << USBHS_TSTA2_RemovePUWhenTX_Pos)       /**< (USBHS_TSTA2) Remove Pull-up When TX Mask */
#define USBHS_TSTA2_Msk                       (0x000002FFUL)                                 /**< (USBHS_TSTA2) Register Mask  */

/* -------- USBHS_FSM : (USBHS Offset: 0x82c) (R/ 32) General Finite State Machine Register -------- */

typedef union
{
  struct
  {
    uint32_t DRDSTATE:4;                /**< bit:   0..3  Dual Role Device State                        */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __USBHS_FSM_bits_t;

