zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/usbhs.h
#define USBHS_FSM_DRDSTATE_Pos                (0)                                            /**< (USBHS_FSM) Dual Role Device State Position */
#define USBHS_FSM_DRDSTATE_Msk                (0xFU << USBHS_FSM_DRDSTATE_Pos)               /**< (USBHS_FSM) Dual Role Device State Mask */
#define USBHS_FSM_DRDSTATE(value)             (USBHS_FSM_DRDSTATE_Msk & ((value) << USBHS_FSM_DRDSTATE_Pos))
#define   USBHS_FSM_DRDSTATE_A_IDLESTATE_Val  (0x0U)                                         /**< (USBHS_FSM) This is the start state for A-devices (when the ID pin is 0)  */
#define   USBHS_FSM_DRDSTATE_A_WAIT_VRISE_Val (0x1U)                                         /**< (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V).  */
#define   USBHS_FSM_DRDSTATE_A_WAIT_BCON_Val  (0x2U)                                         /**< (USBHS_FSM) In this state, the A-device waits for the B-device to signal a connection.  */
#define   USBHS_FSM_DRDSTATE_A_HOST_Val       (0x3U)                                         /**< (USBHS_FSM) In this state, the A-device that operates in Host mode is operational.  */
#define   USBHS_FSM_DRDSTATE_A_SUSPEND_Val    (0x4U)                                         /**< (USBHS_FSM) The A-device operating as a host is in the Suspend mode.  */
#define   USBHS_FSM_DRDSTATE_A_PERIPHERAL_Val (0x5U)                                         /**< (USBHS_FSM) The A-device operates as a peripheral.  */
#define   USBHS_FSM_DRDSTATE_A_WAIT_VFALL_Val (0x6U)                                         /**< (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V).  */
#define   USBHS_FSM_DRDSTATE_A_VBUS_ERR_Val   (0x7U)                                         /**< (USBHS_FSM) In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state.  */
#define   USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE_Val (0x8U)                                         /**< (USBHS_FSM) In this state, the A-device waits for the data USB line to discharge (100 us).  */
#define   USBHS_FSM_DRDSTATE_B_IDLE_Val       (0x9U)                                         /**< (USBHS_FSM) This is the start state for B-device (when the ID pin is 1).  */
#define   USBHS_FSM_DRDSTATE_B_PERIPHERAL_Val (0xAU)                                         /**< (USBHS_FSM) In this state, the B-device acts as the peripheral.  */
#define   USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP_Val (0xBU)                                         /**< (USBHS_FSM) In this state, the B-device is in Suspend mode and waits until 3 ms before initiating the HNP protocol if requested.  */
#define   USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE_Val (0xCU)                                         /**< (USBHS_FSM) In this state, the B-device waits for the data USB line to discharge (100 us)) before becoming Host.  */
#define   USBHS_FSM_DRDSTATE_B_WAIT_ACON_Val  (0xDU)                                         /**< (USBHS_FSM) In this state, the B-device waits for the A-device to signal a connect before becoming B-Host.  */
#define   USBHS_FSM_DRDSTATE_B_HOST_Val       (0xEU)                                         /**< (USBHS_FSM) In this state, the B-device acts as the Host.  */
#define   USBHS_FSM_DRDSTATE_B_SRP_INIT_Val   (0xFU)                                         /**< (USBHS_FSM) In this state, the B-device attempts to start a session using the SRP protocol.  */
#define USBHS_FSM_DRDSTATE_A_IDLESTATE        (USBHS_FSM_DRDSTATE_A_IDLESTATE_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) This is the start state for A-devices (when the ID pin is 0) Position  */
#define USBHS_FSM_DRDSTATE_A_WAIT_VRISE       (USBHS_FSM_DRDSTATE_A_WAIT_VRISE_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V). Position  */
#define USBHS_FSM_DRDSTATE_A_WAIT_BCON        (USBHS_FSM_DRDSTATE_A_WAIT_BCON_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the A-device waits for the B-device to signal a connection. Position  */
#define USBHS_FSM_DRDSTATE_A_HOST             (USBHS_FSM_DRDSTATE_A_HOST_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the A-device that operates in Host mode is operational. Position  */
#define USBHS_FSM_DRDSTATE_A_SUSPEND          (USBHS_FSM_DRDSTATE_A_SUSPEND_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) The A-device operating as a host is in the Suspend mode. Position  */
#define USBHS_FSM_DRDSTATE_A_PERIPHERAL       (USBHS_FSM_DRDSTATE_A_PERIPHERAL_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) The A-device operates as a peripheral. Position  */
#define USBHS_FSM_DRDSTATE_A_WAIT_VFALL       (USBHS_FSM_DRDSTATE_A_WAIT_VFALL_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V). Position  */
#define USBHS_FSM_DRDSTATE_A_VBUS_ERR         (USBHS_FSM_DRDSTATE_A_VBUS_ERR_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state. Position  */
#define USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE   (USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the A-device waits for the data USB line to discharge (100 us). Position  */
#define USBHS_FSM_DRDSTATE_B_IDLE             (USBHS_FSM_DRDSTATE_B_IDLE_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) This is the start state for B-device (when the ID pin is 1). Position  */
#define USBHS_FSM_DRDSTATE_B_PERIPHERAL       (USBHS_FSM_DRDSTATE_B_PERIPHERAL_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the B-device acts as the peripheral. Position  */
#define USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP   (USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the B-device is in Suspend mode and waits until 3 ms before initiating the HNP protocol if requested. Position  */
#define USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE   (USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the B-device waits for the data USB line to discharge (100 us)) before becoming Host. Position  */
#define USBHS_FSM_DRDSTATE_B_WAIT_ACON        (USBHS_FSM_DRDSTATE_B_WAIT_ACON_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the B-device waits for the A-device to signal a connect before becoming B-Host. Position  */
#define USBHS_FSM_DRDSTATE_B_HOST             (USBHS_FSM_DRDSTATE_B_HOST_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the B-device acts as the Host. Position  */
#define USBHS_FSM_DRDSTATE_B_SRP_INIT         (USBHS_FSM_DRDSTATE_B_SRP_INIT_Val << USBHS_FSM_DRDSTATE_Pos)  /**< (USBHS_FSM) In this state, the B-device attempts to start a session using the SRP protocol. Position  */
#define USBHS_FSM_Msk                         (0x0000000FUL)                                 /**< (USBHS_FSM) Register Mask  */

/** \brief USBHS_DEVDMA register offsets definitions */
#define USBHS_DEVDMANXTDSC_OFFSET    (0x00)         /**< (USBHS_DEVDMANXTDSC) Device DMA Channel Next Descriptor Address Register (n = 1) Offset */
#define USBHS_DEVDMAADDRESS_OFFSET   (0x04)         /**< (USBHS_DEVDMAADDRESS) Device DMA Channel Address Register (n = 1) Offset */
#define USBHS_DEVDMACONTROL_OFFSET   (0x08)         /**< (USBHS_DEVDMACONTROL) Device DMA Channel Control Register (n = 1) Offset */
#define USBHS_DEVDMASTATUS_OFFSET    (0x0C)         /**< (USBHS_DEVDMASTATUS) Device DMA Channel Status Register (n = 1) Offset */
/** \brief USBHS_HSTDMA register offsets definitions */
#define USBHS_HSTDMANXTDSC_OFFSET    (0x00)         /**< (USBHS_HSTDMANXTDSC) Host DMA Channel Next Descriptor Address Register (n = 1) Offset */
#define USBHS_HSTDMAADDRESS_OFFSET   (0x04)         /**< (USBHS_HSTDMAADDRESS) Host DMA Channel Address Register (n = 1) Offset */
#define USBHS_HSTDMACONTROL_OFFSET   (0x08)         /**< (USBHS_HSTDMACONTROL) Host DMA Channel Control Register (n = 1) Offset */
#define USBHS_HSTDMASTATUS_OFFSET    (0x0C)         /**< (USBHS_HSTDMASTATUS) Host DMA Channel Status Register (n = 1) Offset */
/** \brief USBHS register offsets definitions */
#define USBHS_DEVCTRL_OFFSET         (0x00)         /**< (USBHS_DEVCTRL) Device General Control Register Offset */
#define USBHS_DEVISR_OFFSET          (0x04)         /**< (USBHS_DEVISR) Device Global Interrupt Status Register Offset */
#define USBHS_DEVICR_OFFSET          (0x08)         /**< (USBHS_DEVICR) Device Global Interrupt Clear Register Offset */
#define USBHS_DEVIFR_OFFSET          (0x0C)         /**< (USBHS_DEVIFR) Device Global Interrupt Set Register Offset */
#define USBHS_DEVIMR_OFFSET          (0x10)         /**< (USBHS_DEVIMR) Device Global Interrupt Mask Register Offset */
#define USBHS_DEVIDR_OFFSET          (0x14)         /**< (USBHS_DEVIDR) Device Global Interrupt Disable Register Offset */
#define USBHS_DEVIER_OFFSET          (0x18)         /**< (USBHS_DEVIER) Device Global Interrupt Enable Register Offset */
#define USBHS_DEVEPT_OFFSET          (0x1C)         /**< (USBHS_DEVEPT) Device Endpoint Register Offset */
#define USBHS_DEVFNUM_OFFSET         (0x20)         /**< (USBHS_DEVFNUM) Device Frame Number Register Offset */
#define USBHS_DEVEPTCFG_OFFSET       (0x100)        /**< (USBHS_DEVEPTCFG) Device Endpoint Configuration Register Offset */
#define USBHS_DEVEPTISR_OFFSET       (0x130)        /**< (USBHS_DEVEPTISR) Device Endpoint Status Register Offset */
#define USBHS_DEVEPTICR_OFFSET       (0x160)        /**< (USBHS_DEVEPTICR) Device Endpoint Clear Register Offset */
#define USBHS_DEVEPTIFR_OFFSET       (0x190)        /**< (USBHS_DEVEPTIFR) Device Endpoint Set Register Offset */
#define USBHS_DEVEPTIMR_OFFSET       (0x1C0)        /**< (USBHS_DEVEPTIMR) Device Endpoint Mask Register Offset */
#define USBHS_DEVEPTIER_OFFSET       (0x1F0)        /**< (USBHS_DEVEPTIER) Device Endpoint Enable Register Offset */
#define USBHS_DEVEPTIDR_OFFSET       (0x220)        /**< (USBHS_DEVEPTIDR) Device Endpoint Disable Register Offset */
#define USBHS_HSTCTRL_OFFSET         (0x400)        /**< (USBHS_HSTCTRL) Host General Control Register Offset */
#define USBHS_HSTISR_OFFSET          (0x404)        /**< (USBHS_HSTISR) Host Global Interrupt Status Register Offset */
#define USBHS_HSTICR_OFFSET          (0x408)        /**< (USBHS_HSTICR) Host Global Interrupt Clear Register Offset */
#define USBHS_HSTIFR_OFFSET          (0x40C)        /**< (USBHS_HSTIFR) Host Global Interrupt Set Register Offset */
#define USBHS_HSTIMR_OFFSET          (0x410)        /**< (USBHS_HSTIMR) Host Global Interrupt Mask Register Offset */
#define USBHS_HSTIDR_OFFSET          (0x414)        /**< (USBHS_HSTIDR) Host Global Interrupt Disable Register Offset */
#define USBHS_HSTIER_OFFSET          (0x418)        /**< (USBHS_HSTIER) Host Global Interrupt Enable Register Offset */
#define USBHS_HSTPIP_OFFSET          (0x41C)        /**< (USBHS_HSTPIP) Host Pipe Register Offset */
#define USBHS_HSTFNUM_OFFSET         (0x420)        /**< (USBHS_HSTFNUM) Host Frame Number Register Offset */
#define USBHS_HSTADDR1_OFFSET        (0x424)        /**< (USBHS_HSTADDR1) Host Address 1 Register Offset */
#define USBHS_HSTADDR2_OFFSET        (0x428)        /**< (USBHS_HSTADDR2) Host Address 2 Register Offset */
#define USBHS_HSTADDR3_OFFSET        (0x42C)        /**< (USBHS_HSTADDR3) Host Address 3 Register Offset */
#define USBHS_HSTPIPCFG_OFFSET       (0x500)        /**< (USBHS_HSTPIPCFG) Host Pipe Configuration Register Offset */
#define USBHS_HSTPIPISR_OFFSET       (0x530)        /**< (USBHS_HSTPIPISR) Host Pipe Status Register Offset */
#define USBHS_HSTPIPICR_OFFSET       (0x560)        /**< (USBHS_HSTPIPICR) Host Pipe Clear Register Offset */
#define USBHS_HSTPIPIFR_OFFSET       (0x590)        /**< (USBHS_HSTPIPIFR) Host Pipe Set Register Offset */
#define USBHS_HSTPIPIMR_OFFSET       (0x5C0)        /**< (USBHS_HSTPIPIMR) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIER_OFFSET       (0x5F0)        /**< (USBHS_HSTPIPIER) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIDR_OFFSET       (0x620)        /**< (USBHS_HSTPIPIDR) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPINRQ_OFFSET      (0x650)        /**< (USBHS_HSTPIPINRQ) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPERR_OFFSET       (0x680)        /**< (USBHS_HSTPIPERR) Host Pipe Error Register Offset */
#define USBHS_CTRL_OFFSET            (0x800)        /**< (USBHS_CTRL) General Control Register Offset */
#define USBHS_SR_OFFSET              (0x804)        /**< (USBHS_SR) General Status Register Offset */
#define USBHS_SCR_OFFSET             (0x808)        /**< (USBHS_SCR) General Status Clear Register Offset */
#define USBHS_SFR_OFFSET             (0x80C)        /**< (USBHS_SFR) General Status Set Register Offset */
#define USBHS_TSTA1_OFFSET           (0x810)        /**< (USBHS_TSTA1) General Test A1 Register Offset */
#define USBHS_TSTA2_OFFSET           (0x814)        /**< (USBHS_TSTA2) General Test A2 Register Offset */
#define USBHS_FSM_OFFSET             (0x82C)        /**< (USBHS_FSM) General Finite State Machine Register Offset */

/** \brief USBHS_DEVDMA register API structure */
typedef struct
{
  __IO  __USBHS_DEVDMANXTDSC_bits_t    USBHS_DEVDMANXTDSC; /**< Offset: 0x00 (R/W  32) Device DMA Channel Next Descriptor Address Register (n = 1) */
  __IO  __USBHS_DEVDMAADDRESS_bits_t   USBHS_DEVDMAADDRESS; /**< Offset: 0x04 (R/W  32) Device DMA Channel Address Register (n = 1) */
  __IO  __USBHS_DEVDMACONTROL_bits_t   USBHS_DEVDMACONTROL; /**< Offset: 0x08 (R/W  32) Device DMA Channel Control Register (n = 1) */
  __IO  __USBHS_DEVDMASTATUS_bits_t    USBHS_DEVDMASTATUS; /**< Offset: 0x0C (R/W  32) Device DMA Channel Status Register (n = 1) */
} usbhsdevdma_registers_t;

/** \brief USBHS_HSTDMA register API structure */
typedef struct
{
  __IO  __USBHS_HSTDMANXTDSC_bits_t    USBHS_HSTDMANXTDSC; /**< Offset: 0x00 (R/W  32) Host DMA Channel Next Descriptor Address Register (n = 1) */
  __IO  __USBHS_HSTDMAADDRESS_bits_t   USBHS_HSTDMAADDRESS; /**< Offset: 0x04 (R/W  32) Host DMA Channel Address Register (n = 1) */
  __IO  __USBHS_HSTDMACONTROL_bits_t   USBHS_HSTDMACONTROL; /**< Offset: 0x08 (R/W  32) Host DMA Channel Control Register (n = 1) */
  __IO  __USBHS_HSTDMASTATUS_bits_t    USBHS_HSTDMASTATUS; /**< Offset: 0x0C (R/W  32) Host DMA Channel Status Register (n = 1) */
} usbhshstdma_registers_t;

#define USBHSDEVDMA_NUMBER 7
#define USBHSHSTDMA_NUMBER 7
/** \brief USBHS register API structure */
typedef struct
{
  __IO  __USBHS_DEVCTRL_bits_t         USBHS_DEVCTRL; /**< Offset: 0x00 (R/W  32) Device General Control Register */
  __I   __USBHS_DEVISR_bits_t          USBHS_DEVISR;  /**< Offset: 0x04 (R/   32) Device Global Interrupt Status Register */
  __O   __USBHS_DEVICR_bits_t          USBHS_DEVICR;  /**< Offset: 0x08 ( /W  32) Device Global Interrupt Clear Register */
  __O   __USBHS_DEVIFR_bits_t          USBHS_DEVIFR;  /**< Offset: 0x0C ( /W  32) Device Global Interrupt Set Register */
  __I   __USBHS_DEVIMR_bits_t          USBHS_DEVIMR;  /**< Offset: 0x10 (R/   32) Device Global Interrupt Mask Register */
  __O   __USBHS_DEVIDR_bits_t          USBHS_DEVIDR;  /**< Offset: 0x14 ( /W  32) Device Global Interrupt Disable Register */
  __O   __USBHS_DEVIER_bits_t          USBHS_DEVIER;  /**< Offset: 0x18 ( /W  32) Device Global Interrupt Enable Register */
  __IO  __USBHS_DEVEPT_bits_t          USBHS_DEVEPT;  /**< Offset: 0x1C (R/W  32) Device Endpoint Register */
  __I   __USBHS_DEVFNUM_bits_t         USBHS_DEVFNUM; /**< Offset: 0x20 (R/   32) Device Frame Number Register */
  __I   uint8_t                        Reserved1[0xDC];
  __IO  __USBHS_DEVEPTCFG_bits_t       USBHS_DEVEPTCFG[10]; /**< Offset: 0x100 (R/W  32) Device Endpoint Configuration Register */
  __I   uint8_t                        Reserved2[0x08];
  __I   __USBHS_DEVEPTISR_bits_t       USBHS_DEVEPTISR[10]; /**< Offset: 0x130 (R/   32) Device Endpoint Status Register */
  __I   uint8_t                        Reserved3[0x08];
  __O   __USBHS_DEVEPTICR_bits_t       USBHS_DEVEPTICR[10]; /**< Offset: 0x160 ( /W  32) Device Endpoint Clear Register */
  __I   uint8_t                        Reserved4[0x08];
  __O   __USBHS_DEVEPTIFR_bits_t       USBHS_DEVEPTIFR[10]; /**< Offset: 0x190 ( /W  32) Device Endpoint Set Register */
  __I   uint8_t                        Reserved5[0x08];
  __I   __USBHS_DEVEPTIMR_bits_t       USBHS_DEVEPTIMR[10]; /**< Offset: 0x1C0 (R/   32) Device Endpoint Mask Register */
  __I   uint8_t                        Reserved6[0x08];
  __O   __USBHS_DEVEPTIER_bits_t       USBHS_DEVEPTIER[10]; /**< Offset: 0x1F0 ( /W  32) Device Endpoint Enable Register */
  __I   uint8_t                        Reserved7[0x08];
  __O   __USBHS_DEVEPTIDR_bits_t       USBHS_DEVEPTIDR[10]; /**< Offset: 0x220 ( /W  32) Device Endpoint Disable Register */
  __I   uint8_t                        Reserved8[0xC8];
        usbhsdevdma_registers_t        USBHS_DEVDMA[USBHSDEVDMA_NUMBER]; /**< Offset: 0x310 Device DMA Channel Next Descriptor Address Register (n = 1) */
  __I   uint8_t                        Reserved9[0x80];
  __IO  __USBHS_HSTCTRL_bits_t         USBHS_HSTCTRL; /**< Offset: 0x400 (R/W  32) Host General Control Register */
  __I   __USBHS_HSTISR_bits_t          USBHS_HSTISR;  /**< Offset: 0x404 (R/   32) Host Global Interrupt Status Register */
  __O   __USBHS_HSTICR_bits_t          USBHS_HSTICR;  /**< Offset: 0x408 ( /W  32) Host Global Interrupt Clear Register */
  __O   __USBHS_HSTIFR_bits_t          USBHS_HSTIFR;  /**< Offset: 0x40C ( /W  32) Host Global Interrupt Set Register */
  __I   __USBHS_HSTIMR_bits_t          USBHS_HSTIMR;  /**< Offset: 0x410 (R/   32) Host Global Interrupt Mask Register */
  __O   __USBHS_HSTIDR_bits_t          USBHS_HSTIDR;  /**< Offset: 0x414 ( /W  32) Host Global Interrupt Disable Register */
  __O   __USBHS_HSTIER_bits_t          USBHS_HSTIER;  /**< Offset: 0x418 ( /W  32) Host Global Interrupt Enable Register */
  __IO  __USBHS_HSTPIP_bits_t          USBHS_HSTPIP;  /**< Offset: 0x41C (R/W  32) Host Pipe Register */
  __IO  __USBHS_HSTFNUM_bits_t         USBHS_HSTFNUM; /**< Offset: 0x420 (R/W  32) Host Frame Number Register */
  __IO  __USBHS_HSTADDR1_bits_t        USBHS_HSTADDR1; /**< Offset: 0x424 (R/W  32) Host Address 1 Register */
  __IO  __USBHS_HSTADDR2_bits_t        USBHS_HSTADDR2; /**< Offset: 0x428 (R/W  32) Host Address 2 Register */
  __IO  __USBHS_HSTADDR3_bits_t        USBHS_HSTADDR3; /**< Offset: 0x42C (R/W  32) Host Address 3 Register */
  __I   uint8_t                        Reserved10[0xD0];
  __IO  __USBHS_HSTPIPCFG_bits_t       USBHS_HSTPIPCFG[10]; /**< Offset: 0x500 (R/W  32) Host Pipe Configuration Register */
  __I   uint8_t                        Reserved11[0x08];
  __I   __USBHS_HSTPIPISR_bits_t       USBHS_HSTPIPISR[10]; /**< Offset: 0x530 (R/   32) Host Pipe Status Register */
  __I   uint8_t                        Reserved12[0x08];
  __O   __USBHS_HSTPIPICR_bits_t       USBHS_HSTPIPICR[10]; /**< Offset: 0x560 ( /W  32) Host Pipe Clear Register */
  __I   uint8_t                        Reserved13[0x08];
  __O   __USBHS_HSTPIPIFR_bits_t       USBHS_HSTPIPIFR[10]; /**< Offset: 0x590 ( /W  32) Host Pipe Set Register */
  __I   uint8_t                        Reserved14[0x08];
  __I   __USBHS_HSTPIPIMR_bits_t       USBHS_HSTPIPIMR[10]; /**< Offset: 0x5C0 (R/   32) Host Pipe Mask Register */
  __I   uint8_t                        Reserved15[0x08];
  __O   __USBHS_HSTPIPIER_bits_t       USBHS_HSTPIPIER[10]; /**< Offset: 0x5F0 ( /W  32) Host Pipe Enable Register */
  __I   uint8_t                        Reserved16[0x08];
  __O   __USBHS_HSTPIPIDR_bits_t       USBHS_HSTPIPIDR[10]; /**< Offset: 0x620 ( /W  32) Host Pipe Disable Register */
  __I   uint8_t                        Reserved17[0x08];
  __IO  __USBHS_HSTPIPINRQ_bits_t      USBHS_HSTPIPINRQ[10]; /**< Offset: 0x650 (R/W  32) Host Pipe IN Request Register */
  __I   uint8_t                        Reserved18[0x08];
  __IO  __USBHS_HSTPIPERR_bits_t       USBHS_HSTPIPERR[10]; /**< Offset: 0x680 (R/W  32) Host Pipe Error Register */
  __I   uint8_t                        Reserved19[0x68];
        usbhshstdma_registers_t        USBHS_HSTDMA[USBHSHSTDMA_NUMBER]; /**< Offset: 0x710 Host DMA Channel Next Descriptor Address Register (n = 1) */
  __I   uint8_t                        Reserved20[0x80];
  __IO  __USBHS_CTRL_bits_t            USBHS_CTRL;    /**< Offset: 0x800 (R/W  32) General Control Register */
  __I   __USBHS_SR_bits_t              USBHS_SR;      /**< Offset: 0x804 (R/   32) General Status Register */
  __O   __USBHS_SCR_bits_t             USBHS_SCR;     /**< Offset: 0x808 ( /W  32) General Status Clear Register */
  __O   __USBHS_SFR_bits_t             USBHS_SFR;     /**< Offset: 0x80C ( /W  32) General Status Set Register */
  __IO  __USBHS_TSTA1_bits_t           USBHS_TSTA1;   /**< Offset: 0x810 (R/W  32) General Test A1 Register */
  __IO  __USBHS_TSTA2_bits_t           USBHS_TSTA2;   /**< Offset: 0x814 (R/W  32) General Test A2 Register */
  __I   uint8_t                        Reserved21[0x14];
  __I   __USBHS_FSM_bits_t             USBHS_FSM;     /**< Offset: 0x82C (R/   32) General Finite State Machine Register */
} usbhs_registers_t;
/** @}  end of USB High-Speed Interface */

#endif /* _PIC32CZ_CA70_USBHS_COMPONENT_H_ */
